
&НаКлиенте
Процедура РассчитатьЦены(Команда)
	
	Если Не ЗначениеЗаполнено(ЦенаЗаГрамм) Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не указана цена за грамм");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипЦены) Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не указан тип цены");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Валюта) Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не указана валюта");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("ЦенаЗаГрамм", ЦенаЗаГрамм);
	ПараметрыЗакрытия.Вставить("СуммаПрибавления", СуммаПрибавления);
	ПараметрыЗакрытия.Вставить("ТипЦены", ТипЦены);
	ПараметрыЗакрытия.Вставить("Валюта", Валюта);
	ПараметрыЗакрытия.Вставить("ПроцентСкидкиНаценки", ПроцентСкидкиНаценки);
	ПараметрыЗакрытия.Вставить("ЗаполнитьПроцентСкидки", ЗаполнитьПроцентСкидки);
	ПараметрыЗакрытия.Вставить("ЗаполнитьРазмерыИзСерий", ЗаполнитьРазмерыИзСерий);
	ПараметрыЗакрытия.Вставить("ТипПоискаСерий", ТипПоискаСерий);
	ПараметрыЗакрытия.Вставить("ЗаполнитьСерииНоменклатуры", ЗаполнитьСерииНоменклатуры);
	ПараметрыЗакрытия.Вставить("УчитыватьРазмерПриЗамене", УчитыватьРазмерПриЗамене);
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Валюта = Справочники.Валюты.НайтиПоКоду("643");
	ТипЦены = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00005");
	ЦенаЗаГрамм = 2050;
	СуммаПрибавления = 150;
	ЗаполнитьПроцентСкидки = Ложь;
	ЗаполнитьСерииНоменклатуры = Истина;
	ЭтотОбъект.Элементы.ПроцентСкидкиНаценки.Доступность = Ложь;
	ТипПоискаСерий = 0;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроцентСкидкиПриИзменении(Элемент)
	ЭтотОбъект.Элементы.ПроцентСкидкиНаценки.Доступность = ЗаполнитьПроцентСкидки; 
КонецПроцедуры
