
&НаКлиенте
&ИзменениеИКонтроль("ТаблицаПродажиТоваровДобавить")
Процедура B1_ТаблицаПродажиТоваровДобавить(Инвентаризация, Строка)
	Если Строка = Неопределено Тогда
		Строка = ОстаткиПоШК[0];
	КонецЕсли;
	Если Строка <> Неопределено Тогда

		#Вставка
		МассивСтрок = Новый Массив;
		Если ТипЗнч(Строка) = Тип("Структура") Тогда 
			МассивСтрок.Добавить(Строка);
		ИначеЕсли ТипЗнч(Строка) = Тип("Массив") Тогда 
			МассивСтрок = Строка;
		КонецЕсли;
		Для Каждого Строка Из МассивСтрок Цикл
		#КонецВставки
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("СерияНоменклатуры", Строка.СерияНоменклатуры);
		Отбор.Вставить("ХарактеристикаНоменклатуры", Строка.ХарактеристикаНоменклатуры);
		Отбор.Вставить("Размер", Строка.Размер);
		Отбор.Вставить("КлючПродажи", Строка.КлючПродажи);

		НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);

		ЭтоДрагМеталл	= (ТипЗнч(Строка.Номенклатура) = ПредопределенноеЗначение(
			"Справочник.ТипыДрагоценныхМеталлов.ПустаяСсылка"));

		ВидНоменклатуры = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Строка.Номенклатура, "ВидНоменклатуры");

		НеУчитыватьВес = Ложь;
		Если ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Товар") Или ВидНоменклатуры
			= ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Бижутерия") Тогда
			НеУчитыватьВес = Истина;
		КонецЕсли;

		Если ЭтоДрагМеталл Или НайденныеСтроки.Количество() = 0 Или НеУчитыватьВес Тогда

			Количество       = Строка.Количество;
			ВесСтроки        = Строка.Вес;  // Вес - реквизит формы
			Стоимость        = Строка.Стоимость;
			СтоимостьБезНДС  = Строка.СтоимостьБезНДС;
			СуммаПоступления = Строка.СуммаПоступления;

			Если ЭтоДрагМеталл = Ложь И НеУчитыватьВес И Количество > 1 Тогда
				ВвестиКоличество(Количество, Строка, Ложь);
				Возврат;

			ИначеЕсли (ЭтоДрагМеталл И Не ЗначениеЗаполнено(Строка.СерияНоменклатуры)) Или ВидНоменклатуры = ПредопределенноеЗначение(
				"Перечисление.ВидыНоменклатуры.Лигатура") Тогда
				ВвестиКоличество(ВесСтроки, Строка, Истина);
				Возврат;

			КонецЕсли;
			Если ТипЗнч(Строка) = Тип("Структура") Тогда
				ЗаполнитьСтрокуНаСервере(Количество, ВесСтроки, Стоимость, СтоимостьБезНДС, СуммаПоступления, 
					0, Строка);
			Иначе
				ЗаполнитьСтрокуНаСервере(Количество, ВесСтроки, Стоимость, СтоимостьБезНДС, СуммаПоступления,
					0, Строка.ПолучитьИдентификатор());
			КонецЕсли;	

		Иначе

			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Нстр("ru='Товар ""';en='The item ""'")
				+ Строка.Номенклатура + Нстр("ru='"" с штрих-кодом ""';en='"" with a barcode ""'") + СокрЛП(
				Строка.СерияНоменклатуры) + Нстр("ru='"" уже подобран.';en='"" is already selected.'"));

		КонецЕсли;
		#Вставка
		КонецЦикла;
		#КонецВставки

	КонецЕсли;

	Штрихкод = "";

КонецПроцедуры
