
&НаКлиенте
Процедура ЗполнитьТаблицу(Команда)
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не выбран склад");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыбранныйПериод.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не указан конец периода");
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ВыбранныйПериод.ДатаНачала) И ВыбранныйПериод.ДатаНачала > ВыбранныйПериод.ДатаОкончания Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Дата окончания периода больше даты начала");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("Склад", Склад);
	ПараметрыЗакрытия.Вставить("ВыбранныйПериод", ВыбранныйПериод);
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);

КонецПроцедуры

