
&НаСервере
&ИзменениеИКонтроль("ПолучитьНастройкиСКД")
Процедура B1_ПолучитьНастройкиСКД(Перезаполнить)

	Если Параметры.Ключ.Пустая() Или Перезаполнить Тогда
		#Удаление
		СхемаСКД = Документы.ВводОстатковАгрегированныхПартий.ПолучитьМакет("НастройкиЗаполненияНачальныхОстатков");
		#КонецУдаления
		#Вставка
		СхемаСКД = Документы.ВводОстатковАгрегированныхПартий.ПолучитьМакет("НастройкиЗаполненияНачальныхОстатковИзм");
		#КонецВставки
		НастройкиПоУмолчанию = СхемаСКД.НастройкиПоУмолчанию;
	Иначе
		СхемаСКД = РеквизитФормыВЗначение("Объект").НастройкиЗаполнения.Получить();
		Если СхемаСКД = Неопределено Тогда
			#Удаление
			СхемаСКД = Документы.ВводОстатковАгрегированныхПартий.ПолучитьМакет("НастройкиЗаполненияНачальныхОстатков");
			#КонецУдаления
			#Вставка
			СхемаСКД = Документы.ВводОстатковАгрегированныхПартий.ПолучитьМакет("НастройкиЗаполненияНачальныхОстатковИзм");
			#КонецВставки
			НастройкиПоУмолчанию = СхемаСКД.НастройкиПоУмолчанию;
		Иначе
			НастройкиПоУмолчанию = СхемаСКД.НастройкиПоУмолчанию;
			НовоеПолеВыбор = НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			НовоеПолеВыбор.Поле = Новый ПолеКомпоновкиДанных("ВесКамней");
			Использование = Истина;

			НовоеПолеВыбор = НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			НовоеПолеВыбор.Поле = Новый ПолеКомпоновкиДанных("КоличествоКамней");
			Использование = Истина;
			
			#Удаление
			СхемаСКД = Документы.ВводОстатковАгрегированныхПартий.ПолучитьМакет("НастройкиЗаполненияНачальныхОстатков");
			#КонецУдаления
			#Вставка
			СхемаСКД = Документы.ВводОстатковАгрегированныхПартий.ПолучитьМакет("НастройкиЗаполненияНачальныхОстатковИзм");
			#КонецВставки
		КонецЕсли;
	КонецЕсли;

	АдресСхемаСКД = ПоместитьВоВременноеХранилище(СхемаСКД, УникальныйИдентификатор);

	Попытка
		ОтборыСКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемаСКД));
	Исключение
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(
			"Не удалось инициализировать отборы скд для настроек заполнения");
	КонецПопытки;

	ОтборыСКД.ЗагрузитьНастройки(НастройкиПоУмолчанию);

	ОтборыСКД.Восстановить();

КонецПроцедуры

