
&НаСервере
&ИзменениеИКонтроль("ПолучитьНастройкиСКД")
Процедура B1_ПолучитьНастройкиСКД(Перезаполнить)

	#Удаление
	ИмяМакета = ?(Объект.ВариантРегистрации = 0, "НастройкиЗаполненияНачальныхОстатков", "НастройкиЗаполненияНачальныхОстатковБезАгрегированныхПартий");
	#КонецУдаления
	#Вставка
	ИмяМакета = ?(Объект.ВариантРегистрации = 0, "НастройкиЗаполненияНачальныхОстатковИзм", "НастройкиЗаполненияНачальныхОстатковБезАгрегированныхПартийИзм");
	#КонецВставки	
	Если Параметры.Ключ.Пустая() Или Перезаполнить Тогда
		СхемаСКД = Документы.ПрисвоениеУИНОстаткам.ПолучитьМакет(ИмяМакета);
	Иначе
		СхемаСКД = РеквизитФормыВЗначение("Объект").НастройкиЗаполнения.Получить();
		Если СхемаСКД = Неопределено Тогда
			СхемаСКД = Документы.ПрисвоениеУИНОстаткам.ПолучитьМакет(ИмяМакета);
		КонецЕсли;
	КонецЕсли;

	АдресСхемаСКД = ПоместитьВоВременноеХранилище(СхемаСКД, УникальныйИдентификатор);

	Попытка
		ОтборыСКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемаСКД));
	Исключение
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(
		"Не удалось инициализировать отборы скд для настроек заполнения");
	КонецПопытки;

	ОтборыСКД.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);

	ОтборыСКД.Восстановить();

КонецПроцедуры
