
&ИзменениеИКонтроль("ПодготовитьДанныеSendBatchИНП")
Функция B1_ПодготовитьДанныеSendBatchИНП(ИсходныеДанные, Документ)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(СписокСерий.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                      |	ВЫРАЗИТЬ(СписокСерий.ТипИзделия КАК Справочник.ТипыИзделий) КАК ТипИзделия,
	                      |	ВЫРАЗИТЬ(СписокСерий.Проба КАК Справочник.Пробы) КАК Проба,
	                      |	ВЫРАЗИТЬ(СписокСерий.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(СписокСерий.Организация КАК Справочник.Организации) КАК Организация,
	                      |	ВЫРАЗИТЬ(СписокСерий.Производитель КАК Справочник.Контрагенты) КАК Производитель,
	                      |	ВЫРАЗИТЬ(СписокСерий.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	                      |	ВЫРАЗИТЬ(СписокСерий.СтатусПартии КАК Перечисление.СтатусыПартийТоваров) КАК СтатусПартии,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВидНоменклатуры КАК Перечисление.ВидыНоменклатуры) КАК ВидНоменклатуры,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВидПартииМеталла КАК Справочник.ВидыПартийГИИС) КАК ВидПартииМеталла,
	                      |	ВЫРАЗИТЬ(СписокСерий.ОКПД2 КАК Справочник.ОКПД2) КАК ОКПД2,
	                      |	ВЫРАЗИТЬ(СписокСерий.Количество КАК ЧИСЛО(6, 0)) КАК Количество,
	                      |	ВЫРАЗИТЬ(СписокСерий.КоличествоДК КАК ЧИСЛО(8, 0)) КАК КоличествоДК,
	                      |	ВЫРАЗИТЬ(СписокСерий.КоличествоНеДК КАК ЧИСЛО(8, 0)) КАК КоличествоНеДК,
	                      |	ВЫРАЗИТЬ(СписокСерий.Вес КАК ЧИСЛО(15, 3)) КАК Вес,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВесДК КАК ЧИСЛО(15, 3)) КАК ВесДК,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВесНеДК КАК ЧИСЛО(15, 3)) КАК ВесНеДК,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВесМеталлаВЧистоте КАК ЧИСЛО(15, 3)) КАК ВесМеталлаВЧистоте,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВесМеталлаВПробе КАК ЧИСЛО(15, 3)) КАК ВесМеталлаВПробе,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВариантАгрегирования КАК ЧИСЛО(1, 0)) КАК ВариантАгрегирования,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВводОстатков КАК БУЛЕВО) КАК ВводОстатков,
	                      |	ВЫРАЗИТЬ(СписокСерий.КлючСвязи КАК ЧИСЛО(5, 0)) КАК КлючСвязи,
	                      |	СписокСерий.НомерСтроки КАК НомерСтроки,
	                      |	СписокСерий.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти
	                      |ПОМЕСТИТЬ СписокСерий
	                      |ИЗ
	                      |	&СписокСерий КАК СписокСерий
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокСерий.СерияНоменклатуры КАК СерияНоменклатуры,
	                      |	СписокСерий.ВидНоменклатуры КАК ВидНоменклатуры,
	                      |	СписокСерий.ВводОстатков КАК ВводОстатков,
	                      |	СписокСерий.ОКПД2.Код КАК ОКПД2,
	                      |	СписокСерий.Контрагент КАК Поставщик,
	                      |	СписокСерий.Организация КАК Организация,
	                      |	СписокСерий.СтатусПартии КАК СтатусПартии,
	                      |	СписокСерий.Количество КАК Количество,
	                      |	СписокСерий.КоличествоДК КАК КоличествоДК,
	                      |	СписокСерий.Вес КАК Вес,
	                      |	СписокСерий.ВесДК КАК ВесДК,
	                      |	СписокСерий.Проба КАК Проба,
	                      |	СписокСерий.Проба.Металл КАК Металл,
	                      |	СписокСерий.Проба.Проба КАК ПробаЧисло,
	                      |	СписокСерий.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                      |	"""" КАК ТНВЭД,
	                      |	СписокСерий.ВидПартииМеталла.Код КАК ВидПартииМеталла,
	                      |	СписокСерий.Контрагент.ИНН КАК ПоставщикИНН,
	                      |	СписокСерий.Контрагент.КПП КАК ПоставщикКПП,
	                      |	СписокСерий.Контрагент.ОГРН КАК ПоставщикОГРН,
	                      |	СписокСерий.Контрагент.ЮрФизЛицо КАК ПоставщикЮрФизЛицо,
	                      |	СписокСерий.Производитель.ИНН КАК ПроизводительИНН,
	                      |	СписокСерий.Производитель.КПП КАК ПроизводительКПП,
	                      |	СписокСерий.Производитель.ОГРН КАК ПроизводительОГРН,
	                      |	СписокСерий.Производитель.ЮрФизЛицо КАК ПроизводительЮрФизЛицо,
	                      |	СписокСерий.Организация.ИНН КАК ОрганизацияИНН,
	                      |	СписокСерий.Организация.КПП КАК ОрганизацияКПП,
	                      |	СписокСерий.Организация.ОГРН КАК ОрганизацияОГРН,
	                      |	СписокСерий.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                      |	СписокСерий.СерияНоменклатуры.Наименование КАК ШК,
	                      |	СписокСерий.СерияНоменклатуры.НомерПаспорта КАК ШтрихкодПоставщика,
	                      |	СписокСерий.СерияНоменклатуры.Размер КАК Размер,
	                      |	СписокСерий.СерияНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                      |	СписокСерий.ВариантАгрегирования КАК ВариантАгрегирования,
	                      |	СписокСерий.ТипИзделия КАК ТипИзделия,
	                      |	СписокСерий.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(СписокСерий.Номенклатура.Артикул, """") КАК Артикул,
	                      |	СписокСерий.НомерСтроки КАК НомерСтроки,
	                      |	СписокСерий.КлючСвязи КАК КлючСвязи,
	                      |	СписокСерий.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                      |	ЕСТЬNULL(СписокСерий.ТипИзделия.Наименование, """") КАК ТипИзделияНаименование,
	                      |	ЕСТЬNULL(СписокСерий.ТипИзделия.НаименованиеГИИСДМДК, """") КАК ТипИзделияНаименованиеГИИСДМДК,
	                      |	ЕСТЬNULL(СписокСерий.ТипИзделия.НаименованиеГИИСДМДКВоМножественномЧисле, ЛОЖЬ) КАК ТипИзделияВоМножественномЧисле,
	                      |	ЕСТЬNULL(СписокСерий.ТипИзделия.РодНаименованияГИИСДМДК, ЗНАЧЕНИЕ(Перечисление.РодаИменСуществительных.ПустаяСсылка)) КАК ТипИзделияРодНаименования,
	                      |	СписокСерий.ВесМеталлаВПробе КАК ВесМеталлаВПробе,
	                      |	СписокСерий.КоличествоНеДК КАК КоличествоНеДК,
	                      |	СписокСерий.ВесНеДК КАК ВесНеДК
	                      |ИЗ
	                      |	СписокСерий КАК СписокСерий
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыВводОстатковПартийДляГИИСДМДК.КлючСвязи КАК КлючСвязи,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал КАК Материал,
	                      |	СУММА(ХарактеристикиНоменклатурыДополнительныеМатериалы.Вес) КАК Вес,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл КАК Металл,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба КАК Проба
	                      |ИЗ
	                      |	РегистрСведений.ТоварыВводОстатковПартийДляГИИСДМДК КАК ТоварыВводОстатковПартийДляГИИСДМДК
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеМатериалы КАК ХарактеристикиНоменклатурыДополнительныеМатериалы
	                      |		ПО ТоварыВводОстатковПартийДляГИИСДМДК.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатурыДополнительныеМатериалы.Ссылка
	                      |ГДЕ
	                      |	ТоварыВводОстатковПартийДляГИИСДМДК.Регистратор = &Регистратор
	                      |	И ТоварыВводОстатковПартийДляГИИСДМДК.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВводОстатковПартийДляГИИСДМДК.КлючСвязи,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба");
	ТаблицаПартий = МассивСтруктурВТаблицуПартий(ИсходныеДанные);
	Запрос.УстановитьПараметр("СписокСерий", ТаблицаПартий);
	Запрос.УстановитьПараметр("Регистратор", Документ);
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	ДанныеПоДопПробе = Результат[2].Выгрузить();
	МассивСтрок = Новый Массив;
	МассивОшибок = Новый Массив;
	
	ДанныеПоКамням = Новый ТаблицаЗначений; 
	
	ПоискТоваровПоВнутреннемуШК = Константы.ПоискТоваровПоВнутреннемуШК.Получить();
	ПоискТоваровПоПаспорту = Константы.ПоискТоваровПоПаспорту.Получить();
	
	Пока Выборка.Следующий() Цикл
		ОписаниеОшибки = "";
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ВводОстатков", Выборка.ВводОстатков);
		СтруктураСтроки.Вставить("НомерСтроки", Выборка.НомерСтроки);
		
		Если Выборка.ВариантАгрегирования = 0 Тогда
			
			ПараметрыНаименования = Новый Структура;
			ПараметрыНаименования.Вставить("НаименованиеГИИИСДМДК", "Изделия");
			ПараметрыНаименования.Вставить("Наименование", "Изделия");
			ПараметрыНаименования.Вставить("Металл", Выборка.Металл);
			ПараметрыНаименования.Вставить("ПробаЧисло", Выборка.ПробаЧисло);
			ПараметрыНаименования.Вставить("МножественноеЧисло", Истина);
			ПараметрыНаименования.Вставить("Род", Перечисления.РодаИменСуществительных.ПустаяСсылка());
			ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", "");
			ПараметрыНаименования.Вставить("ШтрихкодПоставщика", "");
			ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", Ложь);
			ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", Ложь);
			
			Наименование = НаименованиеЮвелирногоИзделия(ПараметрыНаименования);
						
			ПолноеНаименование = Наименование;
			
		ИначеЕсли Выборка.ВариантАгрегирования = 1 Тогда
						
			ПараметрыНаименования = Новый Структура;
			ПараметрыНаименования.Вставить("НаименованиеГИИИСДМДК", Выборка.ТипИзделияНаименованиеГИИСДМДК);
			ПараметрыНаименования.Вставить("Наименование", Выборка.ТипИзделияНаименование);
			ПараметрыНаименования.Вставить("Металл", Выборка.Металл);
			ПараметрыНаименования.Вставить("ПробаЧисло", Выборка.ПробаЧисло);
			ПараметрыНаименования.Вставить("МножественноеЧисло", Выборка.ТипИзделияВоМножественномЧисле);
			ПараметрыНаименования.Вставить("Род", Выборка.ТипИзделияРодНаименования);
			ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", "");
			ПараметрыНаименования.Вставить("ШтрихкодПоставщика", "");
			ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", Ложь);
			ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", Ложь);
			
			Наименование = НаименованиеЮвелирногоИзделия(ПараметрыНаименования);
			
			ПолноеНаименование = Наименование;
			
		ИначеЕсли Выборка.ВариантАгрегирования = 2 Тогда	
						
			ПараметрыНаименования = Новый Структура;
			ПараметрыНаименования.Вставить("НаименованиеГИИИСДМДК", Выборка.ТипИзделияНаименованиеГИИСДМДК);
			ПараметрыНаименования.Вставить("Наименование", Выборка.ТипИзделияНаименование);
			ПараметрыНаименования.Вставить("Металл", Выборка.Металл);
			ПараметрыНаименования.Вставить("ПробаЧисло", Выборка.ПробаЧисло);
			ПараметрыНаименования.Вставить("МножественноеЧисло", Выборка.ТипИзделияВоМножественномЧисле);
			ПараметрыНаименования.Вставить("Род", Выборка.ТипИзделияРодНаименования);
			ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", "");
			ПараметрыНаименования.Вставить("ШтрихкодПоставщика", "");
			ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", Ложь);
			ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", Ложь);
			
			Наименование = НаименованиеЮвелирногоИзделия(ПараметрыНаименования);
			
			ПараметрыОписания = Новый Структура;
			ПараметрыОписания.Вставить("Артикул", Выборка.Артикул);
			ПараметрыОписания.Вставить("Размер", Справочники.Размер.ПустаяСсылка());
			ПараметрыОписания.Вставить("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			
			ПолноеНаименование = ОписаниеЮвелирногоИзделия(ПараметрыОписания);
			
		ИначеЕсли Выборка.ВариантАгрегирования = 3 Тогда	
				
			ПараметрыНаименования = Новый Структура;
			ПараметрыНаименования.Вставить("НаименованиеГИИИСДМДК", Выборка.ТипИзделияНаименованиеГИИСДМДК);
			ПараметрыНаименования.Вставить("Наименование", Выборка.ТипИзделияНаименование);
			ПараметрыНаименования.Вставить("Металл", Выборка.Металл);
			ПараметрыНаименования.Вставить("ПробаЧисло", Выборка.ПробаЧисло);
			ПараметрыНаименования.Вставить("МножественноеЧисло", Выборка.ТипИзделияВоМножественномЧисле);
			ПараметрыНаименования.Вставить("Род", Выборка.ТипИзделияРодНаименования);
			ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", Выборка.ШК);
			ПараметрыНаименования.Вставить("ШтрихкодПоставщика", Выборка.ШтрихкодПоставщика);
			ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
			ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
			
			Наименование = НаименованиеЮвелирногоИзделия(ПараметрыНаименования);
			
			ПараметрыОписания = Новый Структура;
			ПараметрыОписания.Вставить("Артикул", Выборка.Артикул);
			ПараметрыОписания.Вставить("Размер", Выборка.Размер);
			ПараметрыОписания.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
			
			ПолноеНаименование = ОписаниеЮвелирногоИзделия(ПараметрыОписания);
			
		КонецЕсли;
		
		СтруктураСтроки.Вставить("Наименование", Лев(Наименование, 100));
		СтруктураСтроки.Вставить("НаименованиеПолное", Лев(ПолноеНаименование, 250));	
		СтруктураСтроки.Вставить("ТипПартии", "PREPACK");
		СтруктураСтроки.Вставить("ВидПартии","PREPACK_PRODUCT");
		СтруктураСтроки.Вставить("ЭтапОбработки", ПолучитьЭтапОбработки());
		СтруктураСтроки.Вставить("СтадияОбработки", ПолучитьСтадиюОбработки());
		СтруктураСтроки.Вставить("Статус", "STORING");
		СтруктураСтроки.Вставить("ОКПД2", Выборка.ОКПД2);
		#Вставка
		Если Не ЗначениеЗаполнено(СтруктураСтроки.ОКПД2) Тогда
		#КонецВставки
		#Удаление
		Если СтруктураСтроки.ОКПД2 = "" Тогда
		#КонецУдаления
			МассивОшибок.Добавить("Не заполнено ОКПД2 для серии " + Выборка.СерияНоменклатуры);
		КонецЕсли;

		СтруктураПроизводителя = Новый Структура;
		//Если Выборка.ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		//	СтруктураПроизводителя.Вставить("ТипКонтрагента", "legal");
		//	Если Выборка.ПроизводительКПП = "" Тогда
		//		МассивОшибок.Добавить("Не заполнен КПП производителя для серии " + Выборка.СерияНоменклатуры);
		//	КонецЕсли;	
		//	Если Выборка.ПроизводительОГРН = "" Тогда
		//		МассивОшибок.Добавить("Не заполнен ОГРН производителя для серии " + Выборка.СерияНоменклатуры);
		//	КонецЕсли;
		//	СтруктураПроизводителя.Вставить("ИНН", Выборка.ПроизводительИНН);
		//	СтруктураПроизводителя.Вставить("КПП", Выборка.ПроизводительКПП);
		//	СтруктураПроизводителя.Вставить("ОГРН", Выборка.ПроизводительОГРН);
		//ИначеЕсли Выборка.ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		//	СтруктураПроизводителя.Вставить("ТипКонтрагента", "physical");
		//	Если Выборка.ПроизводительОГРН = "" Тогда
		//		МассивОшибок.Добавить("Не заполнен ОГРН производителя для серии " + Выборка.СерияНоменклатуры);
		//	КонецЕсли;
		//	СтруктураПроизводителя.Вставить("ИНН", Выборка.ПроизводительИНН);
		//	СтруктураПроизводителя.Вставить("КПП", Выборка.ПроизводительКПП);
		//	СтруктураПроизводителя.Вставить("ОГРН", Выборка.ПроизводительОГРН);
		//Иначе
		#Вставка
		Если Выборка.ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПроизводителя.Вставить("ТипКонтрагента", "legal");
			Если Не ЗначениеЗаполнено(Выборка.ПроизводительКПП) Тогда
				МассивОшибок.Добавить("Не заполнен КПП производителя");
			КонецЕсли;	
		ИначеЕсли Выборка.ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураПроизводителя.Вставить("ТипКонтрагента", "physical");
		Иначе
			МассивОшибок.Добавить("Не заполнен тип контрагента производителя")	
		КонецЕсли;
		СтруктураПроизводителя.Вставить("ИНН", Выборка.ПроизводительИНН);
		Если Выборка.ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПроизводителя.Вставить("КПП", Выборка.ПроизводительКПП);
		Иначе
			СтруктураПроизводителя.Вставить("КПП", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ПроизводительОГРН) Тогда
			СтруктураПроизводителя.Вставить("ОГРН", Число(Выборка.ПроизводительОГРН));	
		Иначе
			СтруктураПроизводителя.Вставить("ОГРН", "");
			МассивОшибок.Добавить("Не заполнен ОГРН производителя");
		КонецЕсли;
		#КонецВставки
		#Удаление
			СтруктураПроизводителя.Вставить("ТипКонтрагента", "legal");
			СтруктураПроизводителя.Вставить("КПП", "000000000");
			СтруктураПроизводителя.Вставить("ОГРН", "0000000000000");
		#КонецУдаления
		//КонецЕсли;
		
		СтруктураСтроки.Вставить("Производитель", СтруктураПроизводителя);
		
		СтруктураПоставщика = Новый Структура;
		Если Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПоставщика.Вставить("ТипКонтрагента", "legal");
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ПоставщикКПП) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ПоставщикКПП = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен КПП поставщика для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ПоставщикОГРН) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ПоставщикОГРН = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен ОГРН поставщика для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
		ИначеЕсли Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураПоставщика.Вставить("ТипКонтрагента", "physical");
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ПоставщикОГРН) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ПоставщикОГРН = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен ОГРН поставщика для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
		КонецЕсли;
		СтруктураПоставщика.Вставить("ИНН", Выборка.ПоставщикИНН);
		Если Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПоставщика.Вставить("КПП", Выборка.ПоставщикКПП);
		Иначе
			СтруктураПоставщика.Вставить("КПП", "");
		КонецЕсли;	
		#Вставка
		Если ЗначениеЗаполнено(Выборка.ПоставщикОГРН) Тогда
			СтруктураПоставщика.Вставить("ОГРН", Число(Выборка.ПоставщикОГРН));	
		Иначе
			СтруктураПоставщика.Вставить("ОГРН", "");
		КонецЕсли;
		#КонецВставки
		#Удаление
		СтруктураПоставщика.Вставить("ОГРН", Выборка.ПоставщикОГРН);
		#КонецУдаления
		
		СтруктураОрганизации = Новый Структура;
		Если Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураОрганизации.Вставить("ТипКонтрагента", "legal");
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ОрганизацияКПП) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ОрганизацияКПП = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен КПП организации для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ОрганизацияОГРН) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ОрганизацияОГРН = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен ОГРН организации для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
		ИначеЕсли Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураОрганизации.Вставить("ТипКонтрагента", "physical");
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ОрганизацияОГРН) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ОрганизацияОГРН = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен ОГРН организации для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
		КонецЕсли;
		СтруктураОрганизации.Вставить("ИНН", Выборка.ОрганизацияИНН);
		Если Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураОрганизации.Вставить("КПП", Выборка.ОрганизацияКПП);
		Иначе
			СтруктураОрганизации.Вставить("КПП", "");
		КонецЕсли;
		#Вставка
		Если ЗначениеЗаполнено(Выборка.ОрганизацияОГРН) Тогда
			СтруктураОрганизации.Вставить("ОГРН", Число(Выборка.ОрганизацияОГРН));	
		Иначе
			СтруктураОрганизации.Вставить("ОГРН", "");
		КонецЕсли;
		#КонецВставки
		#Удаление
		СтруктураОрганизации.Вставить("ОГРН", Выборка.ОрганизацияОГРН);
		#КонецУдаления
		
		Если Выборка.СтатусПартии = Перечисления.СтатусыПартийТоваров.НаКомиссию Тогда
			СтруктураСтроки.Вставить("Собственник", СтруктураПоставщика);
		Иначе
			СтруктураСтроки.Вставить("Собственник", СтруктураОрганизации);
		КонецЕсли;
		СтруктураСтроки.Вставить("Владелец", СтруктураОрганизации);
		СтруктураСтроки.Вставить("Количество", Выборка.Количество);
		СтруктураСтроки.Вставить("Вес", Выборка.Вес*100000);
		СтруктураСтроки.Вставить("ЕдиницаИзмерения", "GRM");
					
		СтруктураПартии = Новый Структура;
		СтруктураПартии.Вставить("ВидОсновногоМеталла", ПолучитьМеталлПартии(Выборка.Металл));
		Если СтруктураПартии.ВидОсновногоМеталла = "No" Тогда
			МассивОшибок.Добавить("Не определен вид металла для серии " + Выборка.СерияНоменклатуры);
		КонецЕсли;
		СтруктураПартии.Вставить("Металл", ПолучитьМеталлПартии(Выборка.Металл));
		СтруктураПартии.Вставить("Проба", Выборка.ПробаЧисло*100);
		Если СтруктураПартии.Проба = 0 Тогда
			МассивОшибок.Добавить("Не заполнена проба для серии " + Выборка.СерияНоменклатуры);
		КонецЕсли;
		
		СтруктураПартии.Вставить("ПробаПодтвержденная", Выборка.ПробаЧисло*100);
		МассивСплавов = Новый Массив;
		СтруктураМеталла = Новый Структура;
		СтруктураМеталла.Вставить("Металл", ПолучитьМеталлПартии(Выборка.Металл));
		СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", Выборка.ВесМеталлаВЧистоте * 100000);
		МассивСплавов.Добавить(СтруктураМеталла);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("КлючСвязи", Выборка.КлючСвязи);
		ЕстьСтрокиСХарактеристикой = ДанныеПоДопПробе.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрДопМатериал Из ЕстьСтрокиСХарактеристикой Цикл
			Если СтрДопМатериал.Вес = 0 
				или СтрДопМатериал.Металл.НеДрагоценныйМеталл Тогда
				Продолжить;
			КонецЕсли;	
			Если СтрДопМатериал.Металл.ПробаЧистоты = 0 Тогда
				ТекВесМеталлаВЧистоте = 0;
			Иначе	
				ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
				* СтрДопМатериал.Проба/СтрДопМатериал.Металл.ПробаЧистоты, 3);
			КонецЕсли;
			Если ТекВесМеталлаВЧистоте = 0 Тогда
				Продолжить;
			КонецЕсли;	
			СтруктураМеталла = Новый Структура;
			СтруктураМеталла.Вставить("Металл", ПолучитьМеталлПартии(СтрДопМатериал.Металл));				
			СтруктураМеталла.Вставить("ВесМеталлаВЧистоте",  ТекВесМеталлаВЧистоте*100000);
			МассивСплавов.Добавить(СтруктураМеталла);
		КонецЦикла;	
		СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);
		
		Если Выборка.КоличествоДК > 0 Тогда	
			СтруктураДК = Новый Структура;
			СтруктураДК.Вставить("Тип", "PRECIOUS_STONE");
			СтруктураДК.Вставить("Количество", Выборка.КоличествоДК);
			Если Выборка.ВесДК = 0 И ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
				СтруктураДК.Вставить("Вес", Выборка.ХарактеристикаНоменклатуры.ВесКамней*100000);
			Иначе	
				СтруктураДК.Вставить("Вес", Выборка.ВесДК*100000);
			КонецЕсли;
			
			СтруктураПартии.Вставить("СведенияОКамнях", СтруктураДК);
		КонецЕсли;
		
		Если Выборка.ВесНеДК > 0 Тогда	
			СтруктураНеДК = Новый Структура;
			СтруктураНеДК.Вставить("Тип", "NON_PRECIOUS");
			СтруктураНеДК.Вставить("Количество", Выборка.КоличествоНеДК);
			СтруктураНеДК.Вставить("Вес", Выборка.ВесНеДК*100000);
			
			СтруктураПартии.Вставить("СведенияОНеДрагаценныхКамнях", СтруктураНеДК);
		КонецЕсли;
		
		СтруктураСтроки.Вставить("СведенияОПолуфабрикате",  СтруктураПартии);
	
		СтруктураСтроки.Вставить("НомерСтроки", Выборка.НомерСтроки);
		
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;	

	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("МассивПартий", МассивСтрок);
	СтруктураОтвета.Вставить("МассивОшибок", МассивОшибок);
	Возврат СтруктураОтвета;

КонецФункции

&ИзменениеИКонтроль("ПодготовитьДанныеSendBatchУИН")
Функция B1_ПодготовитьДанныеSendBatchУИН(ИсходныеДанные, Документ)
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(СписокСерий.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                      |	ВЫРАЗИТЬ(СписокСерий.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВводОстатков КАК БУЛЕВО) КАК ВводОстатков,
	                      |	ВЫРАЗИТЬ(СписокСерий.Организация КАК Справочник.Организации) КАК Организация,
	                      |	ВЫРАЗИТЬ(СписокСерий.Количество КАК ЧИСЛО(6, 0)) КАК Количество,
	                      |	ВЫРАЗИТЬ(СписокСерий.КоличествоДК КАК ЧИСЛО(8, 0)) КАК КоличествоДК,
	                      |	ВЫРАЗИТЬ(СписокСерий.Вес КАК ЧИСЛО(15, 3)) КАК Вес,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВесДК КАК ЧИСЛО(15, 3)) КАК ВесДК,
	                      |	ВЫРАЗИТЬ(СписокСерий.КлючСвязи КАК ЧИСЛО(5, 0)) КАК КлючСвязи,
	                      |	СписокСерий.НомерСтроки КАК НомерСтроки,
	                      |	СписокСерий.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти
	                      |ПОМЕСТИТЬ СписокСерийДок
	                      |ИЗ
	                      |	&СписокСерий КАК СписокСерий
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокСерийДок.СерияНоменклатуры КАК СерияНоменклатуры,
	                      |	СписокСерийДок.Номенклатура.ТипИзделия КАК ТипИзделия,
	                      |	СписокСерийДок.Номенклатура.Проба КАК Проба,
	                      |	СписокСерийДок.Номенклатура КАК Номенклатура,
	                      |	СписокСерийДок.Организация КАК Организация,
	                      #Вставка
	                      |	ВЫБОР
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПроизводителем)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |	КОНЕЦ КАК Производитель,
	                      #КонецВставки
	                      #Удаление
	                      |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Производитель,
	                      #КонецУдаления
	                      |	ВЫБОР
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |				И ПартииТоваровНаСкладах.ДокументОприходования.ДоговорКонтрагента ЕСТЬ NULL
	                      |			ТОГДА ПартииТоваровНаСкладах.ДокументОприходования.Контрагент
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |				И ПартииТоваровНаСкладах.ДокументОприходования.ДоговорКонтрагента.ПриемНаКомиссиюОтФизическогоЛица = ИСТИНА
	                      |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |			ТОГДА ПартииТоваровНаСкладах.ДокументОприходования.Контрагент
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ИСТИНА
	                      |				И ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента ЕСТЬ NULL
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ИСТИНА
	                      |				И ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ПриемНаКомиссиюОтФизическогоЛица = ИСТИНА
	                      |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |		ИНАЧЕ ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент
	                      |	КОНЕЦ КАК Контрагент,
	                      |	ПартииТоваровНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
	                      |	СписокСерийДок.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                      |	СписокСерийДок.Номенклатура.ВидПартииМеталла КАК ВидПартииМеталла,
	                      |	СписокСерийДок.Номенклатура.ОКПД2 КАК ОКПД2,
	                      |	СписокСерийДок.Количество КАК Количество,
	                      |	ЕСТЬNULL(СписокСерийДок.СерияНоменклатуры.ХарактеристикаНоменклатуры.КоличествоДрагоценныхКамней, 0) КАК КоличествоДК,
	                      |	СписокСерийДок.Вес КАК Вес,
	                      |	СписокСерийДок.ВесДК КАК ВесДК,
	                      |	ВЫБОР
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |				И СписокСерийДок.СерияНоменклатуры.ВесМеталлаВЧистотеГИИСДМДК = 0
	                      |			ТОГДА СписокСерийДок.СерияНоменклатуры.ВесМеталлаВЧистоте
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |			ТОГДА СписокСерийДок.СерияНоменклатуры.ВесМеталлаВЧистотеГИИСДМДК
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ИСТИНА
	                      |				И ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталлаВЧистотеГИИСДМДК = 0
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталлаВЧистоте
	                      |		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталлаВЧистотеГИИСДМДК
	                      |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                      |	ВЫБОР
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |				И СписокСерийДок.СерияНоменклатуры.ВесМеталлаГИИСДМДК = 0
	                      |			ТОГДА СписокСерийДок.СерияНоменклатуры.ВесМеталла
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |			ТОГДА СписокСерийДок.СерияНоменклатуры.ВесМеталлаГИИСДМДК
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ИСТИНА
	                      |				И ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталлаГИИСДМДК = 0
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталла
	                      |		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталлаГИИСДМДК
	                      |	КОНЕЦ КАК ВесМеталлаВПробе,
	                      |	СписокСерийДок.ВводОстатков КАК ВводОстатков,
	                      |	СписокСерийДок.КлючСвязи КАК КлючСвязи,
	                      |	СписокСерийДок.НомерСтроки КАК НомерСтроки,
	                      |	СписокСерийДок.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                      |	ВЫБОР
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |				И ПартииТоваровНаСкладах.ДокументОприходования.ДоговорКонтрагента ЕСТЬ NULL
	                      |			ТОГДА ЛОЖЬ
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ЛОЖЬ
	                      |			ТОГДА ПартииТоваровНаСкладах.ДокументОприходования.ДоговорКонтрагента.ПриемНаКомиссиюОтФизическогоЛица
	                      |		КОГДА &НужнаПроверкаПоОстаткам = ИСТИНА
	                      |				И ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента ЕСТЬ NULL
	                      |			ТОГДА ЛОЖЬ
	                      |		ИНАЧЕ ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ПриемНаКомиссиюОтФизическогоЛица
	                      |	КОНЕЦ КАК ПриемНаКомиссиюОтФизическогоЛица
	                      |ПОМЕСТИТЬ СписокСерий
	                      |ИЗ
	                      |	СписокСерийДок КАК СписокСерийДок
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	                      |				&Дата,
	                      |				Организация = &Организация
	                      |					И Склад = &Склад) КАК ПартииТоваровНаСкладахОстатки
	                      |		ПО СписокСерийДок.Номенклатура = ПартииТоваровНаСкладахОстатки.Номенклатура
	                      |			И СписокСерийДок.СерияНоменклатуры = ПартииТоваровНаСкладахОстатки.СерияНоменклатуры
	                      |			И (&НужнаПроверкаПоОстаткам)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                      |		ПО СписокСерийДок.Номенклатура = ПартииТоваровНаСкладах.Номенклатура
	                      |			И СписокСерийДок.СерияНоменклатуры = ПартииТоваровНаСкладах.СерияНоменклатуры
	                      |			И (&НужнаПроверкаПоОстаткам = ЛОЖЬ)
	                      |			И (ПартииТоваровНаСкладах.Регистратор = &РегистраторПоПартиям)
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &НужнаПроверкаПоОстаткам = ИСТИНА
	                      |				ТОГДА ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	                      |						ИЛИ ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокСерий.СерияНоменклатуры КАК СерияНоменклатуры,
	                      |	СписокСерий.ВидНоменклатуры КАК ВидНоменклатуры,
	                      |	СписокСерий.ВводОстатков КАК ВводОстатков,
	                      |	СписокСерий.ОКПД2.Код КАК ОКПД2,
	                      |	СписокСерий.Контрагент КАК Поставщик,
	                      |	СписокСерий.Организация КАК Организация,
	                      |	СписокСерий.СтатусПартии КАК СтатусПартии,
	                      |	СписокСерий.Количество КАК Количество,
	                      |	СписокСерий.КоличествоДК КАК КоличествоДК,
	                      |	СписокСерий.Вес КАК Вес,
	                      |	СписокСерий.ВесДК КАК ВесДК,
	                      |	СписокСерий.Проба КАК Проба,
	                      |	СписокСерий.Проба.Металл КАК Металл,
	                      |	СписокСерий.Проба.Проба КАК ПробаЧисло,
	                      |	ЕСТЬNULL(СписокСерий.ВесМеталлаВЧистоте, 0) КАК ВесМеталлаВЧистоте,
	                      |	"""" КАК ТНВЭД,
	                      |	СписокСерий.ВидПартииМеталла.Код КАК ВидПартииМеталла,
	                      |	СписокСерий.Контрагент.ИНН КАК ПоставщикИНН,
	                      |	СписокСерий.Контрагент.КПП КАК ПоставщикКПП,
	                      |	СписокСерий.Контрагент.ОГРН КАК ПоставщикОГРН,
	                      |	СписокСерий.Контрагент.ЮрФизЛицо КАК ПоставщикЮрФизЛицо,
	                      |	СписокСерий.Производитель.ИНН КАК ПроизводительИНН,
	                      |	СписокСерий.Производитель.КПП КАК ПроизводительКПП,
	                      |	СписокСерий.Производитель.ОГРН КАК ПроизводительОГРН,
	                      |	СписокСерий.Производитель.ЮрФизЛицо КАК ПроизводительЮрФизЛицо,
	                      |	СписокСерий.Организация.ИНН КАК ОрганизацияИНН,
	                      |	СписокСерий.Организация.КПП КАК ОрганизацияКПП,
	                      |	СписокСерий.Организация.ОГРН КАК ОрганизацияОГРН,
	                      |	СписокСерий.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                      |	СписокСерий.СерияНоменклатуры.Наименование КАК ШК,
	                      |	СписокСерий.СерияНоменклатуры.НомерПаспорта КАК ШтрихкодПоставщика,
	                      |	СписокСерий.СерияНоменклатуры.Размер КАК Размер,
	                      |	СписокСерий.СерияНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                      |	СписокСерий.ТипИзделия КАК ТипИзделия,
	                      |	СписокСерий.Номенклатура КАК Номенклатура,
	                      |	ЕСТЬNULL(СписокСерий.Номенклатура.Артикул, """") КАК Артикул,
	                      |	СписокСерий.НомерСтроки КАК НомерСтроки,
	                      |	СписокСерий.КлючСвязи КАК КлючСвязи,
	                      |	СписокСерий.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                      |	ЕСТЬNULL(СписокСерий.ТипИзделия.Наименование, """") КАК ТипИзделияНаименование,
	                      |	ЕСТЬNULL(СписокСерий.ТипИзделия.НаименованиеГИИСДМДК, """") КАК ТипИзделияНаименованиеГИИСДМДК,
	                      |	ЕСТЬNULL(СписокСерий.ТипИзделия.НаименованиеГИИСДМДКВоМножественномЧисле, ЛОЖЬ) КАК ТипИзделияВоМножественномЧисле,
	                      |	ЕСТЬNULL(СписокСерий.ТипИзделия.РодНаименованияГИИСДМДК, ЗНАЧЕНИЕ(Перечисление.РодаИменСуществительных.ПустаяСсылка)) КАК ТипИзделияРодНаименования,
	                      |	СписокСерий.ВесМеталлаВПробе КАК ВесМеталлаВПробе,
	                      |	СписокСерий.ПриемНаКомиссиюОтФизическогоЛица КАК ПриемНаКомиссиюОтФизическогоЛица
	                      |ИЗ
	                      |	СписокСерий КАК СписокСерий
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыВводОстатковПартийДляГИИСДМДК.КлючСвязи КАК КлючСвязи,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал КАК Материал,
	                      |	СУММА(ХарактеристикиНоменклатурыДополнительныеМатериалы.Вес) КАК Вес,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл КАК Металл,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба КАК Проба
	                      |ИЗ
	                      |	РегистрСведений.ТоварыВводОстатковПартийДляГИИСДМДК КАК ТоварыВводОстатковПартийДляГИИСДМДК
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеМатериалы КАК ХарактеристикиНоменклатурыДополнительныеМатериалы
	                      |		ПО ТоварыВводОстатковПартийДляГИИСДМДК.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатурыДополнительныеМатериалы.Ссылка
	                      |ГДЕ
	                      |	ТоварыВводОстатковПартийДляГИИСДМДК.Регистратор = &Регистратор
	                      |	И ТоварыВводОстатковПартийДляГИИСДМДК.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВводОстатковПартийДляГИИСДМДК.КлючСвязи,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба");
	ТаблицаПартий = МассивСтруктурВТаблицуПартий(ИсходныеДанные);
	Запрос.УстановитьПараметр("СписокСерий", ТаблицаПартий);
	Запрос.УстановитьПараметр("Регистратор", Документ);
	Запрос.УстановитьПараметр("Дата", Документ.Дата);
	Запрос.УстановитьПараметр("Организация", Документ.Организация);
	Запрос.УстановитьПараметр("Склад", Документ.Склад);
	ЭтоПродажа = ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах"); 
	Запрос.УстановитьПараметр("НужнаПроверкаПоОстаткам", ЭтоПродажа = Ложь);
	Запрос.УстановитьПараметр("РегистраторПоПартиям", ?(ЭтоПродажа, Документ.ДокументОснование, Документ));
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[2].Выбрать();
	ДанныеПоДопПробе = Результат[3].Выгрузить();
	МассивСтрок = Новый Массив;
	МассивОшибок = Новый Массив;
	
	ДанныеПоКамням = ИнтеграцияГИИСДМДКЮТДСервер.ЗакодироватьКамниПоКлассификатору(ТаблицаПартий);
	ДанныеПоКамням.Индексы.Добавить("НомерСтрокиТаблЧасти");
	
	ПоискТоваровПоВнутреннемуШК = Константы.ПоискТоваровПоВнутреннемуШК.Получить();
	ПоискТоваровПоПаспорту = Константы.ПоискТоваровПоПаспорту.Получить();
	
	ТаблицаДополнительныхПроб = Новый ТаблицаЗначений;
	ТаблицаДополнительныхПроб.Колонки.Добавить("Металл");
	ТаблицаДополнительныхПроб.Колонки.Добавить("ВесМеталлаВЧистоте");

	Пока Выборка.Следующий() Цикл
		ОписаниеОшибки = "";
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ВводОстатков", Выборка.ВводОстатков);
		СтруктураСтроки.Вставить("НомерСтроки", Выборка.НомерСтроки);	
				
		ПараметрыНаименования = Новый Структура;
		ПараметрыНаименования.Вставить("НаименованиеГИИИСДМДК", Выборка.ТипИзделияНаименованиеГИИСДМДК);
		ПараметрыНаименования.Вставить("Наименование", Выборка.ТипИзделияНаименование);
		ПараметрыНаименования.Вставить("Металл", Выборка.Металл);
		ПараметрыНаименования.Вставить("ПробаЧисло", Выборка.ПробаЧисло);
		ПараметрыНаименования.Вставить("МножественноеЧисло", Выборка.ТипИзделияВоМножественномЧисле);
		ПараметрыНаименования.Вставить("Род", Выборка.ТипИзделияРодНаименования);
		ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", Выборка.ШК);
		ПараметрыНаименования.Вставить("ШтрихкодПоставщика", Выборка.ШтрихкодПоставщика);
		ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
		ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
		
		Наименование = НаименованиеЮвелирногоИзделия(ПараметрыНаименования);
		
		ПараметрыОписания = Новый Структура;
		ПараметрыОписания.Вставить("Артикул", Выборка.Артикул);
		ПараметрыОписания.Вставить("Размер", Выборка.Размер);
		ПараметрыОписания.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
		
		ПолноеНаименование = ОписаниеЮвелирногоИзделия(ПараметрыОписания);
		
		СтруктураСтроки.Вставить("Наименование", Лев(Наименование, 100));
		СтруктураСтроки.Вставить("НаименованиеПолное", Лев(ПолноеНаименование, 250));
		СтруктураСтроки.Вставить("ТипПартии", "PRODUCT");
		СтруктураСтроки.Вставить("ВидПартии", "JEWERLY");
		СтруктураСтроки.Вставить("ЭтапОбработки", ПолучитьЭтапОбработки());
		СтруктураСтроки.Вставить("СтадияОбработки", ПолучитьСтадиюОбработки());
		СтруктураСтроки.Вставить("Статус", "STORING");
		СтруктураСтроки.Вставить("ОКПД2", Выборка.ОКПД2);
		#Вставка
		Если Не ЗначениеЗаполнено(СтруктураСтроки.ОКПД2) Тогда
		#КонецВставки
		#Удаление
		Если СтруктураСтроки.ОКПД2 = "" Тогда
		#КонецУдаления
			МассивОшибок.Добавить("Не заполнено ОКПД2 для серии " + Выборка.СерияНоменклатуры);
		КонецЕсли;

		#Вставка
		СтруктураПроизводителя = Новый Структура;
		Если Выборка.ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПроизводителя.Вставить("ТипКонтрагента", "legal");
			Если Не ЗначениеЗаполнено(Выборка.ПроизводительКПП) Тогда
				МассивОшибок.Добавить("Не заполнен КПП производителя для номенклатуры " + Выборка.Номенклатура);
			КонецЕсли;
		ИначеЕсли Выборка.ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураПроизводителя.Вставить("ТипКонтрагента", "physical");
		Иначе
			МассивОшибок.Добавить("Не заполнен тип контрагента производителя для номенклатуры " + Выборка.Номенклатура)
		КонецЕсли;
		СтруктураПроизводителя.Вставить("ИНН", Выборка.ПроизводительИНН);
		Если Выборка.ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПроизводителя.Вставить("КПП", Выборка.ПроизводительКПП);
		Иначе
			СтруктураПроизводителя.Вставить("КПП", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ПроизводительОГРН) Тогда
			СтруктураПроизводителя.Вставить("ОГРН", Число(Выборка.ПроизводительОГРН));;	
		Иначе
			СтруктураПроизводителя.Вставить("ОГРН", "");
			МассивОшибок.Добавить("Не заполнен ОГРН производителя для номенклатуры " + Выборка.Номенклатура);
		КонецЕсли;
		#КонецВставки
		#Удаление
		СтруктураПроизводителя = Новый Структура;
		СтруктураПроизводителя.Вставить("ТипКонтрагента", "legal");
		СтруктураПроизводителя.Вставить("КПП", "000000000");
		СтруктураПроизводителя.Вставить("ОГРН", "0000000000000");
		#КонецУдаления
		
		СтруктураСтроки.Вставить("Производитель", СтруктураПроизводителя);
		
		СтруктураПоставщика = Новый Структура;
		Если Выборка.СтатусПартии = Перечисления.СтатусыПартийТоваров.НаКомиссию 
			и Выборка.ПриемНаКомиссиюОтФизическогоЛица = Ложь Тогда
			Если Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				СтруктураПоставщика.Вставить("ТипКонтрагента", "legal");
				#Вставка
				Если Не ЗначениеЗаполнено(Выборка.ПоставщикКПП) Тогда
				#КонецВставки
				#Удаление
				Если Выборка.ПоставщикКПП = "" Тогда
				#КонецУдаления
					МассивОшибок.Добавить("Не заполнен КПП поставщика для серии " + Выборка.СерияНоменклатуры);
				КонецЕсли;	
				#Вставка
				Если Не ЗначениеЗаполнено(Выборка.ПоставщикОГРН) Тогда
				#КонецВставки
				#Удаление
				Если Выборка.ПоставщикОГРН = "" Тогда
				#КонецУдаления
					МассивОшибок.Добавить("Не заполнен ОГРН поставщика для серии " + Выборка.СерияНоменклатуры);
				КонецЕсли;
			ИначеЕсли Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
				СтруктураПоставщика.Вставить("ТипКонтрагента", "physical");
				#Вставка
				Если Не ЗначениеЗаполнено(Выборка.ПоставщикОГРН) Тогда
				#КонецВставки
				#Удаление
				Если Выборка.ПоставщикОГРН = "" Тогда
				#КонецУдаления
					МассивОшибок.Добавить("Не заполнен ОГРН поставщика для серии " + Выборка.СерияНоменклатуры);
				КонецЕсли;
			ИначеЕсли Не ЗначениеЗаполнено(Выборка.ПоставщикЮрФизЛицо) Тогда
				МассивОшибок.Добавить("Не заполнено Юр./физ.лицо в поставщике для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
		КонецЕсли;
		СтруктураПоставщика.Вставить("ИНН", Выборка.ПоставщикИНН);
		Если Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПоставщика.Вставить("КПП", Выборка.ПоставщикКПП);
		Иначе
			СтруктураПоставщика.Вставить("КПП", "");
		КонецЕсли;	
		#Вставка
		Если ЗначениеЗаполнено(Выборка.ПоставщикОГРН) Тогда
			СтруктураПоставщика.Вставить("ОГРН", Число(Выборка.ПоставщикОГРН));	
		Иначе
			СтруктураПоставщика.Вставить("ОГРН", "");
		КонецЕсли;
		#КонецВставки
		#Удаление
		СтруктураПоставщика.Вставить("ОГРН", Выборка.ПоставщикОГРН);
		#КонецУдаления
		
		СтруктураОрганизации = Новый Структура;
		Если Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураОрганизации.Вставить("ТипКонтрагента", "legal");
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ОрганизацияКПП) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ОрганизацияКПП = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен КПП организации для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;	
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ОрганизацияОГРН) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ОрганизацияОГРН = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен ОГРН организации для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
		ИначеЕсли Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураОрганизации.Вставить("ТипКонтрагента", "physical");
			#Вставка
			Если Не ЗначениеЗаполнено(Выборка.ОрганизацияОГРН) Тогда
			#КонецВставки
			#Удаление
			Если Выборка.ОрганизацияОГРН = "" Тогда
			#КонецУдаления
				МассивОшибок.Добавить("Не заполнен ОГРН организации для серии " + Выборка.СерияНоменклатуры);
			КонецЕсли;
		КонецЕсли;
		СтруктураОрганизации.Вставить("ИНН", Выборка.ОрганизацияИНН);
		Если Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураОрганизации.Вставить("КПП", Выборка.ОрганизацияКПП);
		Иначе
			СтруктураОрганизации.Вставить("КПП", "");
		КонецЕсли;
		#Вставка
		Если ЗначениеЗаполнено(Выборка.ОрганизацияОГРН) Тогда
			СтруктураОрганизации.Вставить("ОГРН", Число(Выборка.ОрганизацияОГРН));	
		Иначе
			СтруктураОрганизации.Вставить("ОГРН", "");
		КонецЕсли;
		#КонецВставки
		#Удаление
		СтруктураОрганизации.Вставить("ОГРН", Выборка.ОрганизацияОГРН);
		#КонецУдаления
		
		Если Выборка.ПриемНаКомиссиюОтФизическогоЛица = Истина Тогда
			СтруктураСтроки.Вставить("Собственник", СтруктураПроизводителя);
		ИначеЕсли Выборка.СтатусПартии = Перечисления.СтатусыПартийТоваров.НаКомиссию Тогда
			СтруктураСтроки.Вставить("Собственник", СтруктураПоставщика);
		Иначе
			СтруктураСтроки.Вставить("Собственник", СтруктураОрганизации);
		КонецЕсли;
		СтруктураСтроки.Вставить("Владелец", СтруктураОрганизации);
		СтруктураСтроки.Вставить("Количество", Выборка.Количество);
		СтруктураСтроки.Вставить("Вес", Выборка.Вес*100000);
		СтруктураСтроки.Вставить("ЕдиницаИзмерения", "GRM");
					
		СтруктураПартии = Новый Структура;
		СтруктураПартии.Вставить("ВидОсновногоМеталла", ПолучитьМеталлПартии(Выборка.Металл));
		Если СтруктураПартии.ВидОсновногоМеталла = "No" Тогда
			МассивОшибок.Добавить("Не определен вид металла для серии " + Выборка.СерияНоменклатуры);
		КонецЕсли;
		СтруктураПартии.Вставить("Металл", ПолучитьМеталлПартии(Выборка.Металл));
		СтруктураПартии.Вставить("Проба", Выборка.ПробаЧисло*100);
		Если СтруктураПартии.Проба = 0 Тогда
			МассивОшибок.Добавить("Не заполнена проба для серии " + Выборка.СерияНоменклатуры);
		КонецЕсли;
		
		СтруктураПартии.Вставить("ПробаПодтвержденная", Выборка.ПробаЧисло*100);
		МассивСплавов = Новый Массив;
		СтруктураМеталла = Новый Структура;
		СтруктураМеталла.Вставить("Металл", ПолучитьМеталлПартии(Выборка.Металл));
		СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", Выборка.ВесМеталлаВЧистоте * 100000);
		МассивСплавов.Добавить(СтруктураМеталла);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("КлючСвязи", Выборка.КлючСвязи);
		ЕстьСтрокиСХарактеристикой = ДанныеПоДопПробе.НайтиСтроки(СтруктураПоиска);
		ТаблицаДополнительныхПроб.Очистить();
		Для Каждого СтрДопМатериал Из ЕстьСтрокиСХарактеристикой Цикл
			Если Не ЗначениеЗаполнено(СтрДопМатериал.Металл) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрДопМатериал.Вес = 0 
				или СтрДопМатериал.Металл.НеДрагоценныйМеталл  Тогда
				Продолжить;
			КонецЕсли;	
			Если СтрДопМатериал.Металл.ПробаЧистоты = 0 Тогда
				ТекВесМеталлаВЧистоте = 0;
			Иначе	
				ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
				* СтрДопМатериал.Проба/СтрДопМатериал.Металл.ПробаЧистоты, 3);
			КонецЕсли;
			Если ТекВесМеталлаВЧистоте = 0 Тогда
				Продолжить;
			КонецЕсли;	
			МеталлДопПробы = ПолучитьМеталлПартии(СтрДопМатериал.Металл);
			Если СтруктураМеталла.Металл = МеталлДопПробы Тогда
				СтруктураМеталла.ВесМеталлаВЧистоте = СтруктураМеталла.ВесМеталлаВЧистоте + ТекВесМеталлаВЧистоте*100000;
			Иначе	
				СтруктураДопМеталла = ТаблицаДополнительныхПроб.Добавить();
				СтруктураДопМеталла.Металл = МеталлДопПробы;				
				СтруктураДопМеталла.ВесМеталлаВЧистоте = ТекВесМеталлаВЧистоте*100000;
			КонецЕсли;
		КонецЦикла;	
		Если ТаблицаДополнительныхПроб.Количество() > 0 Тогда
			ТаблицаДополнительныхПроб.Свернуть("Металл", "ВесМеталлаВЧистоте");
			Для Каждого СтрокаДопПробы Из ТаблицаДополнительныхПроб Цикл
				СтруктураДопМеталла = Новый Структура;
				СтруктураДопМеталла.Вставить("Металл", СтрокаДопПробы.Металл);				
				СтруктураДопМеталла.Вставить("ВесМеталлаВЧистоте",  СтрокаДопПробы.ВесМеталлаВЧистоте);
				МассивСплавов.Добавить(СтруктураДопМеталла);	
			КонецЦикла;	
		КонецЕсли;	
		СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);
		
		ОписаниеОшибки = "";
		Если Документ.ДанныеОВставкахВыгружаемПоКлассификатору = Ложь и Выборка.КоличествоДК > 0 Тогда
			СведенияОВставках = Новый Массив;
			СтруктураДК = Новый Структура;
			СтруктураДК.Вставить("ВидКамня", "PRECIOUS_STONE");
			СтруктураДК.Вставить("КлассификационныйКод", "");
			СтруктураДК.Вставить("Количество", Выборка.КоличествоДК);
			СтруктураДК.Вставить("Вес", 0);
			СведенияОВставках.Добавить(СтруктураДК);
			
			СтруктураПартии.Вставить("СведенияОВставках", СведенияОВставках);
		ИначеЕсли Документ.ДанныеОВставкахВыгружаемПоКлассификатору Тогда
			СведенияОВставках = СведенияОВставкахГотовойПродукции(Выборка, ДанныеПоКамням, ОписаниеОшибки);
			Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
				МассивОшибок.Добавить("Не верно заполнена спецификация вставок: " + ОписаниеОшибки + " для серии " + Выборка.ШК);
			Иначе
				СтруктураПартии.Вставить("СведенияОВставках", СведенияОВставках);
			КонецЕсли;
			
		КонецЕсли;	
		
		СтруктураСтроки.Вставить("СведенияОПродукции",  СтруктураПартии);
	
		СтруктураСтроки.Вставить("НомерСтроки", Выборка.НомерСтроки);
		
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;	

	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("МассивПартий", МассивСтрок);
	СтруктураОтвета.Вставить("МассивОшибок", МассивОшибок);
	Возврат СтруктураОтвета;
	
КонецФункции

&ИзменениеИКонтроль("ПодготовитьДанныеSendBatchОстатки")
Функция B1_ПодготовитьДанныеSendBatchОстатки(ИсходныеДанные, Организация, ВставкиПоКлассификатору)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(СписокСерий.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                      |	ВЫРАЗИТЬ(СписокСерий.ХарактеристикаНоменклатуры КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
	                      |	ВЫРАЗИТЬ(СписокСерий.ВводОстатков КАК БУЛЕВО) КАК ВводОстатков,
	                      |	ВЫРАЗИТЬ(СписокСерий.УИН КАК СТРОКА(16)) КАК УИН,
	                      |	ВЫРАЗИТЬ(СписокСерий.ИНП КАК СТРОКА(16)) КАК ИНП,
	                      |	СписокСерий.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти
	                      |ПОМЕСТИТЬ СписокСерий
	                      |ИЗ
	                      |	&СписокСерий КАК СписокСерий
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	СерияНоменклатуры
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокСерий.СерияНоменклатуры КАК СерияНоменклатуры,
	                      |	ПартииТоваровНаСкладахОстатки.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                      |	ПартииТоваровНаСкладахОстатки.Размер КАК Размер,
	                      |	СписокСерий.ВводОстатков КАК ВводОстатков,
	                      |	СписокСерий.УИН КАК УИН,
	                      |	СписокСерий.ИНП КАК ИНП,
	                      |	ПартииТоваровНаСкладахОстатки.Номенклатура.Наименование КАК Наименование,
	                      |	ПартииТоваровНаСкладахОстатки.ДокументОприходования КАК ДокументОприходования,
	                      |	ПартииТоваровНаСкладахОстатки.Номенклатура.ОКПД2.Код КАК ОКПД2,
	                      |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент КАК Поставщик,
	                      |	ПартииТоваровНаСкладахОстатки.Организация КАК Организация,
	                      |	ПартииТоваровНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
	                      |	ПартииТоваровНаСкладахОстатки.КоличествоОстаток КАК Количество,
	                      |	ПартииТоваровНаСкладахОстатки.ВесОстаток КАК Вес,
	                      |	ПартииТоваровНаСкладахОстатки.Номенклатура.Проба КАК Проба,
	                      |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.Номенклатура.Проба.Металл, ЗНАЧЕНИЕ(Справочник.ТипыДрагоценныхМеталлов.ПустаяСсылка)) КАК Металл,
	                      |	ПартииТоваровНаСкладахОстатки.Номенклатура.Проба.Проба КАК ПробаЧисло,
	                      |	ВЫБОР
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталлаВЧистотеГИИСДМДК = 0
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталлаВЧистоте
	                      |		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СерияНоменклатуры.ВесМеталлаВЧистотеГИИСДМДК
	                      |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                      |	ПартииТоваровНаСкладахОстатки.Номенклатура.Артикул КАК Артикул,
	                      |	ПартииТоваровНаСкладахОстатки.Номенклатура.КодВидаТовара КАК ТНВЭД,
	                      |	ПартииТоваровНаСкладахОстатки.СтоимостьОстаток КАК Стоимость,
	                      |	ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС,
	                      |	ПартииТоваровНаСкладахОстатки.Номенклатура.ВидПартииМеталла.Код КАК ВидПартииМеталла,
	                      |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент.ИНН КАК ПоставщикИНН,
	                      |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент.КПП КАК ПоставщикКПП,
	                      |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент.ОГРН КАК ПоставщикОГРН,
	                      |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент.ЮрФизЛицо КАК ПоставщикЮрФизЛицо,
	                      |	ПартииТоваровНаСкладахОстатки.Организация.ИНН КАК ОрганизацияИНН,
	                      |	ПартииТоваровНаСкладахОстатки.Организация.КПП КАК ОрганизацияКПП,
	                      |	ПартииТоваровНаСкладахОстатки.Организация.ОГРН КАК ОрганизацияОГРН,
	                      |	ПартииТоваровНаСкладахОстатки.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                      |	СписокСерий.СерияНоменклатуры.Наименование КАК ШК,
	                      |	СписокСерий.СерияНоменклатуры.НомерПаспорта КАК ШтрихкодПоставщика,
	                      |	ВЫБОР
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры.КоличествоДрагоценныхКамней
	                      |	КОНЕЦ КАК КоличествоДК,
	                      |	ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                      |	СписокСерий.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                      |	ВЫБОР
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПроизводителем)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент.ЮрФизЛицо
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель.ЮрФизЛицо
	                      |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	                      |	КОНЕЦ КАК ПроизводительЮрФизЛицо,
	                      |	ВЫБОР
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПроизводителем)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент.ИНН
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель.ИНН
	                      |		ИНАЧЕ """"
	                      |	КОНЕЦ КАК ПроизводительИНН,
	                      |	ВЫБОР
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПроизводителем)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент.КПП
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель.КПП
	                      |		ИНАЧЕ """"
	                      |	КОНЕЦ КАК ПроизводительКПП,
	                      |	ВЫБОР
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПроизводителем)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования.Контрагент.ОГРН
	                      |		КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |			ТОГДА ПартииТоваровНаСкладахОстатки.Номенклатура.ОсновнойПроизводитель.ОГРН
	                      |		ИНАЧЕ """"
	                      |	КОНЕЦ КАК ПроизводительОГРН,
	                      |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.Номенклатура.ТипИзделия.Наименование, """") КАК ТипИзделияНаименование,
	                      |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.Номенклатура.ТипИзделия.НаименованиеГИИСДМДК, """") КАК ТипИзделияНаименованиеГИИСДМДК,
	                      |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.Номенклатура.ТипИзделия.НаименованиеГИИСДМДКВоМножественномЧисле, ЛОЖЬ) КАК ТипИзделияВоМножественномЧисле,
	                      |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.Номенклатура.ТипИзделия.РодНаименованияГИИСДМДК, ЗНАЧЕНИЕ(Перечисление.РодаИменСуществительных.ПустаяСсылка)) КАК ТипИзделияРодНаименования,
	                      |	ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры.Покрытие, ЗНАЧЕНИЕ(Справочник.Покрытие.ПустаяСсылка)) КАК Покрытие,
	                      |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.ДоговорКонтрагента.ПриемНаКомиссиюОтФизическогоЛица КАК ПриемНаКомиссиюОтФизическогоЛица,
	                      |	ВЫБОР
	                      |		КОГДА СоответствиеТиповИзделийИДополнительнойКлассификацииГИИСДМДК.ДополнительнаяКлассификация ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ СоответствиеТиповИзделийИДополнительнойКлассификацииГИИСДМДК.ДополнительнаяКлассификация.Код
	                      |	КОНЕЦ КАК ДополнительнаяКлассификация,
	                      |	ВЫБОР
	                      |		КОГДА СоответствиеТиповИзделийИДополнительнойКлассификацииГИИСДМДК.ДополнительнаяКлассификация.ВидПартии ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ СоответствиеТиповИзделийИДополнительнойКлассификацииГИИСДМДК.ДополнительнаяКлассификация.ВидПартии.Код
	                      |	КОНЕЦ КАК ДополнительнаяКлассификацияВидПартии
	                      |ИЗ
	                      |	СписокСерий КАК СписокСерий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(, Организация = &Организация) КАК ПартииТоваровНаСкладахОстатки
	                      |		ПО СписокСерий.СерияНоменклатуры = ПартииТоваровНаСкладахОстатки.СерияНоменклатуры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТиповИзделийИДополнительнойКлассификацииГИИСДМДК КАК СоответствиеТиповИзделийИДополнительнойКлассификацииГИИСДМДК
	                      |		ПО СписокСерий.СерияНоменклатуры.Владелец.ТипИзделия = СоответствиеТиповИзделийИДополнительнойКлассификацииГИИСДМДК.ТипИзделия
	                      |ГДЕ
	                      |	(ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	                      |			ИЛИ ПартииТоваровНаСкладахОстатки.ВесОстаток > 0)");
	Если ТипЗнч(ИсходныеДанные) = Тип("Массив") Тогда
		ИспользоватьНеполнуюКлассификациюКамней = Ложь;                     
		ТаблицаПартий = МассивСтруктурВТаблицуПартий(ИсходныеДанные);
	Иначе
		ИспользоватьНеполнуюКлассификациюКамней = ИсходныеДанные[0];                     
		ТаблицаПартий = МассивСтруктурВТаблицуПартий(ИсходныеДанные[1]);
	КонецЕсли;	
	Запрос.УстановитьПараметр("СписокСерий", ТаблицаПартий);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ВставкиПоКлассификатору Тогда
		ДанныеПоКамням = ЗакодироватьКамниПоКлассификатору(ТаблицаПартий, ИспользоватьНеполнуюКлассификациюКамней);
		ДанныеПоКамням.Индексы.Добавить("НомерСтрокиТаблЧасти");
	Иначе
		ДанныеПоКамням = Новый ТаблицаЗначений; 
	КонецЕсли;
	
	ПоискТоваровПоВнутреннемуШК = Константы.ПоискТоваровПоВнутреннемуШК.Получить();
	ПоискТоваровПоПаспорту = Константы.ПоискТоваровПоПаспорту.Получить();
	
	МассивСтрок = Новый Массив;
	МассивОшибок = Новый Массив;
	Сч = 0;
	Пока Выборка.Следующий() Цикл
		ОписаниеОшибки = "";
		СтруктураСтроки = Новый Структура;
		Сч = Сч + 1;
				
		ПараметрыНаименования = Новый Структура;
	    ПараметрыНаименования.Вставить("НаименованиеГИИИСДМДК", Выборка.ТипИзделияНаименованиеГИИСДМДК);
		ПараметрыНаименования.Вставить("Наименование", Выборка.ТипИзделияНаименование);
		ПараметрыНаименования.Вставить("Металл", Выборка.Металл);
		ПараметрыНаименования.Вставить("ПробаЧисло", Выборка.ПробаЧисло);
		ПараметрыНаименования.Вставить("МножественноеЧисло", Выборка.ТипИзделияВоМножественномЧисле);
		ПараметрыНаименования.Вставить("Род", Выборка.ТипИзделияРодНаименования);
		ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", Выборка.ШК);
		ПараметрыНаименования.Вставить("ШтрихкодПоставщика", Выборка.ШтрихкодПоставщика);
		ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
		ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
		
		НаименованиеИзделия = НаименованиеЮвелирногоИзделия(ПараметрыНаименования);
		
		ПараметрыОписания = Новый Структура;
		ПараметрыОписания.Вставить("Артикул", Выборка.Артикул);
		ПараметрыОписания.Вставить("Размер", Выборка.Размер);
		ПараметрыОписания.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
		
		ОписаниеИзделия = ОписаниеЮвелирногоИзделия(ПараметрыОписания);
		
		СтруктураСтроки.Вставить("НомерСтроки", Выборка.НомерСтрокиТаблЧасти);
		СтруктураСтроки.Вставить("ВводОстатков", Выборка.ВводОстатков);
		СтруктураСтроки.Вставить("УИН", Выборка.УИН);
		СтруктураСтроки.Вставить("Наименование", Лев(НаименованиеИзделия, 100));
		СтруктураСтроки.Вставить("НаименованиеПолное", Лев(ОписаниеИзделия, 250));
		СтруктураСтроки.Вставить("ТипПартии", "PRODUCT");
		Если ЗначениеЗаполнено(Выборка.ДополнительнаяКлассификацияВидПартии) Тогда
			СтруктураСтроки.Вставить("ВидПартии", Выборка.ДополнительнаяКлассификацияВидПартии);
		Иначе	
			СтруктураСтроки.Вставить("ВидПартии", "JEWERLY");
		КонецЕсли;
		СтруктураСтроки.Вставить("ДополнительнаяКлассификация", Выборка.ДополнительнаяКлассификация);
		СтруктураСтроки.Вставить("ЭтапОбработки", ПолучитьЭтапОбработки());
		СтруктураСтроки.Вставить("СтадияОбработки", ПолучитьСтадиюОбработки());
		СтруктураСтроки.Вставить("Статус", "STORING");
		СтруктураСтроки.Вставить("ОКПД2", Выборка.ОКПД2);
		Если Выборка.ОКПД2 = "" Тогда
			МассивОшибок.Добавить("Не заполнен ОКПД2 для номенклатуры " + Выборка.Наименование);
		КонецЕсли;
		СтруктураСтроки.Вставить("ТНВЭД", "");
		
		СтруктураПоставщика = Новый Структура;
		Если Выборка.СтатусПартии = Перечисления.СтатусыПартийТоваров.НаКомиссию Тогда
			Если Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				СтруктураПоставщика.Вставить("ТипКонтрагента", "legal");
				Если Выборка.ПоставщикКПП = "" Тогда
					МассивОшибок.Добавить("Не заполнен КПП поставщика для серии " + Выборка.ШК);
				КонецЕсли;	
				Если Выборка.ПоставщикОГРН = "" Тогда
					МассивОшибок.Добавить("Не заполнен ОГРН поставщика для серии " + Выборка.ШК);
				КонецЕсли;
			ИначеЕсли Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
				СтруктураПоставщика.Вставить("ТипКонтрагента", "physical");	
				Если Выборка.ПоставщикОГРН = "" Тогда
					МассивОшибок.Добавить("Не заполнен ОГРН поставщика для серии " + Выборка.ШК);
				КонецЕсли;
			ИначеЕсли Не ЗначениеЗаполнено(Выборка.ПоставщикЮрФизЛицо) Тогда
				МассивОшибок.Добавить("Не заполнено Юр./физ.лицо в поставщике для серии " + Выборка.ШК);	
			КонецЕсли;
		КонецЕсли;
		СтруктураПоставщика.Вставить("ИНН", Выборка.ПоставщикИНН);
		Если Выборка.ПоставщикЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПоставщика.Вставить("КПП", Выборка.ПоставщикКПП);
		Иначе
			СтруктураПоставщика.Вставить("КПП", "");
		КонецЕсли;
		#Вставка
		Если ЗначениеЗаполнено(Выборка.ПоставщикОГРН) Тогда
			СтруктураПоставщика.Вставить("ОГРН", Число(Выборка.ПоставщикОГРН));	
		Иначе
			СтруктураПоставщика.Вставить("ОГРН", "");
		КонецЕсли;
		#КонецВставки
		#Удаление
		СтруктураПоставщика.Вставить("ОГРН", Выборка.ПоставщикОГРН);
		#КонецУдаления
		
		СтруктураОрганизации = Новый Структура;
		Если Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураОрганизации.Вставить("ТипКонтрагента", "legal");
			Если Выборка.ОрганизацияКПП = "" Тогда
				МассивОшибок.Добавить("Не заполнен КПП организации для серии " + Выборка.ШК);
			КонецЕсли;	
			Если Выборка.ОрганизацияОГРН = "" Тогда
				МассивОшибок.Добавить("Не заполнен ОГРН организации для серии " + Выборка.ШК);
			КонецЕсли;
		ИначеЕсли Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураОрганизации.Вставить("ТипКонтрагента", "physical");
			Если Выборка.ОрганизацияОГРН = "" Тогда
				МассивОшибок.Добавить("Не заполнен ОГРН организации для серии " + Выборка.ШК);
			КонецЕсли;
		КонецЕсли;
		СтруктураОрганизации.Вставить("ИНН", Выборка.ОрганизацияИНН);
		Если Выборка.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураОрганизации.Вставить("КПП", Выборка.ОрганизацияКПП);
		Иначе
			СтруктураОрганизации.Вставить("КПП", "");
		КонецЕсли;	
		#Вставка
		Если ЗначениеЗаполнено(Выборка.ОрганизацияОГРН) Тогда
			СтруктураОрганизации.Вставить("ОГРН", Число(Выборка.ОрганизацияОГРН));	
		Иначе
			СтруктураОрганизации.Вставить("ОГРН", "");
		КонецЕсли;
		#КонецВставки
		#Удаление
		СтруктураОрганизации.Вставить("ОГРН", Выборка.ОрганизацияОГРН);
		#КонецУдаления
		
		СтруктураПроизводителя = Новый Структура;
		#Вставка
		ПроизводительКПП = Выборка.ПроизводительКПП;
		ПроизводительИНН = Выборка.ПроизводительИНН;
		ПроизводительОГРН = Выборка.ПроизводительОГРН;
		ПроизводительЮрФизЛицо = Выборка.ПроизводительЮрФизЛицо;
		
		Если (НЕ ЗначениеЗаполнено(ПроизводительКПП) ИЛИ НЕ ЗначениеЗаполнено(ПроизводительОГРН)) 
		И НЕ Выборка.СерияНоменклатуры.Поставщик.Пустая() Тогда
			ПроизводительКПП = Выборка.СерияНоменклатуры.Поставщик.КПП;
			ПроизводительИНН = Выборка.СерияНоменклатуры.Поставщик.ИНН;
			ПроизводительОГРН = Выборка.СерияНоменклатуры.Поставщик.ОГРН;
			ПроизводительЮрФизЛицо = Выборка.СерияНоменклатуры.Поставщик.ЮрФизЛицо;
		КонецЕсли;
		
		Если ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПроизводителя.Вставить("ТипКонтрагента", "legal");
			Если Не ЗначениеЗаполнено(ПроизводительКПП) Тогда
				МассивОшибок.Добавить("Не заполнен КПП производителя для серии " + Выборка.ШК);	
			КонецЕсли;	
		ИначеЕсли ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураПроизводителя.Вставить("ТипКонтрагента", "physical");
		Иначе
			МассивОшибок.Добавить("Не заполнен тип контрагента производителя для серии " + Выборка.ШК);
		КонецЕсли;
		Если ПроизводительЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураПроизводителя.Вставить("КПП", ПроизводительКПП);
		Иначе
			СтруктураПроизводителя.Вставить("КПП", "");
		КонецЕсли;
		СтруктураПроизводителя.Вставить("ИНН", ПроизводительИНН);
		Если ЗначениеЗаполнено(ПроизводительОГРН) Тогда
			СтруктураПроизводителя.Вставить("ОГРН", Число(ПроизводительОГРН));	
		Иначе
			СтруктураПроизводителя.Вставить("ОГРН", "");
			МассивОшибок.Добавить("Не заполнен ОГРН производителя для серии " + Выборка.ШК);
		КонецЕсли;
		#КонецВставки
		#Удаление
			СтруктураПроизводителя.Вставить("ТипКонтрагента", "legal");
			СтруктураПроизводителя.Вставить("КПП", "000000000");
			СтруктураПроизводителя.Вставить("ОГРН", "0000000000000");	
		#КонецУдаления
		СтруктураСтроки.Вставить("Производитель", СтруктураПроизводителя);
		
		Если Выборка.ПриемНаКомиссиюОтФизическогоЛица = Истина Тогда
			СтруктураСтроки.Вставить("Собственник", СтруктураПроизводителя);
		ИначеЕсли Выборка.СтатусПартии = Перечисления.СтатусыПартийТоваров.НаКомиссию Тогда
			СтруктураСтроки.Вставить("Собственник", СтруктураПоставщика);
		Иначе
			СтруктураСтроки.Вставить("Собственник", СтруктураОрганизации);
		КонецЕсли;
		СтруктураСтроки.Вставить("Владелец", СтруктураОрганизации);
		СтруктураСтроки.Вставить("Количество", Выборка.Количество);
		СтруктураСтроки.Вставить("Вес", Выборка.Вес*100000);
		СтруктураСтроки.Вставить("ЕдиницаИзмерения", "GRM");
		
		СтруктураПартии = Новый Структура;
		СтруктураПартии.Вставить("Металл", ПолучитьМеталлПартии(Выборка.Металл));
		СтруктураПартии.Вставить("Проба", Выборка.ПробаЧисло*100);
		СтруктураПартии.Вставить("ПробаПодтвержденная", Выборка.ПробаЧисло*100);
		МассивСплавов = Новый Массив;
		СтруктураМеталла = Новый Структура;
		СтруктураМеталла.Вставить("Металл", ПолучитьМеталлПартии(Выборка.Металл));
		СтруктураМеталла.Вставить("Проба", Выборка.ПробаЧисло*100);
		СтруктураМеталла.Вставить("ПробаПодтвержденная", Выборка.ПробаЧисло*100);
		СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", Выборка.ВесМеталлаВЧистоте*100000);
		МассивСплавов.Добавить(СтруктураМеталла);
		Если ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры)
			и Выборка.ХарактеристикаНоменклатуры.ДополнительныеМатериалы.Количество() > 0 Тогда
			Для Каждого СтрДопМатериал Из Выборка.ХарактеристикаНоменклатуры.ДополнительныеМатериалы Цикл
				Если СтрДопМатериал.Вес = 0 
					или СтрДопМатериал.Материал.Металл.НеДрагоценныйМеталл Тогда
					Продолжить;
				КонецЕсли;	
				Если СтрДопМатериал.Материал.Металл.ПробаЧистоты = 0 Тогда
					ТекВесМеталлаВЧистоте = 0;
				Иначе	
					ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
						* СтрДопМатериал.Материал.Проба/СтрДопМатериал.Материал.Металл.ПробаЧистоты, 3);
				КонецЕсли;
				Если ТекВесМеталлаВЧистоте = 0 Тогда
					Продолжить;
				КонецЕсли;	
				СтруктураМеталла = Новый Структура;
				СтруктураМеталла.Вставить("Металл", ПолучитьМеталлПартии(СтрДопМатериал.Материал.Металл));
				СтруктураМеталла.Вставить("Проба", СтрДопМатериал.Материал.Проба*100);
				СтруктураМеталла.Вставить("ПробаПодтвержденная", СтрДопМатериал.Материал.Проба*100);
				СтруктураМеталла.Вставить("ВесМеталлаВЧистоте",  ТекВесМеталлаВЧистоте*100000);
				МассивСплавов.Добавить(СтруктураМеталла);
			КонецЦикла;	
		КонецЕсли;	
		СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);
		Если ВставкиПоКлассификатору Тогда
			ОписаниеОшибки = "";
			СведенияОВставках = СведенияОВставкахГотовойПродукции(Выборка, ДанныеПоКамням, ОписаниеОшибки);
			Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
				МассивОшибок.Добавить("Не верно заполнена спецификация вставок: " + ОписаниеОшибки + " для серии " + Выборка.ШК);
			Иначе
				СтруктураПартии.Вставить("СведенияОВставках", СведенияОВставках);
			КонецЕсли;
		ИначеЕсли Выборка.КоличествоДК > 0 Тогда	
			СтруктураДК = Новый Структура;
			СтруктураДК.Вставить("ВидКамня", "PRECIOUS_STONE");
			СтруктураДК.Вставить("Количество", Выборка.КоличествоДК);
			МассивВставок = Новый Массив;  
			МассивВставок.Добавить(СтруктураДК);
			СтруктураПартии.Вставить("СведенияОВставках", МассивВставок);
		КонецЕсли;

		Если Выборка.ПробаЧисло = 0 Тогда
			МассивОшибок.Добавить("Не заполнена проба для серии " + Выборка.ШК);
		КонецЕсли;
		Если Выборка.ВесМеталлаВЧистоте = 0 Тогда
			МассивОшибок.Добавить("Не заполнен вес металла для серии " + Выборка.ШК);
		КонецЕсли;
		Если СтруктураМеталла.Металл = "No" Тогда
			МассивОшибок.Добавить("Не удалось подобрать металл для серии " + Выборка.ШК);
		КонецЕсли;
		Если Выборка.Артикул <> "" Тогда
			СтруктураПартии.Вставить("Артикул", Выборка.Артикул);
		КонецЕсли;
		Если Выборка.ИНП <> "" Тогда
			СтруктураПартии.Вставить("ИНП", Выборка.ИНП);
		КонецЕсли;
		СтруктураСтроки.Вставить("СведенияОПродукции", СтруктураПартии);
		
		РодительскиеПартии = Новый Массив;
		РодительскаяПартия = Новый Структура;
		РодительскаяПартия.Вставить("ИНП", Выборка.ИНП);
		РодительскаяПартия.Вставить("Количество", Выборка.Количество);
		РодительскаяПартия.Вставить("Вес", Выборка.Вес*100000);
		РодительскаяПартия.Вставить("СведенияОСплаве", МассивСплавов);
		Если ВставкиПоКлассификатору Тогда
			ОписаниеОшибки = "";
			СведенияОВставках = СведенияОВставкахГотовойПродукции(Выборка, ДанныеПоКамням, ОписаниеОшибки);
			Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
				МассивОшибок.Добавить("Не верно заполнена спецификация вставок: " + ОписаниеОшибки + " для серии " + Выборка.ШК);
			Иначе
				РодительскаяПартия.Вставить("СведенияОВставкахВПродукции", СведенияОВставках);
			КонецЕсли;
		ИначеЕсли Выборка.КоличествоДК > 0 Тогда	
			СтруктураДК = Новый Структура;
			СтруктураДК.Вставить("ВидКамня", "PRECIOUS_STONE");
			СтруктураДК.Вставить("Количество", Выборка.КоличествоДК);
			МассивВставок = Новый Массив;  
			МассивВставок.Добавить(СтруктураДК);
			РодительскаяПартия.Вставить("СведенияОВставкахВПродукции", МассивВставок);
		КонецЕсли;
		РодительскиеПартии.Добавить(РодительскаяПартия);
		СтруктураСтроки.Вставить("РодительскиеПартии", РодительскиеПартии);
		
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;	

	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("МассивПартий", МассивСтрок);
	СтруктураОтвета.Вставить("МассивОшибок", МассивОшибок);
	Возврат СтруктураОтвета;

КонецФункции

