
&НаСервере
Процедура B1_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Артикул = СокрЛП(ТекущийОбъект.Артикул);
КонецПроцедуры

&НаКлиенте
&После("УстановитьВидимость")
Процедура B1_УстановитьВидимость()
	Если ЗначениеЗаполнено(Объект.B1_АртикулВБ) Тогда
		Элементы.ГруппаДопАртикулВБ.Видимость = Не ЗначениеЗаполнено(ЭтотОбъект.КоличествоХарактеристик);
	Иначе
	    Элементы.ГруппаДопАртикулВБ.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура B1_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ХарактеристикиМассив = ПолучитьХарактеристики();
	КоличествоХарактеристик = ХарактеристикиМассив.Количество();
	
	//Если КоличествоХарактеристик = 1 И ЗначениеЗаполнено(ХарактеристикиМассив[0].B1_АртикулВБ) Тогда
	//	Объект.B1_АртикулВБ = ХарактеристикиМассив[0].B1_АртикулВБ;
	//КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьХарактеристики()

	ВозвращаемыйМассив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Объект.ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВозвращаемыйМассив.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат ВозвращаемыйМассив;
		
КонецФункции

&НаКлиенте
Процедура B1_СписокСерийВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    Если Элемент.ТекущиеДанные <> Неопределено И Поле.Имя = "Серии1Ссылка" И Элемент.ТекущиеДанные.Ссылка <> Неопределено Тогда
        СтандартнаяОбработка = Ложь;
        ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
    КонецЕсли;
КонецПроцедуры

