
&ИзменениеИКонтроль("ВыполнитьКомандуВнешнегоОбъекта")
Функция B1_ВыполнитьКомандуВнешнегоОбъекта(ВнешнийОбъект, ИдентификаторКоманды, ПараметрыКоманды, АдресРезультата)

	СведенияОВнешнемОбъекте = ВнешнийОбъект.СведенияОВнешнейОбработке();

	ВидОбработки = ПолучитьВидОбработкиПоСтроковомуПредставлениюВида(СведенияОВнешнемОбъекте.Вид);

	ПередаватьПараметры = (СведенияОВнешнемОбъекте.Свойство("ВерсияБСП") И ОбщегоНазначенияКлиентСервер.СравнитьВерсии(
	СведенияОВнешнемОбъекте.ВерсияБСП, "1.2.1.4") >= 0);

	РезультатВыполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыКоманды, "РезультатВыполнения");
	Если ТипЗнч(РезультатВыполнения) <> Тип("Структура") Тогда
		ПараметрыКоманды.Вставить("РезультатВыполнения", Новый Структура);
	КонецЕсли;

	ОписаниеКоманды = СведенияОВнешнемОбъекте.Команды.Найти(ИдентификаторКоманды, "Идентификатор");
	Если ОписаниеКоманды = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
		"ru = 'Команда %1 не обнаружена!'"), ИдентификаторКоманды);
	КонецЕсли;

	ЭтоСценарийВБезопасномРежиме = (ОписаниеКоманды.Использование = "СценарийВБезопасномРежиме");

	ИзмененныеОбъекты = Неопределено;

	#Удаление
	Если ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка Или ВидОбработки
		= Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда

		ВыполнитьКомандуДополнительногоОтчетаИлиОбработки(
		ВнешнийОбъект, ИдентификаторКоманды, ?(ПередаватьПараметры, ПараметрыКоманды, Неопределено),
		ЭтоСценарийВБезопасномРежиме);

	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.СозданиеСвязанныхОбъектов Тогда

		ИзмененныеОбъекты = Новый Массив;
		ВыполнитьКомандуСозданияСвязанныхОбъектов(
		ВнешнийОбъект, ИдентификаторКоманды, ?(ПередаватьПараметры, ПараметрыКоманды, Неопределено),
		ПараметрыКоманды.ОбъектыНазначения, ИзмененныеОбъекты, ЭтоСценарийВБезопасномРежиме);

	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта Или ВидОбработки
		= Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет Или ВидОбработки
		= Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма Тогда

		ОбъектыНазначения = Неопределено;
		ПараметрыКоманды.Свойство("ОбъектыНазначения", ОбъектыНазначения);

		Если ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма Тогда

			// Здесь только произвольная печать. Печать в MXL выполняется средствами подсистемы Печать.
			ВыполнитьКомандуФормированияПечатнойФормы(
			ВнешнийОбъект, ИдентификаторКоманды, ?(ПередаватьПараметры, ПараметрыКоманды, Неопределено),
			ОбъектыНазначения, ЭтоСценарийВБезопасномРежиме);

		Иначе

			ВыполнитьНазначаемуюКомандуДополнительногоОтчетаИлиОбработки(
			ВнешнийОбъект, ИдентификаторКоманды, ?(ПередаватьПараметры, ПараметрыКоманды, Неопределено),
			ОбъектыНазначения, ЭтоСценарийВБезопасномРежиме);

			Если ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта Тогда
				ИзмененныеОбъекты = ОбъектыНазначения;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	#КонецУдаления
	#Вставка
	Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ДополнительнаяОбработка Или ВидОбработки
		= Перечисления.ВидыДополнительныхВнешнихОбработок.ДополнительныйОтчет Тогда

		ВыполнитьКомандуДополнительногоОтчетаИлиОбработки(
		ВнешнийОбъект, ИдентификаторКоманды, ?(ПередаватьПараметры, ПараметрыКоманды, Неопределено),
		ЭтоСценарийВБезопасномРежиме);

	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.СозданиеСвязанныхОбъектов Тогда

		ИзмененныеОбъекты = Новый Массив;
		ВыполнитьКомандуСозданияСвязанныхОбъектов(
		ВнешнийОбъект, ИдентификаторКоманды, ?(ПередаватьПараметры, ПараметрыКоманды, Неопределено),
		ПараметрыКоманды.ОбъектыНазначения, ИзмененныеОбъекты, ЭтоСценарийВБезопасномРежиме);

	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеОбъекта Или ВидОбработки
		= Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Или ВидОбработки
		= Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма Тогда

		ОбъектыНазначения = Неопределено;
		ПараметрыКоманды.Свойство("ОбъектыНазначения", ОбъектыНазначения);

		Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма Тогда

			// Здесь только произвольная печать. Печать в MXL выполняется средствами подсистемы Печать.
			ВыполнитьКомандуФормированияПечатнойФормы(
			ВнешнийОбъект, ИдентификаторКоманды, ?(ПередаватьПараметры, ПараметрыКоманды, Неопределено),
			ОбъектыНазначения, ЭтоСценарийВБезопасномРежиме);

		Иначе

			ВыполнитьНазначаемуюКомандуДополнительногоОтчетаИлиОбработки(
			ВнешнийОбъект, ИдентификаторКоманды, ?(ПередаватьПараметры, ПараметрыКоманды, Неопределено),
			ОбъектыНазначения, ЭтоСценарийВБезопасномРежиме);

			Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеОбъекта Тогда
				ИзмененныеОбъекты = ОбъектыНазначения;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	#КонецВставки
	
	ПараметрыКоманды.РезультатВыполнения.Вставить("ОповеститьФормы",
	СтандартныеПодсистемыСервер.ПодготовитьОповещениеФормОбИзменении(ИзмененныеОбъекты));

	Если ТипЗнч(АдресРезультата) = Тип("Строка") И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ПараметрыКоманды.РезультатВыполнения, АдресРезультата);
	КонецЕсли;

	Возврат ПараметрыКоманды.РезультатВыполнения;

КонецФункции
