
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура B1_ОбработкаПроведения(Отказ, РежимПроведения)

	Если ДополнительныеСвойства.Свойство("ТребуетсяЗаполнениеПартийВКотле") = Ложь
		И ДоговорКонтрагента.ВариантВеденияУчетаВПроизводстве = 1 
		И ПроизводственныйУчасток.СобственноеПроизводствоСПередачейДанныхВГИИС Тогда
		НаборЗаписейДанныхПоДокументу = РегистрыСведений.УИСПоДокументам.СоздатьНаборЗаписей();
		НаборЗаписейДанныхПоДокументу.Отбор.Документ.Установить(Ссылка);
		НаборЗаписейДанныхПоДокументу.Прочитать();
		Если НаборЗаписейДанныхПоДокументу.Количество() > 0 Тогда
			ЗаписьДанныхПоДокументу = НаборЗаписейДанныхПоДокументу[0];
			Если ЗначениеЗаполнено(ЗаписьДанныхПоДокументу.УИС) 
				Или ЗаписьДанныхПоДокументу.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя перепроводить документ отправленный в ГИИС ДМДК. "
				+ Ссылка);
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = УправлениеЗапасами.СформироватьДеревоПолейЗапросаПоШапке();

	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",
	"РасчетыВУсловныхЕдиницах", "РасчетыВУсловныхЕдиницах");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",
	"ВалютаВзаиморасчетов", "ВалютаВзаиморасчетов");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",
	"Организация", "ДоговорОрганизация");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад", "ВидСклада",
	"ВидСклада");

	// Реквизит перенесенные для производственного учета
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ПроизводственныйУчасток",
	"СобственноеПроизводство", "СобственноеПроизводство");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ПроизводственныйУчасток",
	"ПоиздельныйУчет", "ПоиздельныйУчет");	

	// Для контроля остатков по взаиморасчетам.
	УправлениеВзаиморасчетами.ДополнитьДеревоПолейЗапросаПоШапкеДляКонтроляВзаиморасчетовУпр(ДеревоПолейЗапросаПоШапке,
	РежимПроведения);

	// Сформируем запрос на дополнительные параметры, нужные при проведении, 
	// по данным шапки документа.
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке,
	СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	ВариантВеденияУчетаВПроизводстве = ДоговорКонтрагента.ВариантВеденияУчетаВПроизводстве;
	// Получим необходимые данные для проведения и проверки заполенения данные 
	// по табличной части "Товары".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура", "Номенклатура");
	СтруктураПолей.Вставить("Размер", "Размер");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("ВидНоменклатуры", "Номенклатура.ВидНоменклатуры");
	СтруктураПолей.Вставить("ЭтоГруппа", "Номенклатура.ЭтоГруппа");
	СтруктураПолей.Вставить("Количество", "Количество");
	СтруктураПолей.Вставить("Вес", "Вес");
	СтруктураПолей.Вставить("СерияНоменклатуры", "СерияНоменклатуры");
	СтруктураПолей.Вставить("УИН", "СерияНоменклатуры.УИН");
	СтруктураПолей.Вставить("ВидНоменклатуры", "Номенклатура.ВидНоменклатуры");
	СтруктураПолей.Вставить("ВидКамня", "Номенклатура.Камень.ВидКамня");
	СтруктураПолей.Вставить("НеДрагоценныйМеталл", "Номенклатура.Проба.Металл.НеДрагоценныйМеталл");

	РезультатЗапросаПоТоварам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары",
	СтруктураПолей);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);

	// Проверить заполнение ТЧ.
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Движения по документу.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства,
	РежимПроведения);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Если Не Отказ и ВариантВеденияУчетаВПроизводстве = 0 Тогда

		ЮвелирнаяТорговля.ПередачаМатериаловВПроизводство_ДвиженияПоРегистрам(ЭтотОбъект, РежимПроведения,
		СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);

		Для Каждого НаборЗаписей Из Движения Цикл

			Если НаборЗаписей.Количество() > 0 Тогда

				НаборЗаписей.Записывать = Истина;

			КонецЕсли;

		КонецЦикла;

		#Удаление
		Для Каждого Стр Из Движения.ПартииТоваровВПроизводстве Цикл
			Стр.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
		КонецЦикла;
		#КонецУдаления	
	КонецЕсли;

	СформироватьСписокРегистровДляКонтроля();

	ЮвелирнаяТорговля.ПередачаМатериаловВПроизводство_ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
	Если ВариантВеденияУчетаВПроизводстве = 1 Тогда
		ПроведениеСервер.ОтразитьПартииТоваровНаСкладах(ДополнительныеСвойства, Движения, Отказ);
		ПроведениеСервер.ОтразитьПартииТоваровВПроизводстве(ДополнительныеСвойства, Движения, Отказ);
		Если ДополнительныеСвойства.Свойство("ТребуетсяЗаполнениеПартийВКотле") Тогда
			ПроведениеСервер.ОтразитьДвижениеПоРегистру("ОстаткиПартийМеталлаГИИСДМДК", ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
	КонецЕсли;

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

//&ИзменениеИКонтроль("ОбработкаПроведения")
//Процедура B1_ОбработкаПроведения(Отказ, РежимПроведения)

//	Если ДополнительныеСвойства.Свойство("ТребуетсяЗаполнениеПартийВКотле") = Ложь
//		И ДоговорКонтрагента.ВариантВеденияУчетаВПроизводстве = 1 
//		И ПроизводственныйУчасток.СобственноеПроизводствоСПередачейДанныхВГИИС Тогда
//		НаборЗаписейДанныхПоДокументу = РегистрыСведений.УИСПоДокументам.СоздатьНаборЗаписей();
//		НаборЗаписейДанныхПоДокументу.Отбор.Документ.Установить(Ссылка);
//		НаборЗаписейДанныхПоДокументу.Прочитать();
//		Если НаборЗаписейДанныхПоДокументу.Количество() > 0 Тогда
//			ЗаписьДанныхПоДокументу = НаборЗаписейДанныхПоДокументу[0];
//			Если ЗначениеЗаполнено(ЗаписьДанныхПоДокументу.УИС) 
//				Или ЗаписьДанныхПоДокументу.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
//				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя перепроводить документ отправленный в ГИИС ДМДК. "
//				+ Ссылка);
//				Отказ = Истина;
//			КонецЕсли;	
//		КонецЕсли;
//	КонецЕсли;

//	// Заголовок для сообщений об ошибках проведения.
//	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

//	// Сформируем структуру реквизитов шапки документа.
//	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

//	// Заполним по шапке документа дерево параметров, нужных при проведении.
//	ДеревоПолейЗапросаПоШапке = УправлениеЗапасами.СформироватьДеревоПолейЗапросаПоШапке();

//	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",
//	"РасчетыВУсловныхЕдиницах", "РасчетыВУсловныхЕдиницах");
//	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",
//	"ВалютаВзаиморасчетов", "ВалютаВзаиморасчетов");
//	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов",
//	"Организация", "ДоговорОрганизация");
//	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад", "ВидСклада",
//	"ВидСклада");

//	// Реквизит перенесенные для производственного учета
//	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ПроизводственныйУчасток",
//	"СобственноеПроизводство", "СобственноеПроизводство");
//	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ПроизводственныйУчасток",
//	"ПоиздельныйУчет", "ПоиздельныйУчет");	

//	// Для контроля остатков по взаиморасчетам.
//	УправлениеВзаиморасчетами.ДополнитьДеревоПолейЗапросаПоШапкеДляКонтроляВзаиморасчетовУпр(ДеревоПолейЗапросаПоШапке,
//	РежимПроведения);

//	// Сформируем запрос на дополнительные параметры, нужные при проведении, 
//	// по данным шапки документа.
//	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке,
//	СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

//	// Проверим правильность заполнения шапки документа.
//	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

//	ВариантВеденияУчетаВПроизводстве = ДоговорКонтрагента.ВариантВеденияУчетаВПроизводстве;
//	// Получим необходимые данные для проведения и проверки заполенения данные 
//	// по табличной части "Товары".
//	СтруктураПолей = Новый Структура;
//	СтруктураПолей.Вставить("Номенклатура", "Номенклатура");
//	СтруктураПолей.Вставить("Размер", "Размер");
//	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
//	СтруктураПолей.Вставить("ВидНоменклатуры", "Номенклатура.ВидНоменклатуры");
//	СтруктураПолей.Вставить("ЭтоГруппа", "Номенклатура.ЭтоГруппа");
//	СтруктураПолей.Вставить("Количество", "Количество");
//	СтруктураПолей.Вставить("Вес", "Вес");
//	СтруктураПолей.Вставить("СерияНоменклатуры", "СерияНоменклатуры");

//	РезультатЗапросаПоТоварам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары",
//	СтруктураПолей);

//	// Подготовим таблицу товаров для проведения.
//	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);

//	// Проверить заполнение ТЧ.
//	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);

//	// Движения по документу.
//	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства,
//	РежимПроведения);
//	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

//	Если Не Отказ и ВариантВеденияУчетаВПроизводстве = 0 Тогда

//		ЮвелирнаяТорговля.ПередачаМатериаловВПроизводство_ДвиженияПоРегистрам(ЭтотОбъект, РежимПроведения,
//		СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);

//		Для Каждого НаборЗаписей Из Движения Цикл

//			Если НаборЗаписей.Количество() > 0 Тогда

//				НаборЗаписей.Записывать = Истина;

//			КонецЕсли;

//		КонецЦикла;
//		
//		#Удаление
//		Для Каждого Стр Из Движения.ПартииТоваровВПроизводстве Цикл
//			Стр.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
//		КонецЦикла;
//		#КонецУдаления
//	КонецЕсли;

//	СформироватьСписокРегистровДляКонтроля();

//	ЮвелирнаяТорговля.ПередачаМатериаловВПроизводство_ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

//	ПроведениеСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
//	Если ВариантВеденияУчетаВПроизводстве = 1 Тогда
//		ПроведениеСервер.ОтразитьПартииТоваровНаСкладах(ДополнительныеСвойства, Движения, Отказ);
//		ПроведениеСервер.ОтразитьПартииТоваровВПроизводстве(ДополнительныеСвойства, Движения, Отказ);
//		Если ДополнительныеСвойства.Свойство("ТребуетсяЗаполнениеПартийВКотле") Тогда
//			ПроведениеСервер.ОтразитьДвижениеПоРегистру("ОстаткиПартийМеталлаГИИСДМДК", ДополнительныеСвойства, Движения, Отказ);
//		КонецЕсли;
//	КонецЕсли;

//	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
//	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
//	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

//КонецПроцедуры
