
&НаКлиенте
&ИзменениеИКонтроль("ОсновныеДействияФормыВыбрать")
Процедура B1_ОсновныеДействияФормыВыбрать(Команда)
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не выбрана строка!");
		Возврат;
	КонецЕсли;
	#Удаление
	Закрыть(ЗаполнитьСтруктуруВозврата(Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор()));
	#КонецУдаления
	#Вставка
	МассивСтрок = Новый Массив;
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(ЗаполнитьСтруктуруВозврата(ВыделеннаяСтрока));
	КонецЦикла; 
	Закрыть(МассивСтрок);
	#КонецВставки
КонецПроцедуры
