Функция ПолучитьПредопределенноеЗначение(ИмяКодПредопределенногоЗначения, ВозвращатьЗначение = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяКодПредопределенногоЗначения) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли; 

	Если ТипЗнч(ИмяКодПредопределенногоЗначения) = Тип("Строка") Тогда
		
		НайденныйЭлементСправочника = Справочники.B1_ПредопределенныеЗначения.НайтиПоНаименованию(ИмяКодПредопределенногоЗначения, Истина);
		
	Иначе
		
		КодСтрокой = СтрЗаменить(СтрЗаменить(Строка(ИмяКодПредопределенногоЗначения), Символы.НПП, ""), " ", "");
		
		Пока СтрДлина(КодСтрокой) <> 9 Цикл
			КодСтрокой = "0" + КодСтрокой;	
		КонецЦикла; 
		
		НайденныйЭлементСправочника = Справочники.B1_ПредопределенныеЗначения.НайтиПоКоду(КодСтрокой);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
	
		Если ВозвращатьЗначение Тогда
		
			Возврат НайденныйЭлементСправочника.Значение;
			
		Иначе
			
			Возврат НайденныйЭлементСправочника;
		
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли; 
	
КонецФункции