
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура B1_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Дата = ТекущаяДатаСеанса();
		ТипОснования = ТипЗнч(ДанныеЗаполнения);
		Если ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
			Или ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку")
			Или ТипОснования = Тип("ДокументСсылка.ПоступлениеПродукцииИзПроизводства") Тогда
			ВариантАгрегирования = 1;
			РучноеЗаполнение = Истина;
		Иначе	
			ВариантАгрегирования = 0;
		КонецЕсли;	
		
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("ДокументОбъект", ЭтотОбъект);
		ДанныеДокумента.Вставить("МассивСерий", ДанныеЗаполнения.Товары.ВыгрузитьКолонку("СерияНоменклатуры"));
		Документы.ВводОстатковАгрегированныхПартий.ЗаполнитьДанныеПоОтборамИВариантуАгрегирования(ДанныеДокумента);
		#Вставка
		Для Каждого ТекСтрока Из ЭтотОбъект.Товары Цикл
			ТекСтрока.ВесМеталлаВЧистоте = ТекСтрока.Вес * ТекСтрока.Проба.Проба / 999;
		КонецЦикла;
		#КонецВставки
	КонецЕсли;

КонецПроцедуры
