#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Списание товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Комплектация";
	КомандаПечати.Представление = НСтр("ru = 'Комплектация'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюЮТДКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктПеревода";
	КомандаПечати.Представление = НСтр("ru = 'Акт перевода товаров в материалы'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюЮТДКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента";

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТОРГ16";
	КомандаПечати.Представление = НСтр("ru = 'ТОРГ-16 (Акт о списании товаров)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюЮТДКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента";

КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьСписаниеТоваров(МассивОбъектов)

	мВалютаРегламентированногоУчета  = Константы.ВалютаРегламентированногоУчета.Получить();
	Ссылка = МассивОбъектов[0].Ссылка;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомплектацияТоваров.Номер КАК Номер,
	|	КомплектацияТоваров.Дата КАК Дата,
	|	КомплектацияТоваров.Организация КАК Организация,
	|	КомплектацияТоваров.Склад КАК Склад,
	|	КомплектацияТоваров.Склад.Представление КАК ПредставлениеСклада,
	|	Константы.ВалютаРегламентированногоУчета КАК ВалютаДокумента,
	|	КомплектацияТоваров.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура.Артикул КАК Артикул,
	|		Количество КАК Количество,
	|		СерияНоменклатуры.Качество КАК Качество,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		СерияНоменклатуры КАК Серия,
	|		Вес КАК Вес,
	|		Размер КАК Размер,
	|		ВЫБОР
	|			КОГДА КомплектацияТоваров.Товары.Количество = 0
	|				ТОГДА ВЫРАЗИТЬ(КомплектацияТоваров.Товары.Стоимость / КомплектацияТоваров.Товары.Вес КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(КомплектацияТоваров.Товары.Стоимость / КомплектацияТоваров.Товары.Количество КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК Цена,
	|		Стоимость КАК Сумма,
	|		ЦенаВРознице КАК ЦенаВРознице
	|	) КАК Товары,
	|	КомплектацияТоваров.Комплект КАК Комплект,
	|	КомплектацияТоваров.ВесКомплекта КАК Вес,
	|	КомплектацияТоваров.КоличествоКомплекта КАК Количество,
	|	КомплектацияТоваров.СерияНоменклатурыКомплекта КАК СерияНоменклатуры,
	|	КомплектацияТоваров.ХарактеристикаНоменклатурыКомплекта КАК ХарактеристикаНоменклатуры,
	|	КомплектацияТоваров.РазмерКомплекта КАК Размер,
	|	КомплектацияТоваров.ЦенаВРозницеКомплекта КАК ЦенаВРознице,
	|	КомплектацияТоваров.ВидОперации КАК ВидОперации
	|ИЗ
	|	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров,
	|	Константы КАК Константы
	|ГДЕ
	|	КомплектацияТоваров.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	КомплектацияТоваров.Товары.НомерСтроки";

	ЭтоСкладНТТ = (Ссылка.Склад.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка);

	Если ЭтоСкладНТТ Тогда
		ИмяШапки         = "ШапкаТаблицы";
		ИмяСтроки        = "Строка";
	Иначе
		ИмяШапки         = "ШапкаТаблицыНТТ";
		ИмяСтроки        = "СтрокаНТТ";
	КонецЕсли;

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеТоваров_Накладная";

	Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПреобразованиеВЛом.Комплектация");

	// Выводим шапку накладной
	ОбластьМакета                          = Макет.ПолучитьОбласть("Заголовок");
	Если Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
		ОбластьМакета.Параметры.ТекстЗаголовка = ФормированиеПечатныхФормУ.СформироватьЗаголовокДокумента(Шапка,
			"Комплектация изделий");
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом Тогда
		ОбластьМакета.Параметры.ТекстЗаголовка = ФормированиеПечатныхФормУ.СформироватьЗаголовокДокумента(Шапка,
			"Комплектация лома");
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда	
		ОбластьМакета.Параметры.ТекстЗаголовка = ФормированиеПечатныхФормУ.СформироватьЗаголовокДокумента(Шапка,
			"Разукомплектация");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыОрганизации");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ПредставлениеОрганизации = ФормированиеПечатныхФормУ.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,");
	ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
	ОбластьМакета.Параметры.ПредставлениеКомплекта = "" + Шапка.Комплект + ?(ЗначениеЗаполнено(Шапка.Размер), " р-р: " + Шапка.Размер, "")
	+ Шапка.ХарактеристикаНоменклатуры + Шапка.СерияНоменклатуры + ?(Шапка.ЦенаВРознице = 0, "", " по цене: " + Шапка.ЦенаВРознице);
	ОбластьМакета.Параметры.КоличествоВесКомплекта = ?(Шапка.Количество = 0, "", " в количестве: " + Шапка.Количество)
		+?(Шапка.Вес = 0, "", ?(Шапка.Количество = 0, " в весе: ", " и весе: ") + Шапка.Вес);
	
	ТабДокумент.Вывести(ОбластьМакета);

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;

	ОбластьНомера  = Макет.ПолучитьОбласть(ИмяШапки + "|НомерСтроки");
	ОбластьКодов   = Макет.ПолучитьОбласть(ИмяШапки + "|КолонкаКодов");
	ОбластьТовар   = Макет.ПолучитьОбласть(ИмяШапки + "|Товар");
	ОбластьДанных  = Макет.ПолучитьОбласть(ИмяШапки + "|Данные");

	ТабДокумент.Вывести(ОбластьНомера);
	Если ВыводитьКоды Тогда
		ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьТовар);

	ТабДокумент.Присоединить(ОбластьДанных);

	ОбластьНомера = Макет.ПолучитьОбласть(ИмяСтроки + "|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть(ИмяСтроки + "|КолонкаКодов");
	ОбластьТовар  = Макет.ПолучитьОбласть(ИмяСтроки + "|Товар");
	ОбластьДанных = Макет.ПолучитьОбласть(ИмяСтроки + "|Данные");

	СуммаИтого = 0;
	Ном        = 0;
	ИтогоВес   = 0;
	ИтогоКоличество = 0;

	// Товары
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если Не ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(
				"В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.");
			Продолжить;
		КонецЕсли;

		Ном = Ном + 1;

		ОбластьНомера.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьНомера.Параметры.НомерСтроки = Ном;
		ТабДокумент.Вывести(ОбластьНомера);

		Если ВыводитьКоды Тогда
			Если Колонка = "Артикул" Тогда
				ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
			Иначе
				ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;

		ОбластьТовар.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьТовар.Параметры.Товар = ЮвелирнаяТорговля.ювПредставлениеТовара(ВыборкаСтрокТовары.Номенклатура,
			ВыборкаСтрокТовары.Размер, ВыборкаСтрокТовары.Характеристика);
		ТабДокумент.Присоединить(ОбластьТовар);

		ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
		Если ЭтоСкладНТТ Тогда
			ОбластьДанных.Параметры.Цена = ВыборкаСтрокТовары.ЦенаВРознице;
			ОбластьДанных.Параметры.Сумма = ВыборкаСтрокТовары.ЦенаВРознице;
			Сумма = ВыборкаСтрокТовары.ЦенаВРознице;
		Иначе
			ОбластьДанных.Параметры.Сумма = ВыборкаСтрокТовары.Сумма;
			Сумма = ВыборкаСтрокТовары.Сумма;
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьДанных);

		СуммаИтого = СуммаИтого + Сумма;
		ИтогоВес   = ИтогоВес + ВыборкаСтрокТовары.Вес;
		ИтогоКоличество = ИтогоКоличество + ВыборкаСтрокТовары.Количество;

	КонецЦикла;

	// Вывести Итого
	ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
	ОбластьТовар  = Макет.ПолучитьОбласть("Итого|Товар");
	ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");

	ТабДокумент.Вывести(ОбластьНомера);
	Если ВыводитьКоды Тогда
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьТовар);
	ОбластьДанных.Параметры.Всего = ОбщегоНазначения.ФорматСумм(СуммаИтого);
	ОбластьДанных.Параметры.ИтогоВес = ИтогоВес;
	ОбластьДанных.Параметры.ИтогоКоличество = ИтогоКоличество;
	ТабДокумент.Присоединить(ОбластьДанных);

	// Вывести Сумму прописью
	ОбластьМакета                          = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований " + Ном + ", на сумму " + ОбщегоНазначения.ФорматСумм(
		СуммаИтого, мВалютаРегламентированногоУчета);
	ОбластьМакета.Параметры.СуммаПрописью  = ФормированиеПечатныхФормУ.СформироватьСуммуПрописью(СуммаИтого,
		мВалютаРегламентированногоУчета);
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	МОЛСклада = ФормированиеПечатныхФормУ.ПолучитьСведенияОМОЛСклада(Шапка.Склад, Шапка.Дата);
	ОбластьМакета.Параметры.ОтветственныйПредставление = "( " + СокрЛП(ФормированиеПечатныхФормУ.ФамилияИнициалыФизЛица(
		МОЛСклада.Кладовщик)) + ")";
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьСписаниеТоваров()

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьАктаПеревода(МассивОбъектов)

	мВалютаРегламентированногоУчета  = Константы.ВалютаРегламентированногоУчета.Получить();
	Ссылка = МассивОбъектов[0].Ссылка;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомплектацияТоваров.Номер КАК Номер,
	|	КомплектацияТоваров.Дата КАК Дата,
	|	КомплектацияТоваров.Организация КАК Организация,
	|	КомплектацияТоваров.Склад КАК Склад,
	|	КомплектацияТоваров.Склад.Представление КАК ПредставлениеСклада,
	|	Константы.ВалютаРегламентированногоУчета КАК ВалютаДокумента,
	|	КомплектацияТоваров.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура.Артикул КАК Артикул,
	|		Количество КАК Количество,
	|		СерияНоменклатуры КАК Серия,
	|		Вес КАК Вес,
	|		Стоимость КАК Сумма,
	|		ЦенаВРознице КАК ЦенаВРознице,
	|		Номенклатура.Проба КАК НоменклатураПроба,
	|		Номенклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдИзмКод,
	|		Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК ЕдИзмНаименование,
	|		Стоимость - СтоимостьБезНДС КАК СуммаНДС,
	|		НомерСтроки КАК НомерСтроки
	|	) КАК Товары,
	|	КомплектацияТоваров.Комплект КАК Комплект,
	|	КомплектацияТоваров.ВесКомплекта КАК Вес,
	|	КомплектацияТоваров.КоличествоКомплекта КАК Количество,
	|	КомплектацияТоваров.СерияНоменклатурыКомплекта КАК СерияНоменклатуры,
	|	КомплектацияТоваров.ХарактеристикаНоменклатурыКомплекта КАК ХарактеристикаНоменклатуры,
	|	КомплектацияТоваров.РазмерКомплекта КАК Размер,
	|	КомплектацияТоваров.ЦенаВРозницеКомплекта КАК ЦенаВРознице,
	|	КомплектацияТоваров.ВидОперации КАК ВидОперации,
	|	КомплектацияТоваров.Приказ.ПредседательКомиссии КАК ДолжностьПредседателя,
	|	КомплектацияТоваров.Приказ.ДолжностьПредседателяКомиссии КАК ФИОПредседателя,
	|	КомплектацияТоваров.Приказ.ЧленКомиссии1 КАК ФИОЧленаКомиссии2,
	|	КомплектацияТоваров.Приказ.ДолжностьЧленаКомиссии1 КАК ДолжностьЧленаКомиссии2,
	|	КомплектацияТоваров.Приказ.ЧленКомиссии2 КАК ФИОЧленаКомиссии3,
	|	КомплектацияТоваров.Приказ.ДолжностьЧленаКомиссии2 КАК ДолжностьЧленаКомиссии3,
	|	КомплектацияТоваров.Приказ.ЧленКомиссии3 КАК ФИОЧленаКомиссии4,
	|	КомплектацияТоваров.Приказ.ДолжностьЧленаКомиссии3 КАК ДолжностьЧленаКомиссии4
	|ИЗ
	|	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров,
	|	Константы КАК Константы
	|ГДЕ
	|	КомплектацияТоваров.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	КомплектацияТоваров.Товары.НомерСтроки";

	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеТоваров_Накладная";

	Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПреобразованиеВЛом.АктПеревода");

	// Выводим шапку накладной
	ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаЗаголовок.Параметры.Номер = Шапка.Номер;
	ОбластьМакетаЗаголовок.Параметры.Организация = ФормированиеПечатныхФормУ.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,");
	ОбластьМакетаЗаголовок.Параметры.Склад = Шапка.Склад;
	ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьМакетаШапка.Параметры.Дата = Шапка.Дата;
	ТабДокумент.Вывести(ОбластьМакетаШапка);

	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	ВесИтого		 = 0;
	СуммаИтого       = 0;
	СуммаНДСИтого    = 0;
	ЦенаВРозницеИтого= 0;
	КоличествоИтого  = 0;
	
	ВыборкаСтрок = Шапка.Товары.Выбрать();
	Пока ВыборкаСтрок.Следующий() Цикл

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрок);
		ОбластьМакета.Параметры.Номенклатура = СокрЛП(ВыборкаСтрок.Товар);
		
		ТабДокумент.Вывести(ОбластьМакета);

		ВесИтого		 = ВесИтого + ВыборкаСтрок.Вес;
		СуммаИтого       = СуммаИтого + ВыборкаСтрок.Сумма;
		СуммаНДСИтого    = СуммаНДСИтого + ВыборкаСтрок.СуммаНДС;
		ЦенаВРозницеИтого= ЦенаВРозницеИтого + ВыборкаСтрок.ЦенаВРознице;
		КоличествоИтого  = КоличествоИтого + ВыборкаСтрок.Количество;
		
	КонецЦикла;

	// Вывести Итого
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицы");
						
	ОбластьМакета.Параметры.ВесИтого        = ВесИтого;
	ОбластьМакета.Параметры.СуммаИтого 		= СуммаИтого;
	ОбластьМакета.Параметры.СуммаНДСИтого 	= СуммаНДСИтого;
	ОбластьМакета.Параметры.СуммаБезНДС     = СуммаИтого - СуммаНДСИтого;
	//ОбластьМакета.Параметры.ЦенаВРозницеИтого = ЦенаВРозницеИтого;
	
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.КоличествоИтого = КоличествоИтого;
	ОбластьМакета.Параметры.ВесИтого        = ВесИтого;
	ОбластьМакета.Параметры.СуммаИтого 		= СуммаИтого;
	ОбластьМакета.Параметры.СуммаИтогоПрописью = ФормированиеПечатныхФормУ.СформироватьСуммуПрописью(СуммаИтого, мВалютаРегламентированногоУчета);;
//	ОбластьМакета.Параметры.ЦенаВРозницеИтого = ЦенаВРозницеИтого;
	
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьСписаниеТоваров()

// Формирует унифицированную форму ТОРГ-16
//
// Возвращаемое значение:
//  Табличный документ - унифицировання форма ТОРГ-16
//
Функция ПечатьТОРГ16(МассивОбъектов)

	Ссылка = МассивОбъектов[0].Ссылка;

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ВидСкладаНТТ", Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка);
	Запрос.УстановитьПараметр("ТоварКод", ТоварКод);

	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияТоваров.Номер КАК НомерДокумента,
	               |	КомплектацияТоваров.Дата КАК ДатаДокумента,
	               |	КомплектацияТоваров.Организация КАК Организация,
	               |	КомплектацияТоваров.Организация КАК Руководители,
	               |	КомплектацияТоваров.Склад КАК Склад,
	               |	КомплектацияТоваров.Склад.Представление КАК ПредставлениеСклада,
	               |	КомплектацияТоваров.ДокументОснование КАК Основание,
	               |	КомплектацияТоваров.СтоимостьКомплекта КАК СуммаДокумента,
	               |	Константы.ВалютаРегламентированногоУчета КАК ВалютаДокумента,
	               |	КомплектацияТоваров.Товары.(
	               |		Номенклатура КАК Номенклатура,
	               |		Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	               |		ВЫБОР
	               |			КОГДА &ТоварКод = ""Код""
	               |				ТОГДА КомплектацияТоваров.Товары.Номенклатура.Код
	               |			ИНАЧЕ КомплектацияТоваров.Товары.Номенклатура.Артикул
	               |		КОНЕЦ КАК Код,
	               |		Количество КАК Количество,
	               |		СерияНоменклатуры.Качество КАК Качество,
	               |		Номенклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	               |		Номенклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
	               |		1 КАК МассаОдногоМеста,
	               |		ВЫБОР
	               |			КОГДА КомплектацияТоваров.Склад.ВидСклада = &ВидСкладаНТТ
	               |				ТОГДА КомплектацияТоваров.Товары.ЦенаВРознице
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК Цена,
	               |		ВЫБОР
	               |			КОГДА КомплектацияТоваров.Склад.ВидСклада = &ВидСкладаНТТ
	               |				ТОГДА КомплектацияТоваров.Товары.Стоимость
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК Стоимость,
	               |		ХарактеристикаНоменклатуры КАК Характеристика,
	               |		СерияНоменклатуры КАК ТоварКод,
	               |		Вес КАК МассаНетто,
	               |		Размер КАК Размер
	               |	) КАК Товары,
	               |	КомплектацияТоваров.Комплект КАК Номенклатура,
	               |	КомплектацияТоваров.ВесКомплекта КАК МассаНетто,
	               |	КомплектацияТоваров.КоличествоКомплекта КАК Количество,
	               |	КомплектацияТоваров.СерияНоменклатурыКомплекта КАК ТоварКод,
	               |	КомплектацияТоваров.ХарактеристикаНоменклатурыКомплекта КАК Характеристика,
	               |	КомплектацияТоваров.РазмерКомплекта КАК Размер,
	               |	КомплектацияТоваров.ЦенаВРозницеКомплекта КАК ЦенаВРознице,
	               |	КомплектацияТоваров.Комплект.НаименованиеПолное КАК ТоварНаименование,
	               |	ВЫБОР
	               |		КОГДА &ТоварКод = ""Код""
	               |			ТОГДА КомплектацияТоваров.Комплект.Код
	               |		ИНАЧЕ КомплектацияТоваров.Комплект.Артикул
	               |	КОНЕЦ КАК Код,
	               |	КомплектацияТоваров.Комплект.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	               |	КомплектацияТоваров.Комплект.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
	               |	1 КАК МассаОдногоМеста,
	               |	ВЫБОР
	               |		КОГДА КомплектацияТоваров.Склад.ВидСклада = &ВидСкладаНТТ
	               |			ТОГДА КомплектацияТоваров.ЦенаВРозницеКомплекта
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА КомплектацияТоваров.Склад.ВидСклада = &ВидСкладаНТТ
	               |			ТОГДА КомплектацияТоваров.СтоимостьКомплекта
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Стоимость,
	               |	КомплектацияТоваров.ВидОперации КАК ВидОперации,
	               |	КомплектацияТоваров.Приказ.ПредседательКомиссии КАК ФИОПредседателя,
	               |	КомплектацияТоваров.Приказ.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателя,
	               |	КомплектацияТоваров.Приказ.ЧленКомиссии1 КАК ФИОЧленаКомиссии2,
	               |	КомплектацияТоваров.Приказ.ДолжностьЧленаКомиссии1 КАК ДолжностьЧленаКомиссии2,
	               |	КомплектацияТоваров.Приказ.ЧленКомиссии2 КАК ФИОЧленаКомиссии3,
	               |	КомплектацияТоваров.Приказ.ДолжностьЧленаКомиссии2 КАК ДолжностьЧленаКомиссии3,
	               |	КомплектацияТоваров.Приказ.ЧленКомиссии3 КАК ФИОЧленаКомиссии4,
	               |	КомплектацияТоваров.Приказ.ДолжностьЧленаКомиссии3 КАК ДолжностьЧленаКомиссии4
	               |ИЗ
	               |	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров,
	               |	Константы КАК Константы
	               |ГДЕ
	               |	КомплектацияТоваров.Ссылка = &ТекущийДокумент";

	РезультатЗапроса = Запрос.Выполнить();
	Шапка = РезультатЗапроса.Выбрать();
	Шапка.Следующий();

	Макет       = УправлениеПечатью.ПолучитьМакет("ОбщийМакет.ТОРГ16");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеТоваров_ТОРГ16";

	// Выводим общие реквизиты шапки
	ОписаниеОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
	ОбластьМакета       = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
	ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФормУ.ОписаниеОрганизации(ОписаниеОрганизации);
	ОбластьМакета.Параметры.ОрганизацияПоОКПО        = ОписаниеОрганизации.КодПоОКПО;

	Руководители = ФормированиеПечатныхФормУ.ОтветственныеЛицаОрганизации(Шапка.Руководители, Шапка.ДатаДокумента, );
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	ОбластьМакета.Параметры.ФИОРуководителя = Руководитель;

	ТабДокумент.Вывести(ОбластьМакета);

	СтрокНаСтранице = 23;
	СтрокШапки      = 11;
	СтрокПодвала    = 0;
	НомерСтраницы   = 1;
	Ном             = 0;
	НомПП           = 0;

	// Товары
	Если Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		КоличествоСтрок    = ВыборкаСтрокТовары.Количество();
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом 
		Или Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом
		Или Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни Тогда
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		КоличествоСтрок    = ВыборкаСтрокТовары.Количество();
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие
		Или Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни
		Или Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом Тогда	
		ВыборкаСтрокТовары = РезультатЗапроса.Выбрать();
		КоличествоСтрок    = 1;
	КонецЕсли;
	
	Если КоличествоСтрок = 1 Тогда
		ПереноситьПоследнююСтроку = 0;
	Иначе
		ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
		ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
		ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
	КонецЕсли;

	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыПервогоЛиста");
	ТабДокумент.Вывести(ЗаголовокТаблицы);

	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПервогоЛиста");
	
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если Не ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(
				"В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.");
			Продолжить;
		КонецЕсли;

		Если НомерСтраницы = 2 Тогда
			СтрокНаСтранице = 27;
			СтрокШапки      = 5;
			СтрокПодвала    = 11;
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок - НомПП + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - НомПП - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;

		Ном   = Ном + 1;
		НомПП = НомПП + 1;

		//Начинаем новую страницу, если предыдущая строка была последней на странице
		//или пора переносить последнюю строку на последнюю страницу с подвалом.
		ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
		Если (ЦелаяСтраница = Цел(ЦелаяСтраница)) Или ((ПереноситьПоследнююСтроку = 1) И (НомПП = КоличествоСтрок)) Тогда
			Ном                      = 0;
			ИтогоСтоимостьПоСтранице = 0;
			НомерСтраницы            = НомерСтраницы + 1;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ЗаголовокТаблицы);
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);

		ОбластьМакета.Параметры.ДатаСписанияТовара = Шапка.ДатаДокумента;

		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	СтрокНаСтранице = 23;
	СтрокШапки      = 11;
	СтрокПодвала    = 0;
	НомерСтраницы   = 1;
	Ном             = 0;
	НомПП           = 0;

	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	НомерСтраницы                            = НомерСтраницы + 1;
	ЗаголовокТаблицы                         = Макет.ПолучитьОбласть("ЗаголовокТаблицыВторогоЛиста");
	ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
	ТабДокумент.Вывести(ЗаголовокТаблицы);

	Если КоличествоСтрок = 1 Тогда
		ПереноситьПоследнююСтроку = 0;
	Иначе
		ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
		ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
		ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
	КонецЕсли;

	ИтогоСтоимость = 0;

	// Выводим многострочную часть докмента
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВторогоЛиста");

	// Товары
	ИтогоМассаНетто = 0;
	ИтогоКоличество = 0;
	Если Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом
		Или Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом
		Или Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни Тогда
		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	ИначеЕсли Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие
		Или Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни
		Или Шапка.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом Тогда	
		ВыборкаСтрокТовары = РезультатЗапроса.Выбрать();
	КонецЕсли;
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если Не ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(
				"В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.");
			Продолжить;
		КонецЕсли;

		Если НомерСтраницы = 3 Тогда
			СтрокНаСтранице = 27;
			СтрокШапки      = 5;
			СтрокПодвала    = 11;
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок - НомПП + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - НомПП - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;

		Ном   = Ном + 1;
		НомПП = НомПП + 1;

		//Начинаем новую страницу, если предыдущая строка была последней на странице
		//или пора переносить последнюю строку на последнюю страницу с подвалом.
		ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;

		Если (ЦелаяСтраница = Цел(ЦелаяСтраница)) Или ((ПереноситьПоследнююСтроку = 1) И (НомПП = КоличествоСтрок)) Тогда
			Ном                      = 0;
			ИтогоСтоимостьПоСтранице = 0;
			НомерСтраницы            = НомерСтраницы + 1;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабДокумент.Вывести(ЗаголовокТаблицы);
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);

		КоличествоМест = Формат(ВыборкаСтрокТовары.Количество, "ЧЦ=15; ЧДЦ=3");

		ОбластьМакета.Параметры.КоличествоМест    = КоличествоМест;
		ОбластьМакета.Параметры.ТоварНаименование = ЮвелирнаяТорговля.ювПредставлениеТовара(
			ВыборкаСтрокТовары.Номенклатура, ВыборкаСтрокТовары.Размер, ВыборкаСтрокТовары.Характеристика);

		Стоимость = ВыборкаСтрокТовары.Стоимость;
		Цена      = ВыборкаСтрокТовары.Цена;

		ОбластьМакета.Параметры.Стоимость = Стоимость;
		ОбластьМакета.Параметры.Цена      = Цена;

		ТабДокумент.Вывести(ОбластьМакета);

		// Обновим итоги по документу
		ИтогоСтоимость = ИтогоСтоимость + Стоимость;
		ИтогоМассаНетто = ИтогоМассаНетто + ВыборкаСтрокТовары.МассаНетто;
		ИтогоКоличество = ИтогоКоличество + ВыборкаСтрокТовары.Количество;
	КонецЦикла;

	// Выводим итоги по документу в общем
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Итого = ИтогоСтоимость;
	ОбластьМакета.Параметры.ИтогоМассаНетто = ИтогоМассаНетто;
	ОбластьМакета.Параметры.ИтогоКоличество = ИтогоКоличество;
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.СуммаСписанияПрописью = ФормированиеПечатныхФормУ.СформироватьСуммуПрописью(ИтогоСтоимость,
		Шапка.ВалютаДокумента);
	ТабДокумент.Вывести(ОбластьМакета);

	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	Возврат ТабДокумент;

КонецФункции // ПечатьТОРГ16()

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
	
	Если УправлениеПечатьюУ.НужноПечататьМакет(КоллекцияПечатныхФорм, "Комплектация") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатьюУ.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Комплектация", "Акт списания товаров",
			ПечатьСписаниеТоваров(МассивОбъектов), , "Документ.ПреобразованиеВЛом.Комплектация");
	КонецЕсли;

	Если УправлениеПечатьюУ.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПеревода") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатьюУ.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПеревода", "Акт перевода товаров в материалы",
			ПечатьАктаПеревода(МассивОбъектов), , "Документ.ПреобразованиеВЛом.АктПеревода");
	КонецЕсли;

	Если УправлениеПечатьюУ.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ16") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатьюУ.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ16",
			"ТОРГ-16 (Акт о списании товаров)", ПечатьТОРГ16(МассивОбъектов), , "ОбщиеМакеты.ТОРГ16");

	КонецЕсли;

КонецПроцедуры

// Инициализирует данные документа (используется при проведении).
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Граница", Новый Граница(ДокументСсылка.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Склад", ДокументСсылка.Склад);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(КомплектацияТоваровКамни.СтоимостьБезНДС, 0)) КАК СтоимостьБезНДС,
	|	СУММА(ЕСТЬNULL(КомплектацияТоваровКамни.Стоимость, 0)) КАК Стоимость
	|ПОМЕСТИТЬ СуммыПоКамням
	|ИЗ
	|	Документ.ПреобразованиеВЛом.Камни КАК КомплектацияТоваровКамни
	|ГДЕ
	|	КомплектацияТоваровКамни.Ссылка = &Ссылка
	|	И НЕ КомплектацияТоваровКамни.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И КомплектацияТоваровКамни.СтоимостьБезНДС > 0
	|	И КомплектацияТоваровКамни.Стоимость > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.ВидОперации КАК ВидОперации,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.Склад.ВидСклада КАК ВидСклада,
	|	ДанныеДокумента.Комплект КАК Комплект,
	|	ДанныеДокумента.ВесКомплекта КАК ВесКомплекта,
	|	ДанныеДокумента.КоличествоКомплекта КАК КоличествоКомплекта,
	|	ДанныеДокумента.СерияНоменклатурыКомплекта КАК СерияНоменклатурыКомплекта,
	|	ДанныеДокумента.РазмерКомплекта КАК РазмерКомплекта,
	|	ДанныеДокумента.ХарактеристикаНоменклатурыКомплекта КАК ХарактеристикаНоменклатурыКомплекта,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.ЦенаВРозницеКомплекта
	|	КОНЕЦ КАК ЦенаВРозницеКомплекта,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|			ТОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0)
	|		ИНАЧЕ ДанныеДокумента.СтоимостьКомплекта
	|	КОНЕЦ КАК СтоимостьКомплекта,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|			ТОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток, 0)
	|		ИНАЧЕ ДанныеДокумента.СтоимостьБезНДСКомплекта
	|	КОНЕЦ КАК СтоимостьБезНДСКомплекта,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.ВесКомплектаВХимЧистоте
	|	КОНЕЦ КАК ВесВЧистотеКомплекта,
	|	ДанныеДокумента.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|			ТОГДА 0
	|		КОГДА ДанныеДокумента.ХарактеристикаНоменклатурыКомплекта = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.ВесКомплекта
	|		ИНАЧЕ ДанныеДокумента.ВесКомплекта - ДанныеДокумента.ХарактеристикаНоменклатурыКомплекта.ВесКамней
	|	КОНЕЦ КАК ВесКомплектаВПробе,
	|	СУММА(КомплектацияТоваровТовары.Количество) КАК ТоварыКоличество,
	|	СУММА(КомплектацияТоваровТовары.Вес) КАК ТоварыВес,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	|					ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ТОГДА 0
	|			ИНАЧЕ КомплектацияТоваровТовары.ВесВХимЧистоте
	|		КОНЕЦ) КАК ТоварыВесВЧистоте,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	|					ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ТОГДА 0
	|			КОГДА КомплектацияТоваровТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА КомплектацияТоваровТовары.Вес
	|			ИНАЧЕ КомплектацияТоваровТовары.Вес - КомплектацияТоваровТовары.ХарактеристикаНоменклатуры.ВесКамней
	|		КОНЕЦ) КАК ТоварыВесВПробе,
	|	ДанныеДокумента.Комплект.Весовой КАК КомплектВесовой,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|			ТОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток, 0)
	|		ИНАЧЕ ДанныеДокумента.СтоимостьКомплекта
	|	КОНЕЦ КАК СтоимостьУпрКомплекта
	|ИЗ
	|	Документ.ПреобразованиеВЛом КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
	|		ПО ДанныеДокумента.Ссылка = КомплектацияТоваровТовары.Ссылка
	|			И (ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|				&Граница,
	|				Организация = &Организация
	|					И Склад = &Склад) КАК ПартииТоваровНаСкладахОстатки
	|		ПО ДанныеДокумента.СерияНоменклатурыКомплекта = ПартииТоваровНаСкладахОстатки.СерияНоменклатуры
	|			И (ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие))
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.ВидОперации,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Склад,
	|	ДанныеДокумента.Склад.ВидСклада,
	|	ДанныеДокумента.Комплект,
	|	ДанныеДокумента.ВесКомплекта,
	|	ДанныеДокумента.КоличествоКомплекта,
	|	ДанныеДокумента.СерияНоменклатурыКомплекта,
	|	ДанныеДокумента.РазмерКомплекта,
	|	ДанныеДокумента.ХарактеристикаНоменклатурыКомплекта,
	|	ДанныеДокумента.ДокументОснование,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.ЦенаВРозницеКомплекта
	|	КОНЕЦ,
	|	ДанныеДокумента.Комплект.Весовой,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|			ТОГДА 0
	|		КОГДА ДанныеДокумента.ХарактеристикаНоменклатурыКомплекта = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.ВесКомплекта
	|		ИНАЧЕ ДанныеДокумента.ВесКомплекта - ДанныеДокумента.ХарактеристикаНоменклатурыКомплекта.ВесКамней
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.ВесКомплектаВХимЧистоте
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|			ТОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0)
	|		ИНАЧЕ ДанныеДокумента.СтоимостьКомплекта
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|			ТОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток, 0)
	|		ИНАЧЕ ДанныеДокумента.СтоимостьБезНДСКомплекта
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	|				ИЛИ ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	|			ТОГДА ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток, 0)
	|		ИНАЧЕ ДанныеДокумента.СтоимостьКомплекта
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СуммыПоКамням.СтоимостьБезНДС, 0) КАК СтоимостьБезНДС,
	|	ЕСТЬNULL(СуммыПоКамням.Стоимость, 0) КАК Стоимость
	|ИЗ
	|	СуммыПоКамням КАК СуммыПоКамням";

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	СуммаПоКамням = РезультатЗапроса[2].Выгрузить();
	Реквизиты = РезультатЗапроса[1].Выбрать();
	Реквизиты.Следующий();

	Запрос.УстановитьПараметр("ДатаОстатков", 					Новый Граница(Реквизиты.Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период", 						Реквизиты.Период);
	Запрос.УстановитьПараметр("ВидОперации", 					Реквизиты.ВидОперации);
	Запрос.УстановитьПараметр("Организация", 					Реквизиты.Организация);
	Запрос.УстановитьПараметр("Склад", 							Реквизиты.Склад);
	Запрос.УстановитьПараметр("ВидСклада", 						Реквизиты.ВидСклада);
	Запрос.УстановитьПараметр("ВидСкладаТорговаяТочка",			Реквизиты.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка);
	Запрос.УстановитьПараметр("НеВключатьНДСВСтоимостьПартий", 	РегистрыСведений.УчетнаяПолитика.СрезПоследних()[0].НеВключатьНДСВСтоимостьПартий);
	Запрос.УстановитьПараметр("Комплектация", 					Реквизиты.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом);
	Запрос.УстановитьПараметр("КодыОперацийПартииТоваров", 		?(Реквизиты.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом,
																	Перечисления.КодыОперацийПартииТоваров.ОбъединениеПартий,
																	?(Реквизиты.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие,
																	Перечисления.КодыОперацийПартииТоваров.РазукомплектацияИзделие,
																	Перечисления.КодыОперацийПартииТоваров.ПустаяСсылка())));
																																	
	Запрос.УстановитьПараметр("НоменклатураКомплекта", Реквизиты.Комплект);
	Запрос.УстановитьПараметр("РазмерКомплекта", Реквизиты.РазмерКомплекта);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатурыКомплекта", Реквизиты.ХарактеристикаНоменклатурыКомплекта);
	Запрос.УстановитьПараметр("СерияНоменклатурыКомплекта", Реквизиты.СерияНоменклатурыКомплекта);
	Если (Реквизиты.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
		Или Реквизиты.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом Тогда
		Запрос.УстановитьПараметр("ОтсыпкаКамней", Истина);
		Запрос.УстановитьПараметр("КоличествоКомплекта", Реквизиты.ТоварыКоличество);
		Запрос.УстановитьПараметр("ВесКомплекта", Реквизиты.ТоварыВес);
		Если Реквизиты.КомплектВесовой Тогда
			Запрос.УстановитьПараметр("СтоимостьКомплекта", Реквизиты.СтоимостьКомплекта / Реквизиты.ВесКомплекта * Реквизиты.ТоварыВес);
			Запрос.УстановитьПараметр("СтоимостьУпрКомплекта", Реквизиты.СтоимостьУпрКомплекта / Реквизиты.ВесКомплекта * Реквизиты.ТоварыВес);
			Запрос.УстановитьПараметр("СтоимостьБезНДСКомплекта", Реквизиты.СтоимостьБезНДСКомплекта / Реквизиты.ВесКомплекта * Реквизиты.ТоварыВес);
		Иначе
			Запрос.УстановитьПараметр("СтоимостьКомплекта", Реквизиты.СтоимостьКомплекта / Реквизиты.КоличествоКомплекта * Реквизиты.ТоварыКоличество);
			Запрос.УстановитьПараметр("СтоимостьУпрКомплекта", Реквизиты.СтоимостьУпрКомплекта / Реквизиты.КоличествоКомплекта * Реквизиты.ТоварыКоличество);
			Запрос.УстановитьПараметр("СтоимостьБезНДСКомплекта", Реквизиты.СтоимостьБезНДСКомплекта / Реквизиты.КоличествоКомплекта * Реквизиты.ТоварыКоличество);
		КонецЕсли;
		Запрос.УстановитьПараметр("ЦенаВРозницеКомплекта", Реквизиты.ЦенаВРозницеКомплекта);
		Запрос.УстановитьПараметр("ВесВЧистотеКомплекта", Реквизиты.ТоварыВесВЧистоте);
		Запрос.УстановитьПараметр("ВесКомплектаВПробе", Реквизиты.ТоварыВесВПробе);	
	Иначе
		Запрос.УстановитьПараметр("ОтсыпкаКамней", Ложь);
		Запрос.УстановитьПараметр("КоличествоКомплекта", Реквизиты.КоличествоКомплекта);
		Запрос.УстановитьПараметр("ВесКомплекта", Реквизиты.ВесКомплекта);	
		Запрос.УстановитьПараметр("СтоимостьКомплекта", Реквизиты.СтоимостьКомплекта);
		Запрос.УстановитьПараметр("СтоимостьБезНДСКомплекта", Реквизиты.СтоимостьБезНДСКомплекта);
		Запрос.УстановитьПараметр("СтоимостьУпрКомплекта", Реквизиты.СтоимостьУпрКомплекта);
		Запрос.УстановитьПараметр("ЦенаВРозницеКомплекта", Реквизиты.ЦенаВРозницеКомплекта);
		Запрос.УстановитьПараметр("ВесВЧистотеКомплекта", Реквизиты.ВесВЧистотеКомплекта);
		Запрос.УстановитьПараметр("ВесКомплектаВПробе", Реквизиты.ВесКомплектаВПробе);
	КонецЕсли;
	Запрос.УстановитьПараметр("СтоимостьКамней", СуммаПоКамням[0].Стоимость);
	Запрос.УстановитьПараметр("СтоимостьБезНДСКамней", СуммаПоКамням[0].СтоимостьБезНДС);
	Запрос.УстановитьПараметр("КомплектВесовой", Реквизиты.КомплектВесовой);
	Запрос.УстановитьПараметр("ДокументОснование", Реквизиты.ДокументОснование);
	НужныДвиженияПоПролеживанию = Ложь;
	Если Константы.ИспользоватьАнализПролеживания.Получить() = Истина 
		и Реквизиты.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
		НужныДвиженияПоПролеживанию = Истина;
	КонецЕсли;	
	Запрос.УстановитьПараметр("НужныДвиженияПоПролеживанию", НужныДвиженияПоПролеживанию);
	
	Запрос.Текст =
	// 0 временная таблица товаров
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Размер КАК Размер,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Вес КАК Вес,
	|	ТаблицаТовары.ДокументПоступления КАК ДокументПоступления,
	|	ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТовары.ЦенаВРознице КАК ЦенаВРознице,
	|	ТаблицаТовары.Стоимость КАК Стоимость,
	|	ТаблицаТовары.СтоимостьБезНДС КАК СтоимостьБезНДС
	|ПОМЕСТИТЬ ВТ_ТаблицаТовары
	|ИЗ
	|	Документ.ПреобразованиеВЛом.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Склад КАК Склад,
	|	&КодыОперацийПартииТоваров КАК КодОперации,
	|	ИСТИНА КАК СписаниеПартий,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.Купленный) КАК СтатусПартии,
	|	ВТ_ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТовары.Размер КАК Размер,
	|	ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаТовары.Количество КАК Количество,
	|	ВТ_ТаблицаТовары.Вес КАК Вес,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаТовары.Номенклатура.Проба = ЗНАЧЕНИЕ(Справочник.Пробы.ПустаяСсылка)
	|				ИЛИ ВТ_ТаблицаТовары.Номенклатура.Проба.Металл.ПробаЧистоты = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ТаблицаТовары.Вес - ЕСТЬNULL(ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры.ВесКамней, 0)
	|	КОНЕЦ КАК ВесМеталлаВПробе,
	|	ВТ_ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВТ_ТаблицаТовары.ДокументПоступления КАК ДокументОприходования,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|				И ПартииТоваровНаСкладахОстатки.ВесОстаток <> ВТ_ТаблицаТовары.Вес
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.ВесОстаток * ВТ_ТаблицаТовары.Вес
	|		КОГДА ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> ВТ_ТаблицаТовары.Количество
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * ВТ_ТаблицаТовары.Количество
	|		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьОстаток
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|				И ПартииТоваровНаСкладахОстатки.ВесОстаток <> ВТ_ТаблицаТовары.Вес
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток / ПартииТоваровНаСкладахОстатки.ВесОстаток * ВТ_ТаблицаТовары.Вес
	|		КОГДА ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> ВТ_ТаблицаТовары.Количество
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * ВТ_ТаблицаТовары.Количество
	|		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток
	|	КОНЕЦ КАК СтоимостьУпр,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|				И ПартииТоваровНаСкладахОстатки.ВесОстаток <> ВТ_ТаблицаТовары.Вес
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|			ТОГДА ВТ_ТаблицаТовары.СтоимостьБезНДС / ПартииТоваровНаСкладахОстатки.ВесОстаток * ВТ_ТаблицаТовары.Вес
	|		КОГДА ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> ВТ_ТаблицаТовары.Количество
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|			ТОГДА ВТ_ТаблицаТовары.СтоимостьБезНДС / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * ВТ_ТаблицаТовары.Количество
	|		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток
	|	КОНЕЦ КАК СтоимостьБезНДС,
	|	ВТ_ТаблицаТовары.ЦенаВРознице КАК ЦенаВРознице,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаТовары.Номенклатура.Проба = ЗНАЧЕНИЕ(Справочник.Пробы.ПустаяСсылка)
	|				ИЛИ ВТ_ТаблицаТовары.Номенклатура.Проба.Металл.ПробаЧистоты = 0
	|			ТОГДА 0
	|		КОГДА ВТ_ТаблицаТовары.Вес = ПартииТоваровНаСкладахОстатки.ВесОстаток
	|			ТОГДА ПартииТоваровНаСкладахОстатки.ВесМеталлаВЧистотеОстаток
	|		ИНАЧЕ (ВТ_ТаблицаТовары.Вес - ЕСТЬNULL(ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры.ВесКамней, 0)) * ВТ_ТаблицаТовары.Номенклатура.Проба.Проба / ВТ_ТаблицаТовары.Номенклатура.Проба.Металл.ПробаЧистоты
	|	КОНЕЦ КАК ВесМеталлаВЧистоте
	|ПОМЕСТИТЬ ПартииТоваровНаСладахРасход
	|ИЗ
	|	ВТ_ТаблицаТовары КАК ВТ_ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|				&ДатаОстатков,
	|				Организация = &Организация
	|					И Склад = &Склад) КАК ПартииТоваровНаСкладахОстатки
	|		ПО ВТ_ТаблицаТовары.Номенклатура = ПартииТоваровНаСкладахОстатки.Номенклатура
	|			И ВТ_ТаблицаТовары.Размер = ПартииТоваровНаСкладахОстатки.Размер
	|			И ВТ_ТаблицаТовары.СерияНоменклатуры = ПартииТоваровНаСкладахОстатки.СерияНоменклатуры
	|			И ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
	|ГДЕ
	|	&Комплектация = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Период,
	|	&Организация,
	|	&Склад,
	|	&КодыОперацийПартииТоваров,
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.Купленный),
	|	1,
	|	&НоменклатураКомплекта,
	|	&РазмерКомплекта,
	|	&ХарактеристикаНоменклатурыКомплекта,
	|	&КоличествоКомплекта,
	|	&ВесКомплекта,
	|	&ВесКомплектаВПробе,
	|	&СерияНоменклатурыКомплекта,
	|	ВЫБОР
	|		КОГДА &ОтсыпкаКамней
	|			ТОГДА ПартииТоваровНаСкладахОстатки.ДокументОприходования
	|		ИНАЧЕ &ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|				И ПартииТоваровНаСкладахОстатки.ВесОстаток <> &ВесКомплекта
	|				И &КомплектВесовой
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.ВесОстаток * &ВесКомплекта
	|		КОГДА &КомплектВесовой = ЛОЖЬ
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> &КоличествоКомплекта
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * &КоличествоКомплекта
	|		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|				И ПартииТоваровНаСкладахОстатки.ВесОстаток <> &ВесКомплекта
	|				И &КомплектВесовой
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток / ПартииТоваровНаСкладахОстатки.ВесОстаток * &ВесКомплекта
	|		КОГДА &КомплектВесовой = ЛОЖЬ
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> &КоличествоКомплекта
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * &КоличествоКомплекта
	|		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|				И ПартииТоваровНаСкладахОстатки.ВесОстаток <> &ВесКомплекта
	|				И &КомплектВесовой
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток / ПартииТоваровНаСкладахОстатки.ВесОстаток * &ВесКомплекта
	|		КОГДА &КомплектВесовой = ЛОЖЬ
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> &КоличествоКомплекта
	|				И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|			ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * &КоличествоКомплекта
	|		ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток
	|	КОНЕЦ,
	|	&ЦенаВРозницеКомплекта,
	|	&ВесВЧистотеКомплекта
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			Организация = &Организация
	|				И Склад = &Склад
	|				И Номенклатура = &НоменклатураКомплекта
	|				И Размер = &РазмерКомплекта
	|				И СерияНоменклатуры = &СерияНоменклатурыКомплекта
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатурыКомплекта) КАК ПартииТоваровНаСкладахОстатки
	|ГДЕ
	|	&Комплектация = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|					И ПартииТоваровНаСкладахОстатки.ВесОстаток <> ВТ_ТаблицаТовары.Вес
	|					И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|				ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.ВесОстаток * ВТ_ТаблицаТовары.Вес
	|			КОГДА ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|					И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> ВТ_ТаблицаТовары.Количество
	|					И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * ВТ_ТаблицаТовары.Количество
	|			ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьОстаток
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|					И ПартииТоваровНаСкладахОстатки.ВесОстаток <> ВТ_ТаблицаТовары.Вес
	|					И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|				ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток / ПартииТоваровНаСкладахОстатки.ВесОстаток * ВТ_ТаблицаТовары.Вес
	|			КОГДА ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|					И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> ВТ_ТаблицаТовары.Количество
	|					И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * ВТ_ТаблицаТовары.Количество
	|			ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток
	|		КОНЕЦ) КАК СтоимостьУпр,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладахОстатки.ВесОстаток > 0
	|					И ПартииТоваровНаСкладахОстатки.ВесОстаток <> ВТ_ТаблицаТовары.Вес
	|					И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|				ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток / ПартииТоваровНаСкладахОстатки.ВесОстаток * ВТ_ТаблицаТовары.Вес
	|			КОГДА ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|					И ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> ВТ_ТаблицаТовары.Количество
	|					И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|				ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток * ВТ_ТаблицаТовары.Количество
	|			ИНАЧЕ ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток
	|		КОНЕЦ) КАК СтоимостьБезНДС
	|ПОМЕСТИТЬ ИтогиПоСтоимостям
	|ИЗ
	|	ВТ_ТаблицаТовары КАК ВТ_ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|				&ДатаОстатков,
	|				Организация = &Организация
	|					И Склад = &Склад) КАК ПартииТоваровНаСкладахОстатки
	|		ПО ВТ_ТаблицаТовары.Номенклатура = ПартииТоваровНаСкладахОстатки.Номенклатура
	|			И ВТ_ТаблицаТовары.Размер = ПартииТоваровНаСкладахОстатки.Размер
	|			И ВТ_ТаблицаТовары.СерияНоменклатуры = ПартииТоваровНаСкладахОстатки.СерияНоменклатуры
	|			И ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Ссылка КАК ДокументОприходования,
	|	&Организация КАК Организация,
	|	&Склад КАК Склад,
	|	&КодыОперацийПартииТоваров КАК КодОперации,
	|	ИСТИНА КАК СписаниеПартий,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.Купленный) КАК СтатусПартии,
	|	&НоменклатураКомплекта КАК Номенклатура,
	|	&РазмерКомплекта КАК Размер,
	|	&ХарактеристикаНоменклатурыКомплекта КАК ХарактеристикаНоменклатуры,
	|	&КоличествоКомплекта КАК Количество,
	|	&ВесКомплекта КАК Вес,
	|	&ВесКомплектаВПробе КАК ВесМеталлаВПробе,
	|	ИтогиПоСтоимостям.Стоимость - &СтоимостьКамней КАК Стоимость,
	|	ИтогиПоСтоимостям.СтоимостьУпр - &СтоимостьКамней КАК СтоимостьУпр,
	|	ИтогиПоСтоимостям.СтоимостьБезНДС - &СтоимостьБезНДСКамней КАК СтоимостьБезНДС,
	|	1 КАК НомерСтроки,
	|	&СерияНоменклатурыКомплекта КАК СерияНоменклатуры,
	|	&ЦенаВРозницеКомплекта КАК ЦенаВРознице,
	|	&ВесВЧистотеКомплекта КАК ВесМеталлаВЧистоте
	|ПОМЕСТИТЬ ПартииТоваровНаСладахПриход
	|ИЗ
	|	ИтогиПоСтоимостям КАК ИтогиПоСтоимостям
	|ГДЕ
	|	&Комплектация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	ВЫБОР
	|		КОГДА &ОтсыпкаКамней
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ВТ_ТаблицаТовары.ДокументПоступления
	|	КОНЕЦ,
	|	&Организация,
	|	&Склад,
	|	&КодыОперацийПартииТоваров,
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.Купленный),
	|	ВТ_ТаблицаТовары.Номенклатура,
	|	ВТ_ТаблицаТовары.Размер,
	|	ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаТовары.Количество,
	|	ВТ_ТаблицаТовары.Вес,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаТовары.Номенклатура.Проба = ЗНАЧЕНИЕ(Справочник.Пробы.ПустаяСсылка)
	|				ИЛИ ВТ_ТаблицаТовары.Номенклатура.Проба.Металл.ПробаЧистоты = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ТаблицаТовары.Вес - ЕСТЬNULL(ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры.ВесКамней, 0)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ОтсыпкаКамней
	|				И &ВесКомплекта > 0
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|			ТОГДА &СтоимостьКомплекта / &ВесКомплекта * ВТ_ТаблицаТовары.Вес
	|		КОГДА &ОтсыпкаКамней
	|				И &КоличествоКомплекта > 0
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|				И ВТ_ТаблицаТовары.Количество > 0
	|			ТОГДА &СтоимостьКомплекта / &КоличествоКомплекта * ВТ_ТаблицаТовары.Количество
	|		КОГДА &НеВключатьНДСВСтоимостьПартий
	|			ТОГДА ВТ_ТаблицаТовары.СтоимостьБезНДС
	|		ИНАЧЕ ВТ_ТаблицаТовары.Стоимость
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ОтсыпкаКамней
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|				И ВТ_ТаблицаТовары.Вес > 0
	|				И &ВесКомплекта > 0
	|			ТОГДА &СтоимостьУпрКомплекта / &ВесКомплекта * ВТ_ТаблицаТовары.Вес
	|		КОГДА &ОтсыпкаКамней
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|				И &КоличествоКомплекта > 0
	|				И ВТ_ТаблицаТовары.Количество > 0
	|			ТОГДА &СтоимостьУпрКомплекта / &КоличествоКомплекта * ВТ_ТаблицаТовары.Количество
	|		ИНАЧЕ ВТ_ТаблицаТовары.Стоимость
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ОтсыпкаКамней
	|				И &ВесКомплекта > 0
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой
	|			ТОГДА &СтоимостьБезНДСКомплекта / &ВесКомплекта * ВТ_ТаблицаТовары.Вес
	|		КОГДА &ОтсыпкаКамней
	|				И &КоличествоКомплекта > 0
	|				И ВТ_ТаблицаТовары.Номенклатура.Весовой = ЛОЖЬ
	|			ТОГДА &СтоимостьБезНДСКомплекта / &КоличествоКомплекта * ВТ_ТаблицаТовары.Количество
	|		ИНАЧЕ ВТ_ТаблицаТовары.СтоимостьБезНДС
	|	КОНЕЦ,
	|	ВТ_ТаблицаТовары.НомерСтроки,
	|	ВТ_ТаблицаТовары.СерияНоменклатуры,
	|	ВТ_ТаблицаТовары.ЦенаВРознице,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаТовары.Номенклатура.Проба = ЗНАЧЕНИЕ(Справочник.Пробы.ПустаяСсылка)
	|				ИЛИ ВТ_ТаблицаТовары.Номенклатура.Проба.Металл.ПробаЧистоты = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ВТ_ТаблицаТовары.Вес - ЕСТЬNULL(ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры.ВесКамней, 0)) * ВТ_ТаблицаТовары.Номенклатура.Проба.Проба / ВТ_ТаблицаТовары.Номенклатура.Проба.Металл.ПробаЧистоты
	|	КОНЕЦ
	|ИЗ
	|	ВТ_ТаблицаТовары КАК ВТ_ТаблицаТовары
	|ГДЕ
	|	НЕ &Комплектация
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	&Период,
	//|	&Ссылка,
	//|	&Организация,
	//|	&Склад,
	//|	&КодыОперацийПартииТоваров,
	//|	ИСТИНА,
	//|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.Купленный),
	//|	КомплектацияТоваровКамни.Номенклатура,
	//|	ЗНАЧЕНИЕ(Справочник.Размер.ПустаяСсылка),
	//|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	//|	КомплектацияТоваровКамни.Количество,
	//|	КомплектацияТоваровКамни.Вес,
	//|	0,
	//|	КомплектацияТоваровКамни.Стоимость,
	//|	КомплектацияТоваровКамни.Стоимость,
	//|	КомплектацияТоваровКамни.СтоимостьБезНДС,
	//|	КомплектацияТоваровКамни.НомерСтроки,
	//|	КомплектацияТоваровКамни.СерияНоменклатуры,
	//|	КомплектацияТоваровКамни.ЦенаВРознице,
	//|	0
	//|ИЗ
	//|	Документ.ПреобразованиеВЛом.Камни КАК КомплектацияТоваровКамни
	//|ГДЕ
	//|	НЕ КомплектацияТоваровКамни.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//|	И КомплектацияТоваровКамни.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ПартииТоваровНаСладахРасход.Номенклатура КАК Номенклатура,
	|	ПартииТоваровНаСладахРасход.Размер КАК Размер,
	|	&Склад КАК Склад,
	|	ПартииТоваровНаСладахРасход.Количество КАК ВНаличии,
	|	0 КАК ВРезерве,
	|	ПартииТоваровНаСладахРасход.НомерСтроки КАК НомерСтроки,
	|	1 КАК Порядок
	|ИЗ
	|	ПартииТоваровНаСладахРасход КАК ПартииТоваровНаСладахРасход
	|ГДЕ
	|	&ВидСклада <> ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.НеавтоматизированнаяТорговаяТочка)
	|	И ПартииТоваровНаСладахРасход.Количество > 0
	|	И &ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	ПартииТоваровНаСладахПриход.Номенклатура,
	|	ПартииТоваровНаСладахПриход.Размер,
	|	&Склад,
	|	ПартииТоваровНаСладахПриход.Количество,
	|	0,
	|	ПартииТоваровНаСладахПриход.НомерСтроки,
	|	1
	|ИЗ
	|	ПартииТоваровНаСладахПриход КАК ПартииТоваровНаСладахПриход
	|ГДЕ
	|	&ВидСклада <> ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.НеавтоматизированнаяТорговаяТочка)
	|	И ПартииТоваровНаСладахПриход.Количество > 0
	|	И &ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСладахРасход.ВидДвижения КАК ВидДвижения,
	|	ПартииТоваровНаСладахРасход.Период КАК Период,
	|	ПартииТоваровНаСладахРасход.Организация КАК Организация,
	|	ПартииТоваровНаСладахРасход.Склад КАК Склад,
	|	ПартииТоваровНаСладахРасход.КодОперации КАК КодОперации,
	|	ПартииТоваровНаСладахРасход.СписаниеПартий КАК СписаниеПартий,
	|	ПартииТоваровНаСладахРасход.СтатусПартии КАК СтатусПартии,
	|	ПартииТоваровНаСладахРасход.НомерСтроки КАК НомерСтроки,
	|	ПартииТоваровНаСладахРасход.Номенклатура КАК Номенклатура,
	|	ПартииТоваровНаСладахРасход.Размер КАК Размер,
	|	ПартииТоваровНаСладахРасход.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровНаСладахРасход.Количество КАК Количество,
	|	ПартииТоваровНаСладахРасход.Вес КАК Вес,
	|	ПартииТоваровНаСладахРасход.ВесМеталлаВПробе КАК ВесМеталлаВПробе,
	|	ПартииТоваровНаСладахРасход.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	|	ПартииТоваровНаСладахРасход.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ПартииТоваровНаСладахРасход.ДокументОприходования КАК ДокументОприходования,
	|	ПартииТоваровНаСладахРасход.Стоимость КАК Стоимость,
	|	ПартииТоваровНаСладахРасход.СтоимостьУпр КАК СтоимостьУпр,
	|	ПартииТоваровНаСладахРасход.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	1 КАК Порядок
	|ИЗ
	|	ПартииТоваровНаСладахРасход КАК ПартииТоваровНаСладахРасход
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПартииТоваровНаСладахПриход.ВидДвижения,
	//|	ПартииТоваровНаСладахПриход.Период,
	//|	ПартииТоваровНаСладахПриход.Организация,
	//|	ПартииТоваровНаСладахПриход.Склад,
	//|	ПартииТоваровНаСладахПриход.КодОперации,
	//|	ПартииТоваровНаСладахПриход.СписаниеПартий,
	//|	ПартииТоваровНаСладахПриход.СтатусПартии,
	//|	ПартииТоваровНаСладахПриход.НомерСтроки,
	//|	ПартииТоваровНаСладахПриход.Номенклатура,
	//|	ПартииТоваровНаСладахПриход.Размер,
	//|	ПартииТоваровНаСладахПриход.ХарактеристикаНоменклатуры,
	//|	ПартииТоваровНаСладахПриход.Количество,
	//|	ПартииТоваровНаСладахПриход.Вес,
	//|	ПартииТоваровНаСладахПриход.ВесМеталлаВПробе,
	//|	ПартииТоваровНаСладахПриход.ВесМеталлаВЧистоте,
	//|	ПартииТоваровНаСладахПриход.СерияНоменклатуры,
	//|	ПартииТоваровНаСладахПриход.ДокументОприходования,
	//|	ПартииТоваровНаСладахПриход.Стоимость,
	//|	ПартииТоваровНаСладахПриход.СтоимостьУпр,
	//|	ПартииТоваровНаСладахПриход.СтоимостьБезНДС,
	//|	2
	//|ИЗ
	//|	ПартииТоваровНаСладахПриход КАК ПартииТоваровНаСладахПриход
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Порядок,
	//|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСладахРасход.ВидДвижения КАК ВидДвижения,
	|	ПартииТоваровНаСладахРасход.Период КАК Период,
	|	ПартииТоваровНаСладахРасход.Склад КАК Склад,
	|	ПартииТоваровНаСладахРасход.Номенклатура КАК Номенклатура,
	|	ПартииТоваровНаСладахРасход.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ПартииТоваровНаСладахРасход.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровНаСладахРасход.Размер КАК Размер,
	|	ПартииТоваровНаСладахРасход.ЦенаВРознице КАК ЦенаВРознице,
	|	ПартииТоваровНаСладахРасход.Количество КАК Количество,
	|	ПартииТоваровНаСладахРасход.Вес КАК Вес,
	|	1 КАК Порядок
	|ИЗ
	|	ПартииТоваровНаСладахРасход КАК ПартииТоваровНаСладахРасход
	|ГДЕ
	|	&ВидСкладаТорговаяТочка = ИСТИНА
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПартииТоваровНаСладахПриход.ВидДвижения,
	//|	ПартииТоваровНаСладахПриход.Период,
	//|	ПартииТоваровНаСладахПриход.Склад,
	//|	ПартииТоваровНаСладахПриход.Номенклатура,
	//|	ПартииТоваровНаСладахПриход.СерияНоменклатуры,
	//|	ПартииТоваровНаСладахПриход.ХарактеристикаНоменклатуры,
	//|	ПартииТоваровНаСладахПриход.Размер,
	//|	ПартииТоваровНаСладахПриход.ЦенаВРознице,
	//|	ПартииТоваровНаСладахПриход.Количество,
	//|	ПартииТоваровНаСладахПриход.Вес,
	//|	2
	//|ИЗ
	//|	ПартииТоваровНаСладахПриход КАК ПартииТоваровНаСладахПриход
	//|ГДЕ
	//|	&ВидСкладаТорговаяТочка = ИСТИНА
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСладахРасход.ВидДвижения КАК ВидДвижения,
	|	ПартииТоваровНаСладахРасход.Период КАК Период,
	|	ПартииТоваровНаСладахРасход.Склад КАК Склад,
	|	ПартииТоваровНаСладахРасход.НомерСтроки КАК НомерСтроки,
	|	ПартииТоваровНаСладахРасход.Номенклатура КАК Номенклатура,
	|	ПартииТоваровНаСладахРасход.Размер КАК Размер,
	|	ПартииТоваровНаСладахРасход.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровНаСладахРасход.Количество КАК Количество,
	|	ПартииТоваровНаСладахРасход.Вес КАК Вес,
	|	ПартииТоваровНаСладахРасход.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ПартииТоваровНаСладахРасход.ДокументОприходования КАК ДокументОприходования,
	|	ПартииТоваровНаСладахРасход.Стоимость КАК Стоимость,
	|	1 КАК Порядок,
	|	ПартииТоваровНаСладахРасход.Количество * ПартииТоваровНаСладахРасход.ЦенаВРознице КАК СуммаПродажи
	|ИЗ
	|	ПартииТоваровНаСладахРасход КАК ПартииТоваровНаСладахРасход
	|ГДЕ
	|	&НужныДвиженияПоПролеживанию = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ПартииТоваровНаСладахРасход.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Бижутерия)
	|					ИЛИ ПартииТоваровНаСладахРасход.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар)
	|					ИЛИ ПартииТоваровНаСладахРасход.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	|					ИЛИ ПартииТоваровНаСладахРасход.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Вставка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПартииТоваровНаСладахПриход.ВидДвижения,
	|	ПартииТоваровНаСладахПриход.Период,
	|	ПартииТоваровНаСладахПриход.Склад,
	|	ПартииТоваровНаСладахПриход.НомерСтроки,
	|	ПартииТоваровНаСладахПриход.Номенклатура,
	|	ПартииТоваровНаСладахПриход.Размер,
	|	ПартииТоваровНаСладахПриход.ХарактеристикаНоменклатуры,
	|	ПартииТоваровНаСладахПриход.Количество,
	|	ПартииТоваровНаСладахПриход.Вес,
	|	ПартииТоваровНаСладахПриход.СерияНоменклатуры,
	|	ПартииТоваровНаСладахПриход.ДокументОприходования,
	|	ПартииТоваровНаСладахПриход.Стоимость,
	|	2,
	|	ПартииТоваровНаСладахПриход.Количество * ПартииТоваровНаСладахПриход.ЦенаВРознице
	|ИЗ
	|	ПартииТоваровНаСладахПриход КАК ПартииТоваровНаСладахПриход
	|ГДЕ
	|	&НужныДвиженияПоПролеживанию = ИСТИНА
	|	И ВЫБОР
	|			КОГДА ПартииТоваровНаСладахПриход.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Бижутерия)
	|					ИЛИ ПартииТоваровНаСладахПриход.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар)
	|					ИЛИ ПартииТоваровНаСладахПриход.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	|					ИЛИ ПартииТоваровНаСладахПриход.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Вставка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Результат = Запрос.ВыполнитьПакет();

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСвободныеОстатки",							Результат[4].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровНаСкладах", 					Результат[5].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаТоварыВНеавтоматизированныхТорговыхТочках",	Результат[6].Выгрузить());
	Если НужныДвиженияПоПролеживанию = Истина Тогда
		ТаблицыДляДвижений.Вставить("ТаблицаПролеживаниеТоваровНаСкладах",	Результат[6].Выгрузить());
	КонецЕсли;	

КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

#КонецОбласти	
	
#КонецЕсли