Перем мВалютаРегламентированногоУчета Экспорт; //Валюта регламентированного учета

Перем мСтруктураПоследовательностиПартионныйУчет;

Перем мОстаткиДляПодбора Экспорт; //Менеджер временных таблиц, остатки для подбора

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий   

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ТипДокумента        = Перечисления.ТипыДокументов.ТипКомплектацияТоваров;
	ВесДокумента        = Товары.Итог("Вес");
	
	Если Камни.Итог("Стоимость") > 0 
		Или Камни.Итог("СтоимостьБезНДС") > 0 Тогда
		СтоимостьКомплекта = Товары.Итог("Стоимость") - Камни.Итог("Стоимость");
		СтоимостьБезНДСКомплекта = Товары.Итог("СтоимостьБезНДС") - Камни.Итог("СтоимостьБезНДС");
		Если СтоимостьКомплекта < 0 Или СтоимостьБезНДСКомплекта < 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Стоимость камней больше стоимости товаров");
			Отказ = Истина;
		КонецЕсли;	
	Иначе	
		СтоимостьКомплекта = Товары.Итог("Стоимость");
		СтоимостьБезНДСКомплекта = Товары.Итог("СтоимостьБезНДС");
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Комплект) = Ложь Тогда
	//	Отказ = истина;
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен комплект");
	//	Возврат;
	//КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		Отказ = истина;
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнены комплектующие");
		Возврат;
	КонецЕсли;	
	//проверим чтобы проба комплекта совпадала с пробой комплектующих
	Если ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом 
		Или ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
	  //Если ВесКомплекта = 0 Тогда
	  //  	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес комплекта");
	  //  	Отказ = Истина;	
	  //  КонецЕсли;	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		                      |ПОМЕСТИТЬ ВрТовары
		                      |ИЗ
		                      |	&Товары КАК Товары
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ВрТовары.Номенклатура.Проба КАК Проба
		                      |ИЗ
		                      |	ВрТовары КАК ВрТовары
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	СУММА(ВЫБОР
		                      |			КОГДА КомплектацияТоваровТовары.ВесВХимЧистотеГИИСДМДК = 0
		                      |				ТОГДА ЕСТЬNULL(КомплектацияТоваровТовары.ВесВХимЧистоте, 0)
		                      |			ИНАЧЕ КомплектацияТоваровТовары.ВесВХимЧистотеГИИСДМДК
		                      |		КОНЕЦ) КАК ВесВХимЧистотеГИИСДМДК
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
		                      |ГДЕ
		                      |	КомплектацияТоваровТовары.ИНППреобразованияВЛом <> """"
		                      |	И КомплектацияТоваровТовары.Ссылка = &Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	СУММА(ЕСТЬNULL(КомплектацияТоваровМеталл.ВесВЧистоте, 0))
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.Металл КАК КомплектацияТоваровМеталл
		                      |ГДЕ
		                      |	КомплектацияТоваровМеталл.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(, "Номенклатура"));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапросаПоПакету = Запрос.ВыполнитьПакет();
		Результат = РезультатЗапросаПоПакету[1];
		//Если Результат.Пустой() Тогда
		//	Возврат;
		//КонецЕсли;	
		//Выборка = Результат.Выбрать();
		//ПробаКомплекта = Комплект.Проба;
		//Пока Выборка.Следующий() Цикл
		//	Если Выборка.Проба <> ПробаКомплекта Тогда
		//		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя комплектовать лом разных проб в один комплект");
		//		Отказ = Истина;
		//		Прервать;
		//	КонецЕсли;	
		//КонецЦикла;
		
		ДатаНачалаПрисвоенияСерийМеталлам = Константы.ДатаНачалаПрисвоенияСерийМеталлам.Получить();
		Если Отказ = Ложь Тогда
			Если ДатаНачалаПрисвоенияСерийМеталлам <> Дата(1, 1, 1)
				и ДатаНачалаПрисвоенияСерийМеталлам <= Дата 
				и Комплект.Проба.Металл.НеДрагоценныйМеталл = Ложь Тогда
				ОбновитьХарактеристикуКомплекта();
				СтруктураСерии = Новый Структура;
				СтруктураСерии.Вставить("СерияНоменклатуры", СерияНоменклатурыКомплекта);
				СтруктураСерии.Вставить("Номенклатура", Комплект);
				СтруктураСерии.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатурыКомплекта);
				СтруктураСерии.Вставить("Размер", РазмерКомплекта);
				СтруктураСерии.Вставить("Количество", КоличествоКомплекта);
				СтруктураСерии.Вставить("Вес", ВесКомплекта);
				СтруктураСерии.Вставить("ВесВХимЧистоте", ВесКомплектаВХимЧистоте);
				Если РезультатЗапросаПоПакету[2].Пустой() Тогда 
					СтруктураСерии.Вставить("ВесВХимЧистотеГИИСДМДК", ВесКомплектаВХимЧистоте);
				Иначе
					ВыборкаХимЧистоты = РезультатЗапросаПоПакету[2].Выбрать();
					ВесКомплектаВХимЧистотеИзЗапроса = 0;
					Пока ВыборкаХимЧистоты.Следующий() Цикл
						ВесКомплектаВХимЧистотеИзЗапроса = ВесКомплектаВХимЧистотеИзЗапроса 
						+ ?(ВыборкаХимЧистоты.ВесВХимЧистотеГИИСДМДК = NULL, 0, ВыборкаХимЧистоты.ВесВХимЧистотеГИИСДМДК);
					КонецЦикла;	
					СтруктураСерии.Вставить("ВесВХимЧистотеГИИСДМДК", ВесКомплектаВХимЧистотеИзЗапроса);
				КонецЕсли;
				СтруктураСерии.Вставить("ИНП", ИНП);
				СтруктураСерии.Вставить("ГруппаОгранкиГИИСДМДК", Справочники.КлассификаторГруппОгранкиГИИСДМДК.ПустаяСсылка());
				СтруктураСерии.Вставить("ГруппаНаличияСколовДефектовГИИСДМДК", Справочники.КлассификаторНаличияСколовДефектовГИИСДМДК.ПустаяСсылка());
				СтруктураСерии.Вставить("СтепеньВнутреннегоОтраженияГИИСДМДК", Справочники.КлассификаторСтепенейВнутреннегоОтраженияГИИСДМДК.ПустаяСсылка());
				
				СерияНоменклатурыКомплекта = СоздатьИЗаполнитьСерию(СтруктураСерии);
			Иначе
				СерияНоменклатурыКомплекта = Справочники.СерииНоменклатуры.ПустаяСсылка();
			КонецЕсли;	
		КонецЕсли;
		
		Для Каждого Стр Из Камни Цикл
			Если ЗначениеЗаполнено(Стр.Номенклатура) И Не ЗначениеЗаполнено(Стр.СерияНоменклатуры) Тогда
				СтруктураСерии = Новый Структура;
				СтруктураСерии.Вставить("СерияНоменклатуры", Стр.СерияНоменклатуры);
				СтруктураСерии.Вставить("Номенклатура", Стр.Номенклатура);
				СтруктураСерии.Вставить("ХарактеристикаНоменклатуры", Стр.ХарактеристикаНоменклатуры);
				СтруктураСерии.Вставить("Размер", Стр.Размер);
				СтруктураСерии.Вставить("Количество", Стр.Количество);
				СтруктураСерии.Вставить("Вес", Стр.Вес);
				СтруктураСерии.Вставить("ВесВХимЧистоте", 0);
				СтруктураСерии.Вставить("ВесВХимЧистотеГИИСДМДК", 0);
				СтруктураСерии.Вставить("ИНП", Стр.ИНП);
				СтруктураСерии.Вставить("ГруппаОгранкиГИИСДМДК", Стр.ГруппаОгранкиГИИСДМДК);
				СтруктураСерии.Вставить("ГруппаНаличияСколовДефектовГИИСДМДК", Стр.ГруппаНаличияСколовДефектовГИИСДМДК);
				СтруктураСерии.Вставить("СтепеньВнутреннегоОтраженияГИИСДМДК", Стр.СтепеньВнутреннегоОтраженияГИИСДМДК);

				Стр.СерияНоменклатуры = СоздатьИЗаполнитьСерию(СтруктураСерии);
			ИначеЕсли ЗначениеЗаполнено(Стр.Номенклатура) 
					И (Стр.СерияНоменклатуры.Вес <> Стр.Вес Или Стр.СерияНоменклатуры.Количество <> Стр.Количество) Тогда
				ТекСерия = Стр.СерияНоменклатуры.ПолучитьОбъект();
				ТекСерия.Количество = Стр.Количество;
				ТекСерия.Вес = Стр.Вес;
				ТекСерия.ГруппаОгранкиГИИСДМДК = Стр.ГруппаОгранкиГИИСДМДК;
				ТекСерия.НаличиеСколовДефектовГИИСДМДК = Стр.ГруппаНаличияСколовДефектовГИИСДМДК;
				ТекСерия.СтепеньВнутреннегоОтраженияГИИСДМДК = Стр.СтепеньВнутреннегоОтраженияГИИСДМДК;
				ТекСерия.Записать();
			КонецЕсли;	
		КонецЦикла;	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
		Если Комплект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЮвелирноеИзделие И ВесКомплекта = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес комплекта");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если Склад.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка 
			И ЦенаВРозницеКомплекта = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена цена комплекта");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		СтруктураСерии = Новый Структура;
		СтруктураСерии.Вставить("СерияНоменклатуры", СерияНоменклатурыКомплекта);
		СтруктураСерии.Вставить("Номенклатура", Комплект);
		СтруктураСерии.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатурыКомплекта);
		СтруктураСерии.Вставить("Размер", РазмерКомплекта);
		СтруктураСерии.Вставить("Количество", КоличествоКомплекта);
		СтруктураСерии.Вставить("Вес", ВесКомплекта);
		СтруктураСерии.Вставить("ВесВХимЧистоте", ВесКомплектаВХимЧистоте);
		СтруктураСерии.Вставить("ВесВХимЧистотеГИИСДМДК", ВесКомплектаВХимЧистоте);
		СтруктураСерии.Вставить("ИНП", ИНП);
		СтруктураСерии.Вставить("ГруппаОгранкиГИИСДМДК", Справочники.КлассификаторГруппОгранкиГИИСДМДК.ПустаяСсылка());
		СтруктураСерии.Вставить("ГруппаНаличияСколовДефектовГИИСДМДК", Справочники.КлассификаторНаличияСколовДефектовГИИСДМДК.ПустаяСсылка());
		СтруктураСерии.Вставить("СтепеньВнутреннегоОтраженияГИИСДМДК", Справочники.КлассификаторСтепенейВнутреннегоОтраженияГИИСДМДК.ПустаяСсылка());
		
		СтруктураСерии.Вставить("ВидПартийГИИС", Справочники.ВидыПартийГИИС.НайтиПоКоду("COMPLETE_SET"));
		
		СерияНоменклатурыКомплекта = СоздатьИЗаполнитьСерию(СтруктураСерии);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни Тогда
		Если ВесКомплекта = 0 Или КоличествоКомплекта = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес или количество комплекта");
			Отказ = Истина;
			Возврат;
		КОнецЕсли;
		Если Склад.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка 
			И ЦенаВРозницеКомплекта = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена цена комплекта");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		ДатаНачалаПрисвоенияСерийКамням = Константы.ДатаНачалаПрисвоенияСерийКамням.Получить();
		Если Отказ = Ложь Тогда
			Если ДатаНачалаПрисвоенияСерийКамням <> Дата(1, 1, 1)
				и ДатаНачалаПрисвоенияСерийКамням <= Дата Тогда
				СтруктураСерии = Новый Структура;
				СтруктураСерии.Вставить("СерияНоменклатуры", СерияНоменклатурыКомплекта);
				СтруктураСерии.Вставить("Номенклатура", Комплект);
				СтруктураСерии.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатурыКомплекта);
				СтруктураСерии.Вставить("Размер", РазмерКомплекта);
				СтруктураСерии.Вставить("Количество", КоличествоКомплекта);
				СтруктураСерии.Вставить("Вес", ВесКомплекта);
				СтруктураСерии.Вставить("ВесВХимЧистоте", ВесКомплектаВХимЧистоте);
				СтруктураСерии.Вставить("ВесВХимЧистотеГИИСДМДК", ВесКомплектаВХимЧистоте);
				СтруктураСерии.Вставить("ИНП", ИНП);
				СтруктураСерии.Вставить("ГруппаОгранкиГИИСДМДК", Справочники.КлассификаторГруппОгранкиГИИСДМДК.ПустаяСсылка());
				СтруктураСерии.Вставить("ГруппаНаличияСколовДефектовГИИСДМДК", Справочники.КлассификаторНаличияСколовДефектовГИИСДМДК.ПустаяСсылка());
				СтруктураСерии.Вставить("СтепеньВнутреннегоОтраженияГИИСДМДК", Справочники.КлассификаторСтепенейВнутреннегоОтраженияГИИСДМДК.ПустаяСсылка());

				СерияНоменклатурыКомплекта = СоздатьИЗаполнитьСерию(СтруктураСерии);
			Иначе
				СерияНоменклатурыКомплекта = Справочники.СерииНоменклатуры.ПустаяСсылка();
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни Тогда
		Для Каждого Стр Из Товары Цикл	
			Если Стр.Вес = 0 Или Стр.Количество = 0 Тогда
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес или количество вставки в строке "+Стр.НомерСтроки);
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
			СтруктураСерии = Новый Структура;
			СтруктураСерии.Вставить("СерияНоменклатуры", Стр.СерияНоменклатуры);
			СтруктураСерии.Вставить("Номенклатура", Стр.Номенклатура);
			СтруктураСерии.Вставить("ХарактеристикаНоменклатуры", Стр.ХарактеристикаНоменклатуры);
			СтруктураСерии.Вставить("Размер", Стр.Размер);
			СтруктураСерии.Вставить("Количество", Стр.Количество);
			СтруктураСерии.Вставить("Вес", Стр.Вес);
			СтруктураСерии.Вставить("ВесВХимЧистоте", Стр.ВесВХимЧистоте);
			СтруктураСерии.Вставить("ВесВХимЧистотеГИИСДМДК", Стр.ВесВХимЧистотеГИИСДМДК);
			СтруктураСерии.Вставить("ИНП", Стр.ИНП);
			СтруктураСерии.Вставить("ГруппаОгранкиГИИСДМДК", Справочники.КлассификаторГруппОгранкиГИИСДМДК.ПустаяСсылка());
			СтруктураСерии.Вставить("ГруппаНаличияСколовДефектовГИИСДМДК", Справочники.КлассификаторНаличияСколовДефектовГИИСДМДК.ПустаяСсылка());
			СтруктураСерии.Вставить("СтепеньВнутреннегоОтраженияГИИСДМДК", Справочники.КлассификаторСтепенейВнутреннегоОтраженияГИИСДМДК.ПустаяСсылка());

			Стр.СерияНоменклатуры = СоздатьИЗаполнитьСерию(СтруктураСерии);	
		КонецЦикла;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом Тогда
		Для Каждого Стр Из Товары Цикл	
			Если Стр.Вес = 0 Тогда
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес металла в строке "+Стр.НомерСтроки);
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
			СтруктураСерии = Новый Структура;
			СтруктураСерии.Вставить("СерияНоменклатуры", Стр.СерияНоменклатуры);
			СтруктураСерии.Вставить("Номенклатура", Стр.Номенклатура);
			СтруктураСерии.Вставить("ХарактеристикаНоменклатуры", Стр.ХарактеристикаНоменклатуры);
			СтруктураСерии.Вставить("Размер", Стр.Размер);
			СтруктураСерии.Вставить("Количество", Стр.Количество);
			СтруктураСерии.Вставить("Вес", Стр.Вес);
			СтруктураСерии.Вставить("ВесВХимЧистоте", Стр.ВесВХимЧистоте);
			СтруктураСерии.Вставить("ВесВХимЧистотеГИИСДМДК", Стр.ВесВХимЧистотеГИИСДМДК);
			СтруктураСерии.Вставить("ИНП", Стр.ИНП);
			СтруктураСерии.Вставить("ГруппаОгранкиГИИСДМДК", Справочники.КлассификаторГруппОгранкиГИИСДМДК.ПустаяСсылка());
			СтруктураСерии.Вставить("ГруппаНаличияСколовДефектовГИИСДМДК", Справочники.КлассификаторНаличияСколовДефектовГИИСДМДК.ПустаяСсылка());
			СтруктураСерии.Вставить("СтепеньВнутреннегоОтраженияГИИСДМДК", Справочники.КлассификаторСтепенейВнутреннегоОтраженияГИИСДМДК.ПустаяСсылка());
			Стр.СерияНоменклатуры = СоздатьИЗаполнитьСерию(СтруктураСерии);	
		КонецЦикла;		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьХарактеристикуКомплекта()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал КАК Материал,
	                      |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Вес КАК Вес
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеМатериалы КАК ХарактеристикиНоменклатурыДополнительныеМатериалы
	                      |		ПО КомплектацияТоваровТовары.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатурыДополнительныеМатериалы.Ссылка
	                      |ГДЕ
	                      |	КомплектацияТоваровТовары.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КомплектацияТоваровМеталл.ТипМеталла КАК ТипМеталла,
	                      |	СУММА(КомплектацияТоваровМеталл.Вес) КАК Вес,
	                      |	КомплектацияТоваровМеталл.Проба КАК Проба,
	                      |	МАКСИМУМ(КомплектацияТоваровМеталл.НомерСтроки) КАК НомерСтроки
	                      |ПОМЕСТИТЬ ДанныеПоМеталлам
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом.Металл КАК КомплектацияТоваровМеталл
	                      |ГДЕ
	                      |	КомплектацияТоваровМеталл.Ссылка = &Ссылка
	                      |	И КомплектацияТоваровМеталл.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                      |	И КомплектацияТоваровМеталл.Ссылка.ПараллельнаяОтправкаДанных = ИСТИНА
	                      |	И КомплектацияТоваровМеталл.ИНПИзделия = """"
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КомплектацияТоваровМеталл.ТипМеталла,
	                      |	КомплектацияТоваровМеталл.Проба
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДанныеПоМеталлам.ТипМеталла КАК ТипМеталла,
	                      |	ДанныеПоМеталлам.Вес КАК Вес,
	                      |	ДанныеПоМеталлам.Проба КАК Проба,
	                      |	ДанныеПоМеталлам.НомерСтроки КАК НомерСтроки,
	                      |	Пробы.Ссылка КАК ПробаСсылка
	                      |ИЗ
	                      |	ДанныеПоМеталлам КАК ДанныеПоМеталлам
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пробы КАК Пробы
	                      |		ПО ДанныеПоМеталлам.ТипМеталла = Пробы.Металл
	                      |			И ДанныеПоМеталлам.Проба = Пробы.Проба" );
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатЗапроса[0].Пустой() И РезультатЗапроса[2].Пустой() Тогда
		Возврат;	
	ИначеЕсли Не РезультатЗапроса[1].Пустой() Тогда
		Если ЗначениеЗаполнено(ХарактеристикаНоменклатурыКомплекта) Тогда
			ХарактеристикаНоменклатурыКомплектаОбъект = ХарактеристикаНоменклатурыКомплекта.ПолучитьОбъект();
			ХарактеристикаНоменклатурыКомплектаОбъект.ДополнительныеМатериалы.Очистить();
		Иначе
			ХарактеристикаНоменклатурыКомплектаОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаНоменклатурыКомплектаОбъект.Владелец = Комплект;			
		КонецЕсли;
		НовоеНаименование = "";
		Выборка = РезультатЗапроса[2].Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			Если Не ЗначениеЗаполнено(Выборка.ТипМеталла) Или Не ЗначениеЗаполнено(Выборка.Проба) 
				Или Не ЗначениеЗаполнено(Выборка.Вес) Тогда
				Продолжить;
			КонецЕсли;	
			НовМатериал = ХарактеристикаНоменклатурыКомплектаОбъект.ДополнительныеМатериалы.Добавить();
			НовМатериал.Материал = Выборка.ПробаСсылка;
			НовМатериал.Вес = Выборка.Вес/Выборка.Проба*1000;
			НовоеНаименование = ?(НовоеНаименование = "", СокрЛП(НовМатериал.Материал)+ " " + НовМатериал.Вес,
				НовоеНаименование + ", " + СокрЛП(НовМатериал.Материал) + " " + НовМатериал.Вес);
		КонецЦикла;
		ХарактеристикаНоменклатурыКомплектаОбъект.Наименование = НовоеНаименование;
		ХарактеристикаНоменклатурыКомплектаОбъект.ПолноеНаименование = НовоеНаименование;
		ХарактеристикаНоменклатурыКомплектаОбъект.Записать();
		ХарактеристикаНоменклатурыКомплекта = ХарактеристикаНоменклатурыКомплектаОбъект.Ссылка;
	Иначе	
		Если ЗначениеЗаполнено(ХарактеристикаНоменклатурыКомплекта) Тогда
			ХарактеристикаНоменклатурыКомплектаОбъект = ХарактеристикаНоменклатурыКомплекта.ПолучитьОбъект();
			ХарактеристикаНоменклатурыКомплектаОбъект.ДополнительныеМатериалы.Очистить();
		Иначе
			ХарактеристикаНоменклатурыКомплектаОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаНоменклатурыКомплектаОбъект.Владелец = Комплект;			
		КонецЕсли;
		НовоеНаименование = "";
		Выборка = РезультатЗапроса[0].Выбрать();
		Пока Выборка.Следующий() Цикл
			НовМатериал = ХарактеристикаНоменклатурыКомплектаОбъект.ДополнительныеМатериалы.Добавить();
			ЗаполнитьЗначенияСвойств(НовМатериал, Выборка);
			НовоеНаименование = ?(НовоеНаименование = "", СокрЛП(НовМатериал.Материал)+ " " + НовМатериал.Вес,
				НовоеНаименование + ", " + СокрЛП(НовМатериал.Материал) + " " + НовМатериал.Вес);
		КонецЦикла;
		ХарактеристикаНоменклатурыКомплектаОбъект.Наименование = НовоеНаименование;
		ХарактеристикаНоменклатурыКомплектаОбъект.ПолноеНаименование = НовоеНаименование;
		ХарактеристикаНоменклатурыКомплектаОбъект.Записать();
		ХарактеристикаНоменклатурыКомплекта = ХарактеристикаНоменклатурыКомплектаОбъект.Ссылка;
	КонецЕсли;	
	
	
КонецПроцедуры

Функция СоздатьИЗаполнитьСерию(СтруктураСерии)
	
	Если ЗначениеЗаполнено(СтруктураСерии.СерияНоменклатуры) Тогда
		СерияОбъект = СтруктураСерии.СерияНоменклатуры.ПолучитьОбъект();
	Иначе
		ПрефиксШтрихкода = Формат(Константы.ПрефиксВнутреннегоШтрихкода.Получить(), "ЧГ=0");
		СерияОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		СерияОбъект.УстановитьНовыйКод();
		
		Штрихкод = ПрефиксШтрихкода + Прав("000000000000000000" + СерияОбъект.Код, 12 - СтрДлина(
		ПрефиксШтрихкода));
		
		СерияОбъект.Владелец     = СтруктураСерии.Номенклатура;
		СерияОбъект.Наименование = Штрихкод + УправлениеРозничнойТорговлей.КонтрольныйСимволEAN(
		Штрихкод, 13);	
	КонецЕсли;	
	
	
	СерияОбъект.ХарактеристикаНоменклатуры = СтруктураСерии.ХарактеристикаНоменклатуры;
	СерияОбъект.Размер                     = СтруктураСерии.Размер;
	СерияОбъект.Количество                 = СтруктураСерии.Количество;
	СерияОбъект.Вес                        = СтруктураСерии.Вес;
	
	СерияОбъект.ГруппаОгранкиГИИСДМДК = СтруктураСерии.ГруппаОгранкиГИИСДМДК;
	СерияОбъект.НаличиеСколовДефектовГИИСДМДК = СтруктураСерии.ГруппаНаличияСколовДефектовГИИСДМДК;
	СерияОбъект.СтепеньВнутреннегоОтраженияГИИСДМДК = СтруктураСерии.СтепеньВнутреннегоОтраженияГИИСДМДК;

	
	СерияОбъект.ОбщийВесВставок = СтруктураСерии.ХарактеристикаНоменклатуры.ВесКамней;
	
	ВесМеталла = 0;
	ВесМеталла = СтруктураСерии.Вес - СерияОбъект.ОбщийВесВставок;
	СерияОбъект.ВесМеталла = ВесМеталла;
	Если СтруктураСерии.ВесВХимЧистотеГИИСДМДК > 0 Тогда
		СерияОбъект.ВесМеталлаВЧистоте = СтруктураСерии.ВесВХимЧистотеГИИСДМДК;
	ИначеЕсли СтруктураСерии.ВесВХимЧистоте > 0 Тогда
		СерияОбъект.ВесМеталлаВЧистоте = СтруктураСерии.ВесВХимЧистоте;	
	ИначеЕсли СтруктураСерии.Номенклатура.Проба.Металл.ПробаЧистоты > 0 Тогда
		СерияОбъект.ВесМеталлаВЧистоте = ВесМеталла*СтруктураСерии.Номенклатура.Проба.Проба/1000;//ВладелецСерии.Проба.Металл.ПробаЧистоты;
	Иначе	
		СерияОбъект.ВесМеталлаВЧистоте = 0;
	КонецЕсли;
	
	Если СтруктураСерии.ИНП <> "" Тогда
		СерияОбъект.УИН = СтруктураСерии.ИНП;
	КонецЕсли;
	Если СтруктураСерии.Свойство("ВидПартийГИИС") И ЗначениеЗаполнено(СтруктураСерии.ВидПартийГИИС) Тогда
		СерияОбъект.ВидПартийГИИС = СтруктураСерии.ВидПартийГИИС;
	КонецЕсли;
	СерияОбъект.Весовой = СтруктураСерии.Номенклатура.Весовой;
	
	СерияОбъект.Записать();
	
	Возврат СерияОбъект.Ссылка;	
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	//// Удаление записей регистрации из всех последовательностей.
	//Для Каждого НаборЗаписейРегистрацииВПоследовательности Из ПринадлежностьПоследовательностям Цикл

	//	НаборЗаписейРегистрацииВПоследовательности.Очистить();

	//КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(Отказ, Заголовок);
	
	// Проверить заполнение ТЧ
	ПроверитьЗаполнениеТабличнойЧастиТовары(Отказ, Заголовок);
	
	Если Отказ Тогда
	     Возврат;	
	КонецЕсли;

	// Движения по документу.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства,
		РежимПроведения);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);  	
		
	Документы.ПреобразованиеВЛом.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	СформироватьСписокРегистровДляКонтроля();
	
	ПроведениеСервер.ОтразитьПартииТоваровНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьТоварыВНеавтоматизированныхТорговыхТочках(ДополнительныеСвойства, Движения, Отказ);	
	ПроведениеСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ); 
	Если Константы.ИспользоватьАнализПролеживания.Получить() = Истина 
		и Склад.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
		ПроведениеСервер.ОтразитьПролеживаниеТоваровНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура("Организация, Склад, ВидОперации");

	// Теперь вызовем общую процедуру проверки.
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(Отказ, Заголовок)

	ИмяТабличнойЧасти = "Товары";

	// Укажем, что надо проверить.
	Если ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом Тогда
		СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Вес, ДокументПоступления");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
		СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Вес, Количество, ДокументПоступления");
	Иначе 	
		СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Вес");
	КонецЕсли;    	

	// Теперь вызовем общую процедуру проверки.
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ,
		Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Формирует список регистров для контроля.
//
Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;

	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Или ДополнительныеСвойства.РежимЗаписи
		= РежимЗаписиДокумента.ОтменаПроведения Тогда

		Массив.Добавить(Движения.СвободныеОстатки);
		Массив.Добавить(Движения.ПартииТоваровНаСкладах);
		Массив.Добавить(Движения.ТоварыВНеавтоматизированныхТорговыхТочках);

	КонецЕсли;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры // СформироватьСписокРегистровДляКонтроля()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПреобразованиеВЛом") Тогда
		// Заполнение шапки
		ВесДокумента = ДанныеЗаполнения.ВесДокумента;
		ВесКомплекта = ДанныеЗаполнения.ВесКомплекта;
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
			ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие;
		ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни Тогда
			ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни;	
		КонецЕсли;
		КоличествоКомплекта = ДанныеЗаполнения.КоличествоКомплекта;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Комплект = ДанныеЗаполнения.Комплект;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		РазмерКомплекта = ДанныеЗаполнения.РазмерКомплекта;
		СерияНоменклатурыКомплекта = ДанныеЗаполнения.СерияНоменклатурыКомплекта;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СтоимостьБезНДСКомплекта = ДанныеЗаполнения.СтоимостьБезНДСКомплекта;
		СтоимостьКомплекта = ДанныеЗаполнения.СтоимостьКомплекта;
		ХарактеристикаНоменклатурыКомплекта = ДанныеЗаполнения.ХарактеристикаНоменклатурыКомплекта;
		ЦенаВРозницеКомплекта = ДанныеЗаполнения.ЦенаВРозницеКомплекта;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Вес = ТекСтрокаТовары.Вес;
			НоваяСтрока.ДокументПоступления = ТекСтрокаТовары.ДокументПоступления;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Размер = ТекСтрокаТовары.Размер;
			НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.Стоимость = ТекСтрокаТовары.Стоимость;
			НоваяСтрока.СтоимостьБезНДС = ТекСтрокаТовары.СтоимостьБезНДС;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
			НоваяСтрока.ЦенаВРознице = ТекСтрокаТовары.ЦенаВРознице;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("ВидОперации", ВидОперации);
		ДанныеЗаполнения.Свойство("Организация", Организация);
		ДанныеЗаполнения.Свойство("Склад", Склад);
		ДанныеЗаполнения.Свойство("Ответственный", Ответственный);
		ДанныеЗаполнения.Свойство("Комментарий", Комментарий);
		ДанныеЗаполнения.Свойство("Комплект", Комплект);
		ДанныеЗаполнения.Свойство("ВесКомплекта", ВесКомплекта);
		ДанныеЗаполнения.Свойство("СтоимостьКомплекта", СтоимостьКомплекта);
		ДанныеЗаполнения.Свойство("СтоимостьБезНДСКомплекта", СтоимостьБезНДСКомплекта);
		
		Если ДанныеЗаполнения.Свойство("Товары") Тогда
			Для Каждого Стр Из ДанныеЗаполнения.Товары Цикл
				НовСтр = Товары.Добавить();
				Стр.Свойство("Номенклатура", НовСтр.Номенклатура);
				Стр.Свойство("Вес", НовСтр.Вес);
				Стр.Свойство("Стоимость", НовСтр.Стоимость);
				Стр.Свойство("СтоимостьБезНДС", НовСтр.СтоимостьБезНДС);
				Стр.Свойство("ДокументПоступления", НовСтр.ДокументПоступления);
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СерияНоменклатурыКомплекта = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли