
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСДиалогамиСерверУ.УстановитьВозможностьРедактированияОбъектаПоГруппамДоступа(ЭтаФорма,
		"Документ.КомплектацияТоваров", ПараметрыСеанса.ТекущийПользователь, Отказ, Ложь);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьОбъединение(Команда)
	
	ОткрытьФорму("Документ.КомплектацияТоваров.Форма.ФормаДокумента", 
		Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом")));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРаскрепку(Команда)
	
	ОткрытьФорму("Документ.КомплектацияТоваров.Форма.ФормаДокумента", 
		Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие")));	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъединениеИзделие(Команда)
	
	ОткрытьФорму("Документ.КомплектацияТоваров.Форма.ФормаДокумента", 
		Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие")));

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъединениеКамни(Команда)
	ОткрытьФорму("Документ.КомплектацияТоваров.Форма.ФормаДокумента", 
		Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРазъединениеКамни(Команда)
	ОткрытьФорму("Документ.КомплектацияТоваров.Форма.ФормаДокумента", 
		Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни")));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРазединениеЛом(Команда)
	ОткрытьФорму("Документ.КомплектацияТоваров.Форма.ФормаДокумента", 
		Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом")));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПреобразованиеВЛом(Команда)
	ОткрытьФорму("Документ.ПреобразованиеВЛом.Форма.ФормаДокумента", 
		Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом")));
КонецПроцедуры

#КонецОбласти

