
&НаСервере
Функция ПолучитьИмяКартинкиИзХранилища(ЭлементНоменклатуры, УИДФормы) Экспорт
	
	мТекущееОсновноеИзображение = Неопределено;
	
	Если ЭлементНоменклатуры <> Неопределено И НЕ ЭлементНоменклатуры.ЭтоГруппа Тогда
		Справочники.ХранилищеДополнительнойИнформации.ПолучитьИзображение(мТекущееОсновноеИзображение, ЭлементНоменклатуры.Ссылка,
			ЭлементНоменклатуры.ОсновноеИзображение);
	КонецЕсли;

	Если мТекущееОсновноеИзображение = Неопределено Тогда
		мПустаяКартинка = Новый Картинка;
		АдресКартинки = ПоместитьВоВременноеХранилище(мПустаяКартинка, УИДФормы);
	Иначе
		АдресКартинки = ПоместитьВоВременноеХранилище(мТекущееОсновноеИзображение, УИДФормы);
	КонецЕсли;
		
	Возврат АдресКартинки;	
		
КонецФункции

&НаКлиенте
Процедура B1_СписокПриАктивизацииСтрокиПосле(Элемент)
	ЭлементНоменклатуры = Элементы.Список.ТекущаяСтрока;
	АдресКартинки = ПолучитьИмяКартинкиИзХранилища(ЭлементНоменклатуры, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура B1_ДеревоПриАктивизацииСтрокиПосле(Элемент)
	B1_СписокПриАктивизацииСтрокиПосле(Элемент);
КонецПроцедуры
