
&НаСервере
Процедура ЗаписатьДанныеНаСервере()

	Счётчик = 0;
	
	Для каждого СтрокаТабличногоПоля Из ТоварыТаблица Цикл
		
		ПоказатьСообщение = Истина;
		
		Если ЗначениеЗаполнено(СтрокаТабличногоПоля.УИН) И СтрокаТабличногоПоля.УИН <> СтрокаТабличногоПоля.СерияНоменклатуры.УИН Тогда
			
			СерияНоменклатурыОбъект = СтрокаТабличногоПоля.СерияНоменклатуры.ПолучитьОбъект();
			СерияНоменклатурыОбъект.УИН = СтрокаТабличногоПоля.УИН;
			
			Попытка
				СерияНоменклатурыОбъект.Записать();
			Исключение
				ПоказатьСообщение = Ложь;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при записи серии номенклатуры " + СтрокаТабличногоПоля.СерияНоменклатуры + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
			
			Если ПоказатьСообщение Тогда
				Счётчик = Счётчик + 1;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Записан УИН " + СтрокаТабличногоПоля.УИН + " для серии номенклатуры " + СтрокаТабличногоПоля.СерияНоменклатуры;
				Сообщение.Сообщить();
			КонецЕсли;

		КонецЕсли;		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Выполнение обработки завершено, записано " + Счётчик + " УИН");

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивТоваров") Тогда
		
		МассивТоваров = Параметры.МассивТоваров;
		
		Для Каждого ЭлементМассива Из МассивТоваров Цикл
			ЗаполнитьЗначенияСвойств(ТоварыТаблица.Добавить(), ЭлементМассива); 
		КонецЦикла;
		
		СчетчикСтрок = 0;
		ТоварыСвернутыеТаблица = ТоварыТаблица.Выгрузить();
		ТоварыСвернутыеТаблица.Свернуть("Номенклатура, СерияНоменклатуры");
		ТоварыТаблица.Очистить();
		Для каждого СтрокаТоварыСвернутые Из ТоварыСвернутыеТаблица Цикл
			НоваяСтрока = ТоварыТаблица.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоварыСвернутые);
			Если ЗначениеЗаполнено(СтрокаТоварыСвернутые.СерияНоменклатуры.УИН) Тогда
				НоваяСтрока.УИН = СтрокаТоварыСвернутые.СерияНоменклатуры.УИН;
			КонецЕсли; 
			СчетчикСтрок = СчетчикСтрок + 1;
			НоваяСтрока.НомерСтроки = СчетчикСтрок;
		КонецЦикла; 		
		
	КонецЕсли;

КонецПроцедуры
