 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСДиалогамиСерверУ.УстановитьВозможностьРедактированияОбъектаПоГруппамДоступа(ЭтотОбъект,
		"Документ.ПреобразованиеВЛом", ПараметрыСеанса.ТекущийПользователь, Отказ, Параметры.Ключ.Пустая());
	
	мКолонкиТовары 						= Элементы.Товары.ПодчиненныеЭлементы;
	мВалютаРегламентированногоУчета 	= Константы.ВалютаРегламентированногоУчета.Получить();
	ТекущийПользователь 				= ПараметрыСеанса.ТекущийПользователь;
	МетаданныеДокумента                 = Объект.Ссылка.Метаданные();
	ИмяДокумента 						= МетаданныеДокумента.Имя;
	
	ДатаНачалаПрисвоенияСерийМеталлам = Константы.ДатаНачалаПрисвоенияСерийМеталлам.Получить();
	
	Если Параметры.Ключ.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ

		Если Параметры.Свойство("ВидОперации") Тогда
			Параметры.Свойство("ВидОперации", Объект.ВидОперации);
		КонецЕсли;	
		
		// Заполнить реквизиты значениями по умолчанию.
		Если Не ЗначениеЗаполнено(Параметры.Основание) Тогда

			ОбщегоНазначения.ЗаполнитьШапкуДокумента(Объект, ТекущийПользователь);

		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда

			Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом;

		КонецЕсли;
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Вывести в заголовке формы вид операции.
	РаботаСДиалогамиСерверУ.УстановитьЗаголовокФормыДокумента(Строка(Объект.ВидОперации), ОБъект, ЭтаФорма);

	// Запомнить текущие значения реквизитов формы.
	мТекущаяДатаДокумента = Объект.Дата;

	// Установить видимость реквизитов и заголовков колонок.
	УстановитьВидимость();
	
	УстановитьСостояниеДокумента();
	
	УстановитьЗаголовки();
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатьюУ.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКоманды);
	// Конец СтандартныеПодсистемы.Печать
	
	Если Объект.Проведен Тогда
		Если (Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни
			//Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие
			Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом) 
			И (Объект.СерияНоменклатурыКомплекта.УИН <> ""
			Или Объект.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета()) Тогда
			ЭтаФорма.ТолькоПросмотр = Ложь; //Исправить
		ИначеЕсли (Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни
			//или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие
			или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом
			или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом) Тогда	
			Для Каждого Стр Из Объект.Товары Цикл
				Если Стр.СерияНоменклатуры.УИН <> "" Или Стр.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда
					ЭтаФорма.ТолькоПросмотр = Ложь; //Исправить
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		//ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом 
		//	И Объект.СерияНоменклатурыКомплекта.УИН <> "" Тогда
		//	Элементы.ДатаНомер.ТолькоПросмотр = Истина;
		//	Элементы.ГруппаРеквизиты.ТолькоПросмотр = Истина;
		//	Элементы.Товары.ТолькоПросмотр = Истина;
		//	Элементы.ГруппаДополнительно.ТолькоПросмотр = Истина;
		//	Элементы.ГруппаНастройкиЗаполнения.ТолькоПросмотр = Истина;
		//	Элементы.ГруппаПодвал.ТолькоПросмотр = Истина;
		//	
		//	Элементы.ЗаполнитьВесПоКомплектующим.Доступность = Ложь;
		//	Элементы.ПодменюПодбор.Доступность = Ложь;
		//	Элементы.ТоварыОчистить.Доступность = Ложь;
		//	
		//	Если Объект.Камни.Количество() > 0 Тогда
		//		Элементы.ГруппаМеталлыКамни.Показать();				
		//		ЗаполнитьЗаголовокПоКамням();
		//	КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	СтруктураТабличныхЧастей = ОбработкаТабличныхЧастейСерверУ.ПолучитьСтруктуруТабличныхЧастей(МетаданныеДокумента);
	
	ИнтеграцияГИИСДМДК.ПолучитьСертификатыОрганизации(Объект.Организация, ЭтотОбъект);

	НастройкиПоОрганизации = РегистрыСведений.НастройкиОбменаГИИСДМДК.НастройкиПоОрганизации(Объект.Организация);
	
	ТаймаутМеждуПопытками = НастройкиПоОрганизации.ТаймаутМеждуПопытками;
	КоличествоПопыток = НастройкиПоОрганизации.КоличествоПопыток;
	ПодписьНаСервере = НастройкиПоОрганизации.ПодписьНаСервере;
	ОтправкаНаСервере = НастройкиПоОрганизации.ОтправкаНаСервере;

	ОбщегоНазначенияУ.ЗаполнитьУсловноеОформлениеДляКолонкиТабличнойЧасти(Элементы.ТоварыИмяМетода, ЭтаФорма);
	
	ПолучитьНастройкиСКД();

	ПересчитатьВесВХимЧистоте();
	
	Для Каждого ТекущийПромежуточныйКомплект Из Объект.ПромежуточныеКомплекты Цикл
		Если ТекущийПромежуточныйКомплект.Количество = 0 И ТекущийПромежуточныйКомплект.Вес = 0 Тогда
			Объект.ПромежуточныеКомплекты.Удалить(ТекущийПромежуточныйКомплект);
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.СписокЗапросовРедактирование = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовокПоКамням()
	ЕстьНезаполненыеСтроки = Ложь;
	Для Каждого Стр Из Объект.Камни Цикл
		Если Не ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			ЕстьНезаполненыеСтроки = Истина;
		КонецЕсли;	
	КонецЦикла;	
	Если ЕстьНезаполненыеСтроки Тогда
		Элементы.ДекорацияСостояниеДокумента.Заголовок = "Есть незаполненные драгоценные камни";
		Элементы.ДекорацияСостояниеДокумента.ЦветФона =  Новый Цвет(201, 214, 228);
	Иначе	
		Элементы.ДекорацияСостояниеДокумента.Заголовок = "Все драгоценные камни оприходованы";	
		Элементы.ДекорацияСостояниеДокумента.ЦветФона =  Новый Цвет(200, 220, 120);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовки()
	Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни Тогда
		Элементы.ПодборКомплекта.Заголовок = "Подбор партии вставки";
		Элементы.ГруппаТовары.Заголовок = "Выделяемые партии";
		Элементы.Комплект.Заголовок = "Партия камней источника";	
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом Тогда
		Элементы.ПодборКомплекта.Заголовок = "Подбор партии металла";
		Элементы.ГруппаТовары.Заголовок = "Выделяемые партии";
		Элементы.Комплект.Заголовок = "Партия металла источника";
	Иначе
		Элементы.ПодборКомплекта.Заголовок = "Подбор комплекта";
		Элементы.ГруппаТовары.Заголовок = "Товары";
		Элементы.Комплект.Заголовок = "Основное изделие"
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		ПоддерживаемыеТипыВО = Новый Массив;
		ПоддерживаемыеТипыВО.Добавить( "СканерШтрихкода");
		//ПоддерживаемыеТипыВО.Добавить( "ТерминалСбораДанных" );

		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО,
			ОписаниеОшибки) Тогда
			Если Лев(ОписаниеОшибки, 38) = "Не найдены устройства заявленных типов" Тогда
				Возврат;
			КонецЕсли;
			ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
								   |""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			Если ОписаниеОшибки <> "" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Отказ = Ложь;
	ПроцедурыПодпискиСобытий.ПроверкаПериодаДокумента(ТекущийОбъект, Отказ);
	Если Отказ Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(
			"Редактирование данных этого периода запрещено. Изменения не могут быть записаны...");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	РаботаСДиалогамиСерверУ.УстановитьЗаголовокФормыДокумента(Строка(Объект.ВидОперации), Объект, ЭтаФорма);

	УстановитьСостояниеДокумента();  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если Источник = "ПодключаемоеОборудование" Тогда//И ВводДоступен() Тогда
		//сканер
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр.ФормаДляОповещения <> ЭтотОбъект.УникальныйИдентификатор Тогда
				Возврат;
			КонецЕсли;
			Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни")
				Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом") Тогда				
				//пока не предумотрено
				Возврат;
			КонецЕсли; 
			
			ЭтотОбъект.ТекущийЭлемент = Элементы.Товары;   //Сакулина К. [15.11.2019] (чтобы сохранить значение активного элемента)
			
			ПолучитьДанныеПоШК(Параметр.Параметр, , Истина);

		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
		
	Если ВводДоступен() Тогда

		ОписаниеСобытия = Новый Структура;
		ОписаниеОшибки  = "";
		ОписаниеСобытия.Вставить("Источник", Источник);
		ОписаниеСобытия.Вставить("Событие", Событие);
		ОписаниеСобытия.Вставить("Данные", Данные);

		Результат = МенеджерОборудованияКлиентПереопределяемый.ПолучитьСобытиеОтУстройства(ОписаниеСобытия,
			ОписаниеОшибки);
		Если Не Результат = Неопределено Тогда
			Результат.Вставить("ФормаДляОповещения", ЭтотОбъект.УникальныйИдентификатор);
			Оповестить(Результат.ИмяСобытия, Результат, Результат.Источник);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)  	
	
	Если Не ЗавершениеРаботы Тогда
		ПоддерживаемыеТипыВО = Новый Массив;
		ПоддерживаемыеТипыВО.Добавить( "СканерШтрихкода");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Очистить(Команда)

	Если Объект.Товары.Количество() > 0 Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие") Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект),
				"Табличные части Товары и Товары после раскрепки будут очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Иначе			
		    ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект),
				"Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		КонецЕсли;		
		Возврат;
	КонецЕсли;
	
	КоличествоСтрок = Объект.Товары.Количество();
	Пока КоличествоСтрок > 0 Цикл
		КоличествоСтрок = КоличествоСтрок - 1;
		ТекСтрока = Объект.Товары[КоличествоСтрок];
		Если ТекСтрока.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета() 
			или ТекСтрока.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусУспех() Тогда
			Продолжить;
		КонецЕсли;	
		Объект.Товары.Удалить(ТекСтрока);
	КонецЦикла;
	Если Объект.Товары.Количество() = 0 Тогда
		Объект.ВесКомплекта = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		КоличествоСтрок = Объект.Товары.Количество();
		Пока КоличествоСтрок > 0 Цикл
			КоличествоСтрок = КоличествоСтрок - 1;
			ТекСтрока = Объект.Товары[КоличествоСтрок];
			Если ТекСтрока.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета() 
				или ТекСтрока.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусУспех() Тогда
				Продолжить;
			КонецЕсли;	
			Объект.Товары.Удалить(ТекСтрока);
		КонецЦикла;
		Если Объект.Товары.Количество() = 0 Тогда
			Объект.ВесКомплекта = 0;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодборМеталла(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация", 				Объект.Организация);
	ПараметрыОткрытияФормы.Вставить("Склад", 					Объект.Склад);
	ПараметрыОткрытияФормы.Вставить("ВидПодбора", 				"МеталлНаСкладах");
	ПараметрыОткрытияФормы.Вставить("ПодборПоПартиям", 			Истина);
	ПараметрыОткрытияФормы.Вставить("Дата", 					?(Параметры.Ключ.Пустая(), ТекущаяДата(), Объект.Дата));
	ПараметрыОткрытияФормы.Вставить("АдресТоварыВДокументе", 	ПолучитьТаблицуТоваровДляПодбора());

	//Если ЗначениеЗаполнено(Объект.Комплект) Тогда
	//	ПараметрыОткрытияФормы.Вставить("Комплект", Объект.Комплект);
	//КонецЕсли;
	
	ОткрытьФорму("Обработка.ПодборНоменклатуры.Форма.ФормаПодбораМеталла", ПараметрыОткрытияФормы, ЭтотОбъект, , ,
		, Новый ОписаниеОповещения("ПодборМеталлаЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ПодборВставок(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация", 				Объект.Организация);
	ПараметрыОткрытияФормы.Вставить("Склад", 					Объект.Склад);
	ПараметрыОткрытияФормы.Вставить("ВидПодбора", 				"ВставкиНаСкладах");
	ПараметрыОткрытияФормы.Вставить("ПодборПоПартиям", 			Истина);
	ПараметрыОткрытияФормы.Вставить("Дата", 					?(Параметры.Ключ.Пустая(), ТекущаяДата(), Объект.Дата));
	ПараметрыОткрытияФормы.Вставить("АдресТоварыВДокументе", 	ПолучитьТаблицуТоваровДляПодбора());

	//Если ЗначениеЗаполнено(Объект.Комплект) Тогда
	//	ПараметрыОткрытияФормы.Вставить("Комплект", Объект.Комплект);
	//КонецЕсли;
	
	ОткрытьФорму("Обработка.ПодборНоменклатуры.Форма.ФормаПодбораВставок", ПараметрыОткрытияФормы, ЭтотОбъект, , ,
		, Новый ОписаниеОповещения("ПодборМеталлаЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПодборМеталлаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТоварыПодобранные = Результат;
	Если Не ТоварыПодобранные = Неопределено Тогда
		ПодборПоАртикулуСервер(ТоварыПодобранные);
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура ПодборНоменклатуры(ИмяФормы, ДляСтроки = Истина)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация", 			Объект.Организация);
	ПараметрыОткрытияФормы.Вставить("Склад", 				Объект.Склад);
	
	//отбор только ювелирных изделий
	СписокВидовНоменклатуры = Новый Массив;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом") Тогда
		СписокВидовНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Металл"));
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")
		Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни") Тогда
		СписокВидовНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Вставка"));
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом") Тогда	
		СписокВидовНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Металл"));
	Иначе
		СписокВидовНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие"));
		СписокВидовНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Товар"));	
	КонецЕсли;
	ПараметрыОткрытияФормы.Вставить("СписокВидовНоменклатуры", СписокВидовНоменклатуры);
	
	ПараметрыОткрытияФормы.Вставить("СтатусПартии", ПредопределенноеЗначение("Перечисление.СтатусыПартийТоваров.Купленный"));
	
	ПараметрыОткрытияФормы.Вставить("ВидПодбора", ?(ОбщегоназначенияУ.ПолучитьРеквизитОбъекта(Объект.Склад, "ВидСклада")
			= ПредопределенноеЗначение("Перечисление.ВидыСкладов.НеавтоматизированнаяТорговаяТочка"), "ТоварыВНТТ",
			"ТоварыНаСкладах")); 
			
	ПараметрыОткрытияФормы.Вставить("Дата", 				?(Параметры.Ключ.Пустая(), ТекущаяДата(), Объект.Дата)); 
	ПараметрыОткрытияФормы.Вставить("УчитыватьРезерв", 		Истина);  // СК [07.07.2020] (ИМ) - должны учитывать резерв товара для ИМ на этом складе

	//Если ДляСтроки = Ложь И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")
	//	И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни")
	//	И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом") Тогда
	//	ПараметрыОткрытияФормы.Вставить("Комплектация", Истина);
	//ИначеЕсли (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом")
	//	Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом"))
	//	//и ЗначениеЗаполнено(Объект.Комплект) Тогда
	//	ПараметрыОткрытияФормы.Вставить("Комплект", Объект.Комплект);
	//КонецЕсли;	
	
	ПараметрыОткрытияФормы.Вставить("ИзделияНеИзДавальческогоМеталла", Истина);
	
	ОткрытьФорму("Обработка.ПодборНоменклатуры.Форма."+ИмяФормы, ПараметрыОткрытияФормы, ЭтотОбъект, , ,
		, Новый ОписаниеОповещения(?(ДляСтроки, "ПодборПоАртикулуЗавершение", "ПодборПоАртикулуКомплектЗавершение"), ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоАртикулу(Команда)

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Очередь", 2);
	ЕстьСтрокиЗапросов = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
	МожноДобавитьСтроку = Истина;
	Для Каждого ТекЗапрос Из ЕстьСтрокиЗапросов Цикл
		Если ТекЗапрос.Статус <> ИнтеграцияГИИСДМДККлиент.СтатусНеОтправлено() Тогда
			МожноДобавитьСтроку = Ложь;
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя добавлять строки, т.к. уже есть отправленные запросы");
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Если МожноДобавитьСтроку = Истина Тогда
		ПодборНоменклатуры("ФормаПодбораПоАртикулуУ", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоАртикулуЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТоварыПодобранные = Результат;
	Если Не ТоварыПодобранные = Неопределено Тогда
		ПодборПоАртикулуСервер(ТоварыПодобранные);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПодборПоАртикулуКомплектНаСервере(СтрокаОстатков)
	
	//Объект.Комплект = СтрокаОстатков.Номенклатура;
	//Объект.ВесКомплекта = СтрокаОстатков.Вес;
	//Объект.КоличествоКомплекта = СтрокаОстатков.Количество;
	//Объект.СтоимостьКомплекта = СтрокаОстатков.Стоимость;
	Объект.СтоимостьБезНДСКомплекта = СтрокаОстатков.СтоимостьБезНДС;
	Объект.СерияНоменклатурыКомплекта = СтрокаОстатков.СерияНоменклатуры;
	Объект.ИНП = СтрокаОстатков.СерияНоменклатуры.УИН;
	Объект.ХарактеристикаНоменклатурыКомплекта = СтрокаОстатков.ХарактеристикаНоменклатуры;
	//Объект.РазмерКомплекта = СтрокаОстатков.Размер;
	Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда	
		Объект.ДокументОснование = СтрокаОстатков.ДокументПоступления;
	КонецЕсли;
	Объект.ЦенаВРозницеКомплекта = СтрокаОстатков.ЦенаВРознице;
	Объект.Товары.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Объект.Товары.Загрузить(Объект.ДокументОснование.Товары.Выгрузить());
		Для Каждого Стр Из Объект.Товары Цикл
			Стр.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусНеОтправлено();
			Стр.ОписаниеОшибки = "";
			Стр.ИдентификаторЗапроса = "";
		КонецЦикла;	
	Иначе
		МассивПараметров = Новый Массив;
		Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом Тогда
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Металл));
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Проба", СтрокаОстатков.Номенклатура.Проба));
			НовыеПараметрыВыбора =  Новый ФиксированныйМассив(МассивПараметров);
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни Тогда
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Вставка));
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", СтрокаОстатков.Номенклатура));
			НовыеПараметрыВыбора =  Новый ФиксированныйМассив(МассивПараметров);
		Иначе
			НовыеПараметрыВыбора = Неопределено;
		КонецЕсли;
		
		Элементы.ТоварыНоменклатура.ПараметрыВыбора = НовыеПараметрыВыбора;
	КонецЕсли;
	
	ПересчитатьВесВХимЧистоте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоАртикулуКомплектЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТоварыПодобранные = Результат;
	Если Не ТоварыПодобранные = Неопределено Тогда
		Если ТоварыПодобранные.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		ПодборПоАртикулуКомплектНаСервере(ТоварыПодобранные[0]);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодборПоШК(Команда)

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Очередь", 2);
	ЕстьСтрокиЗапросов = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
	МожноДобавитьСтроку = Истина;
	Для Каждого ТекЗапрос Из ЕстьСтрокиЗапросов Цикл
		Если ТекЗапрос.Статус <> ИнтеграцияГИИСДМДККлиент.СтатусНеОтправлено() Тогда
			МожноДобавитьСтроку = Ложь;
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя добавлять строки, т.к. уже есть отправленные запросы");
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Если МожноДобавитьСтроку = Истина Тогда
		ПодборНоменклатуры("ФормаПодбораПоШтрихКодуУ", Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоШКЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ТоварыПодобранные = Результат;
	Если Не ТоварыПодобранные = Неопределено Тогда
		ПодборПоАртикулуСервер(ТоварыПодобранные);
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкаФормы	

&НаСервере
// Процедура устанавливает видимость элементов формы
Процедура УстановитьВидимость()
	
	ВидОперацииОбъединениеЛом = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом");
	ВидОперацииОбъединениеИзделие = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие");
	ВидОперацииРазукомплектацияИзделие = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие");
	ВидОперацииСсыпкаКамни = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни");
	ВидОперацииРазссыпкаКамни = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни");
	ВидОперацииРазукомплектацияЛом = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом");
	ВидОперацииПреобразованиеВЛом = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом");
	
	Элементы.ДокументОснование.Видимость = ВидОперацииРазукомплектацияИзделие;
	
	// комплект
	Элементы.КоличествоКомплекта.Видимость = ВидОперацииОбъединениеИзделие Или ВидОперацииРазукомплектацияИзделие
	Или ВидОперацииСсыпкаКамни Или ВидОперацииРазссыпкаКамни Или ВидОперацииПреобразованиеВЛом;
	Элементы.КоличествоКомплекта.Доступность = Не ВидОперацииРазукомплектацияИзделие и Не ВидОперацииРазссыпкаКамни
		и Не ВидОперацииРазукомплектацияЛом и Не ВидОперацииПреобразованиеВЛом;
	Элементы.ВесКомплекта.Доступность = Не ВидОперацииРазукомплектацияИзделие и Не ВидОперацииРазссыпкаКамни и Не ВидОперацииРазукомплектацияЛом;
	Если ВидОперацииСсыпкаКамни
		Или ВидОперацииРазссыпкаКамни Тогда
		Элементы.РучноеИзменениеМассыСырья.Видимость = Истина;
		Элементы.ВесКомплектаВХимЧистоте.Заголовок = "Масса сырья";
		Элементы.ТоварыВесВХимЧистоте.Заголовок = "Масса сырья";
	КонецЕсли;	
	Элементы.ВесКомплектаВХимЧистоте.Видимость = ВидОперацииРазукомплектацияЛом Или ВидОперацииОбъединениеЛом
	 Или ВидОперацииСсыпкаКамни Или ВидОперацииРазссыпкаКамни Или ВидОперацииПреобразованиеВЛом;
	//Элементы.ВесМеталлаКомплекта.Видимость = ВидОперацииПреобразованиеВЛом; 
	Элементы.ЗаполнитьВесПоКомплектующим.Доступность = Не ВидОперацииРазукомплектацияИзделие и Не ВидОперацииРазссыпкаКамни и Не ВидОперацииРазукомплектацияЛом;
	Элементы.Комплект.Доступность = Не ВидОперацииРазукомплектацияИзделие и Не ВидОперацииРазссыпкаКамни и Не ВидОперацииРазукомплектацияЛом;
	Элементы.ГруппаДокументСтатус.Видимость = Объект.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОшибка()
		Или Объект.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета();
	
	// комплектующие
	Элементы.ПодменюПодбор.Видимость = Не ВидОперацииРазссыпкаКамни И Не ВидОперацииРазукомплектацияЛом;
	//Элементы.ТоварыПодборМеталла.Видимость = ВидОперацииПреобразованиеВЛом;//ВидОперацииОбъединениеЛом Или ВидОперацииОбъединениеИзделие;
	Элементы.ПодборПоАртикулу.Видимость    = ВидОперацииПреобразованиеВЛом;//ВидОперацииОбъединениеЛом Или ВидОперацииОбъединениеИзделие Или ВидОперацииСсыпкаКамни Или ВидОперацииПреобразованиеВЛом;
	Элементы.ПодборПоШК.Видимость 		   = ВидОперацииПреобразованиеВЛом; // Или ВидОперацииОбъединениеИзделие Или ВидОперацииСсыпкаКамни Или ВидОперацииПреобразованиеВЛом;
	//Элементы.ТоварыПодборВставок.Видимость = ВидОперацииПреобразованиеВЛом;// Или ВидОперацииРазссыпкаКамни;
	Элементы.ТоварыЗаполнитьПоОстаткам.Видимость = ВидОперацииПреобразованиеВЛом;
	Элементы.ГруппаНастройкиЗаполнения.Видимость = ВидОперацииПреобразованиеВЛом;
	
	// для ручного заполнения камней и металла
	Элементы.ТоварыНоменклатура.ТолькоПросмотр = Не ВидОперацииПреобразованиеВЛом;
	Элементы.ТоварыВес.ТолькоПросмотр = Не ВидОперацииПреобразованиеВЛом;
	Элементы.ТоварыКоличество.ТолькоПросмотр = Не ВидОперацииРазссыпкаКамни;
	Элементы.ТоварыВесВХимЧистоте.Видимость = ВидОперацииРазукомплектацияЛом Или ВидОперацииОбъединениеЛом
		Или ВидОперацииСсыпкаКамни Или ВидОперацииРазссыпкаКамни Или ВидОперацииПреобразованиеВЛом;
	Элементы.ТоварыВесМеталла.Видимость = ВидОперацииПреобразованиеВЛом;
	Элементы.ТоварыВесВставок.Видимость = ВидОперацииПреобразованиеВЛом;
	
	// розница
	Элементы.ТоварыЦенаВРознице.Видимость  = Объект.Склад.ВидСклада = ПредопределенноеЗначение("Перечисление.ВидыСкладов.НеавтоматизированнаяТорговаяТочка");
	Элементы.ЦенаВРозницеКомплекта.Видимость  = Элементы.ТоварыЦенаВРознице.Видимость;
	Элементы.ЗаполнитьЦенуПоКомплектующим.Видимость  = Элементы.ТоварыЦенаВРознице.Видимость;
	
	Если ВидОперацииРазукомплектацияИзделие Тогда
		Для Каждого ТекЭлемент Из Элементы.Товары.ПодчиненныеЭлементы Цикл
			ТекЭлемент.Доступность = Ложь;
		КонецЦикла;
		Для Каждого ТекЭлемент Из Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы Цикл
			Если ТекЭлемент.Имя <> "ТоварыПомощник" Тогда
				ТекЭлемент.Доступность = Ложь;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	//Элементы.Товары.Доступность = НЕ ВидОперацииРазукомплектацияИзделие;
		
	// отбор на вид номенклатуры комплекта	
	МассивПараметров = Новый Массив;
	Если ВидОперацииОбъединениеЛом Или ВидОперацииРазукомплектацияЛом Или ВидОперацииПреобразованиеВЛом Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Металл));
	ИначеЕсли ВидОперацииСсыпкаКамни или ВидОперацииРазссыпкаКамни Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Вставка));	
	Иначе
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Перечисления.ВидыНоменклатуры.ЮвелирноеИзделие));
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Товар));
	КонецЕсли;
	
	НовыеПараметрыВыбора =  Новый ФиксированныйМассив(МассивПараметров);
	//Элементы.Комплект.ПараметрыВыбора = НовыеПараметрыВыбора;
	Элементы.ТоварыНоменклатура.ПараметрыВыбора = НовыеПараметрыВыбора;
	
	// подбор комплекта
	Элементы.КоманднаяПанельДляКомплекта.Видимость = ВидОперацииРазукомплектацияИзделие Или ВидОперацииРазссыпкаКамни Или ВидОперацииРазукомплектацияЛом;
	
	// описание комплекта
	Если ДатаНачалаПрисвоенияСерийМеталлам = Дата(1, 1, 1) 
		или ДатаНачалаПрисвоенияСерийМеталлам > Объект.Дата Тогда
		//Элементы.ОписаниеКомплекта.Видимость = НЕ ВидОперацииОбъединениеЛом;
	Иначе
		Элементы.ОписаниеКомплекта.Видимость = ложь;
		Элементы.ХарактеристикаНоменклатурыКомплекта.Видимость = ЗначениеЗаполнено(Объект.ХарактеристикаНоменклатурыКомплекта) Или
			(НЕ ВидОперацииОбъединениеЛом И Не ВидОперацииРазукомплектацияЛом
			И Не ВидОперацииСсыпкаКамни И Не ВидОперацииРазссыпкаКамни и Не ВидОперацииПреобразованиеВЛом);
		Элементы.РазмерКомплекта.Видимость = НЕ ВидОперацииОбъединениеЛом И Не ВидОперацииРазукомплектацияЛом
			И Не ВидОперацииСсыпкаКамни И Не ВидОперацииРазссыпкаКамни И Не ВидОперацииПреобразованиеВЛом;
		Элементы.СерияНоменклатурыКомплекта.Видимость = Истина;
		Элементы.ЦенаВРозницеКомплекта.Видимость = НЕ ВидОперацииОбъединениеЛом И Не ВидОперацииРазукомплектацияЛом И Не ВидОперацииПреобразованиеВЛом;
		Элементы.ЗаполнитьЦенуПоКомплектующим.Видимость = НЕ ВидОперацииОбъединениеЛом И Не ВидОперацииРазукомплектацияЛом И Не ВидОперацииПреобразованиеВЛом;		
	КонецЕсли;
	Элементы.ОписаниеКомплекта.ТолькоПросмотр = Не ВидОперацииОбъединениеИзделие И Не ВидОперацииСсыпкаКамни;
	
	Элементы.ГруппаМеталлыКамни.Видимость = ВидОперацииПреобразованиеВЛом;
	Элементы.ТоварыИмяМетода.Видимость = ВидОперацииПреобразованиеВЛом;
	Элементы.ТоварыИНППреобразованияВЛом.Видимость = ВидОперацииПреобразованиеВЛом;
	
	Элементы.ТоварыПомощник.Видимость = ВидОперацииПреобразованиеВЛом Или ВидОперацииОбъединениеИзделие Или ВидОперацииРазукомплектацияИзделие;
	Элементы.ТоварыПолучитьИНП.Видимость = Не ВидОперацииПреобразованиеВЛом
	И Не ВидОперацииОбъединениеИзделие И Не ВидОперацииРазукомплектацияИзделие;
	Элементы.ТоварыПолучитьВесВХимЧистоте.Видимость = Не ВидОперацииПреобразованиеВЛом
	И Не ВидОперацииОбъединениеИзделие И Не ВидОперацииРазукомплектацияИзделие;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура УстановитьСостояниеДокумента()

	СостояниеДокумента = УправлениеСостояниемДокумента.СостояниеДокумента(Объект);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом") Тогда	
		Отказ = Истина;
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(
		"В этом документе добавлять строки вручную запрещено, воспользуйтесь подбором!");
	Иначе
		Если Объект.ПараллельнаяОтправкаДанных Тогда
			Если Объект.СписокЗапросов.Количество() > 0 Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя добавлять строки, т.к. уже есть отправленные запросы");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)

	УправлениеПечатьюКлиентУ.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);

КонецПроцедуры
//\

#КонецОбласти

&НаСервере
Процедура ПодборПоАртикулуСервер(ТоварыПодобранные)

	Если ТоварыПодобранные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ПодобранныйТовар Из ТоварыПодобранные Цикл

		Если ПодобранныйТовар <> Неопределено Тогда
			ПодборыУ.ПеренестиПодобранныйТоварВДокумент(Объект, ПодобранныйТовар, Объект.Товары, Элементы.Товары, Ложь,
				"Товары", ИмяДокумента);
		КонецЕсли;

	КонецЦикла;

	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни") Тогда
		Объект.КоличествоКомплекта = Объект.Товары.Итог("Количество");	
	Иначе
		Для Каждого Стр Из Объект.Товары Цикл
			ПересчитатьВесВХимЧистоте(Стр);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоШК(ТекКод, ТипШтрихкода = Неопределено, ДанныеСоСканера = Ложь)

	ОстаткиПоШК.Очистить();

	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = элементы.ГруппаТовары Тогда

		ТекущаяОперация = ?(ДанныеСоСканера, "ТоварыТО", "Товары");

	Иначе
		
		Возврат;

	КонецЕсли;

	ПолучитьОстаткиПоШК(ТекКод, ТекущаяОперация);

	КолВоСтрок = ОстаткиПоШК.Количество();
	Если КолВоСтрок = 0 Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Товара с штрихкодом " + ТекКод + " на остатках нет");
	ИначеЕсли КолВоСтрок > 1 Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Товары", ОстаткиПоШК);
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораНоменклатурыИзТаблицыУ", ПараметрыОткрытия, ЭтотОбъект, , , ,
			Новый ОписаниеОповещения("ПолучитьДанныеПоШКЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;

	ОстаткиПоШК.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоШКЗавершение(Результат, ДополнительныеПараметры) Экспорт

	РезультатВыбора = Результат;
	Если Не РезультатВыбора = Неопределено Тогда
		ПолучитьДанныеПоШКНаСервере(РезультатВыбора);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьОстаткиПоШК(ТекКод, ТекущаяОперация)
	
	Запрос = Новый Запрос;
	Если ТекущаяОперация = "Товары" Или ТекущаяОперация = "ТоварыТО" Тогда

		ВидПодбора = ?(ОбщегоназначенияУ.ПолучитьРеквизитОбъекта(Объект.Склад, "ВидСклада")
			= ПредопределенноеЗначение("Перечисление.ВидыСкладов.НеавтоматизированнаяТорговаяТочка"), "ТоварыВНТТ",
			"ТоварыНаСкладах");
			
		Текст = ПодборыУ.ПолучитьТекстЗапросаПоОстаткамДляПодбора(ВидПодбора);

	КонецЕсли;
	Текст = СтрЗаменить(Текст, "&ГдеПриемНаКомиссиюОтФЛ", "Истина");
	
	ТекстДопУсловий = "И Склад = &Склад" + Символы.ПС
		+ "И СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.Купленный)" + Символы.ПС
		+ "И ВЫБОР" + Символы.ПС
		+ "	КОГДА ДокументОприходования ССЫЛКА Документ.ПоступлениеТоваровУслуг" + Символы.ПС
		+ "		ТОГДА ДокументОприходования.ДоговорКонтрагента.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СДавальцем)" + Символы.ПС
		+ "	КОГДА ДокументОприходования ССЫЛКА Документ.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку" + Символы.ПС
		+ "		ТОГДА ДокументОприходования.ДоговорКонтрагента.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СДавальцем)" + Символы.ПС
		+ "	КОГДА ДокументОприходования ССЫЛКА Документ.ВозвратТоваровОтПокупателя" + Символы.ПС 
		+ "		ТОГДА ДокументОприходования.ДоговорКонтрагента.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СДавальцем)" + Символы.ПС
		+ "	КОГДА ДокументОприходования ССЫЛКА Документ.ПоступлениеПродукцииИзПроизводства" + Символы.ПС 
		+ "		ТОГДА ДокументОприходования.ДоговорКонтрагента.ДавальческийМеталл = Ложь" + Символы.ПС		
		+ "	ИНАЧЕ ИСТИНА" + Символы.ПС
		+ "	КОНЕЦ" + Символы.ПС
		+ "И (Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)" + Символы.ПС
		+ "	ИЛИ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Бижутерия))" + Символы.ПС;
	Текст = СтрЗаменить(Текст, "И Склад = &Склад", ТекстДопУсловий);
	
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Склад", 			Объект.Склад);
	Запрос.УстановитьПараметр("ШК", 			ТекКод);
	Запрос.УстановитьПараметр("Граница", 		?(Параметры.Ключ.Пустая(), ТекущаяДата(), Объект.Дата));

	ПоискТоваровПоВнутреннемуШК = Константы.ПоискТоваровПоВнутреннемуШК.Получить();
	ПоискТоваровПоПаспорту = Константы.ПоискТоваровПоПаспорту.Получить();
	ПоискТоваровПоУИН = Константы.ПоискТоваровПоУИН.Получить();
	Если Не ПоискТоваровПоВнутреннемуШК И Не ПоискТоваровПоПаспорту и Не ПоискТоваровПоУИН Тогда
		Возврат;
	КонецЕсли;
	Запрос.УстановитьПараметр("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
	Запрос.УстановитьПараметр("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
	
	ПараметрыДляЗаполненияУсловия = Новый Структура;
	ПараметрыДляЗаполненияУсловия.Вставить("ТекстЗапроса", Текст);
	ПараметрыДляЗаполненияУсловия.Вставить("ЕстьШК", ТекКод <> "");
	ПараметрыДляЗаполненияУсловия.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
	ПараметрыДляЗаполненияУсловия.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
	ПараметрыДляЗаполненияУсловия.Вставить("ПоискТоваровПоУИН", ПоискТоваровПоУИН);
	Текст 			= ПодборыУ.ЗаполнитьУсловиеШК(ПараметрыДляЗаполненияУсловия);
		
	Запрос.Текст = Текст;
	ОстаткиПоШК.Загрузить(Запрос.Выполнить().Выгрузить());

	Если ОстаткиПоШК.Количество() = 1 и (ТекущаяОперация = "Товары" Или ТекущаяОперация = "ТоварыТО") Тогда
		ПолучитьДанныеПоШКНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоШКНаСервере(СтрокаСОстатками = Неопределено)
	Если СтрокаСОстатками = Неопределено Тогда
		СтрокаОстатков = ОстаткиПоШК[0];
	Иначе
		СтрокаОстатков = СтрокаСОстатками;
	КонецЕсли;	
	
	//СК [07.07.2020] (ИМ)
	Если СтрокаОстатков.Количество > 0 И СтрокаОстатков.КоличествоРезерв > 0 Тогда
	    Если СтрокаОстатков.Количество = 1 И СтрокаОстатков.Количество <= СтрокаОстатков.КоличествоРезерв Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Товар <" + СтрокаОстатков.Номенклатура + "> по штрих-коду <" + СтрокаОстатков.СерияНоменклатуры + "> зарезервирован под интернет заказ!");
			Возврат;	
		ИначеЕсли СтрокаОстатков.Количество > 1 И Макс(СтрокаОстатков.Количество - СтрокаОстатков.КоличествоРезерв,0) = 0 Тогда
			//для товаров с количеством > 1 нужно, чтобы хотя бы 1 товар не был зарезервирован, т.к. количество все равно потом уменьшается до 1
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Товар <" + СтрокаОстатков.Номенклатура + "> по штрих-коду <" + СтрокаОстатков.СерияНоменклатуры + "> зарезервирован под интернет заказ!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//\
	
	Если СтрокаОстатков.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.ЮвелирноеИзделие Тогда
	     ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Товар <" + СтрокаОстатков.Номенклатура + "> по штрих-коду <" + СтрокаОстатков.СерияНоменклатуры + "> не является ювелирным изделием!");
	КонецЕсли;
	
	ПодборыУ.ПеренестиПодобранныйТоварВДокумент(Объект, СтрокаОстатков, Объект.Товары, Элементы.Товары, Ложь, "Товары",
		ИмяДокумента, Истина);
		
	Для Каждого Стр Из Объект.Товары Цикл
		ПересчитатьВесВХимЧистоте(Стр);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВесПоКомплектующимНаСервере()
	Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни Тогда
		ВесКомплектаНовый = 0;
		УчетВКаратах = Объект.Комплект.Камень.УчетВКаратах;
		Для Каждого Стр Из Объект.Товары Цикл
			Если Стр.Номенклатура.Камень.УчетВКаратах = УчетВКаратах Тогда
				ВесКомплектаНовый = ВесКомплектаНовый + Стр.Вес;
			ИначеЕсли УчетВКаратах Тогда
				ВесКомплектаНовый = ВесКомплектаНовый + Стр.Вес*5;
			Иначе	
				ВесКомплектаНовый = ВесКомплектаНовый + Стр.Вес/5;
			КонецЕсли;	
		КонецЦикла;	
		Объект.ВесКомплекта = ВесКомплектаНовый;
		Объект.ВесКомплектаВХимЧистоте = ВесКомплектаНовый;
	Иначе
		
		ПересчитатьВесВХимЧистоте();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВесПоКомплектующим(Команда)
	ЗаполнитьВесПоКомплектующимНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомплектаИзОстатковПоАртикулу(Команда)
	
	ПодборНоменклатуры("ФормаПодбораПоАртикулуУ", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомплектаИзОстатковПоШК(Команда)
	
	ПодборНоменклатуры("ФормаПодбораПоШтрихКодуУ", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектПриИзменении(Элемент)
	//Удал#
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом")
	//	Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом") Тогда
	//	Объект.КоличествоКомплекта = 0;
	//	Объект.ВесКомплекта = 0;
	//ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни") Тогда
	//	Объект.КоличествоКомплекта = Объект.Товары.Итог("Количество");
	//	ЗаполнитьВесПоКомплектующимНаСервере();
	//Иначе	
	//	Объект.КоличествоКомплекта = 1;
	//	Объект.ВесКомплекта = 0;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуТоваровДляПодбора()
	
	ВидНоменклатурыМеталл 	= Перечисления.ВидыНоменклатуры.Металл;
	
	ТоварыВДокументе = Новый ТаблицаЗначений();
	ТоварыВДокументе.Колонки.Добавить("Номенклатура");
	ТоварыВДокументе.Колонки.Добавить("СерияНоменклатуры");
	ТоварыВДокументе.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТоварыВДокументе.Колонки.Добавить("Размер");
	ТоварыВДокументе.Колонки.Добавить("ДокументПоступления");
	ТоварыВДокументе.Колонки.Добавить("Количество");
	ТоварыВДокументе.Колонки.Добавить("Вес");
	
	Для каждого СтрокаТоваров Из Объект.Товары Цикл
		
		ВидНоменклатуры = СтрокаТоваров.Номенклатура.ВидНоменклатуры;;
		
		Если ВидНоменклатуры <> ВидНоменклатурыМеталл Тогда
			Продолжить;
		КонецЕсли;
		
		нСтрокаТоваров = ТоварыВДокументе.Добавить(); 				
		ЗаполнитьЗначенияСвойств(нСтрокаТоваров, СтрокаТоваров);
		нСтрокаТоваров.ДокументПоступления 	= СтрокаТоваров.ДокументПоступления;
		
	КонецЦикла; 
	
	ТоварыВДокументе.Свернуть("Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры, Размер, ДокументПоступления", "Количество, Вес");

	Возврат ПоместитьВоВременноеХранилище(ТоварыВДокументе, УникальныйИдентификатор);
	
КонецФункции // ()

&НаКлиенте
Процедура ЗаполнитьЦенуПоКомплектующим(Команда)
	ЦенаКомплекта = 0 ;
	Для Каждого Стр Из Объект.Товары Цикл
		ЦенаКомплекта = ЦенаКомплекта + Стр.Количество * Стр.ЦенаВРознице;
	КонецЦикла;	
	Объект.ЦенаВРозницеКомплекта = ЦенаКомплекта;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни") Тогда
		Объект.КоличествоКомплекта = Объект.Товары.Итог("Количество");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляЗапросаХимЧистоты()
	
	МассивДанных = Новый Массив;
	МассивОшибок = Новый Массив;
	МассивДанныхПовтор = Новый Массив;
	Сч = 0;
	Пакеты = Новый Соответствие;
	Если Объект.ИНП <> ""
		И (Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие 
			Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни
			Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом
			Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом) Тогда
		Если Объект.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() 
			и Объект.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатПолученияСведенийОПартиях() Тогда
			Сч = Сч + 1;
			Результат = Новый Структура();
			Результат.Вставить("ИдентификаторЗапроса", Объект.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатПолученияСведенийОПартиях());
			Пакеты.Вставить(Сч, Результат);
			МассивДанныхПовтор.Добавить(Объект.ИдентификаторЗапроса);
		Иначе	
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("УИН", Объект.ИНП);
			СтруктураСтроки.Вставить("НомерСтроки", 0);
			МассивДанных.Добавить(СтруктураСтроки);
			
			Объект.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаЗапросПолученияСведенийОПартиях();
		КонецЕсли;
	Иначе	
		Для Каждого ТекСтрока Из Объект.Товары Цикл
			Если ТекСтрока.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() 
				и ТекСтрока.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
				Продолжить;
			ИначеЕсли ТекСтрока.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() 
				и ТекСтрока.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатПолученияСведенийОПартиях() Тогда
				УжеЕсть = МассивДанныхПовтор.Найти(ТекСтрока.ИдентификаторЗапроса);
				Если УжеЕсть = Неопределено Тогда
					Сч = Сч + 1;
					Результат = Новый Структура();
					Результат.Вставить("ИдентификаторЗапроса", ТекСтрока.ИдентификаторЗапроса);
					Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатПолученияСведенийОПартиях());
					Пакеты.Вставить(Сч, Результат);
					МассивДанныхПовтор.Добавить(ТекСтрока.ИдентификаторЗапроса);
				КонецЕсли;
			ИначеЕсли ТекСтрока.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("По серии " + ТекСтрока.СерияНоменклатуры + " ожидаеться ответ по другому запросу");
				Продолжить;
			ИначеЕсли ТекСтрока.ИНП	= "" Тогда
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("По серии " + ТекСтрока.СерияНоменклатуры + " не заполнен ИНП");
				Продолжить;
			Иначе
				СтруктураСтроки = Новый Структура;
				Если ТекСтрока.ИНППреобразованияВЛом <> "" Тогда					
					СтруктураСтроки.Вставить("УИН", ТекСтрока.ИНППреобразованияВЛом);					
				Иначе	
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("ИНПИзделия", ТекСтрока.ИНП);
					ЕстьСтроки = Объект.Металл.НайтиСтроки(СтруктураПоиска);
					Если ЕстьСтроки.Количество() > 0 Тогда
						Продолжить;
					Иначе	
						СтруктураСтроки.Вставить("УИН", ТекСтрока.ИНП);
					КонецЕсли;
				КонецЕсли;
				СтруктураСтроки.Вставить("НомерСтроки", ТекСтрока.НомерСтроки);
				МассивДанных.Добавить(СтруктураСтроки);
				ТекСтрока.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаЗапросПолученияСведенийОПартиях();
				
			КонецЕсли;	
		КонецЦикла;
		
		Если Объект.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() 
			и Объект.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатПолученияСведенийОПартиях() Тогда
			Сч = Сч + 1;
			Результат = Новый Структура();
			Результат.Вставить("ИдентификаторЗапроса", Объект.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатПолученияСведенийОПартиях());
			Пакеты.Вставить(Сч, Результат);
			МассивДанныхПовтор.Добавить(Объект.ИдентификаторЗапроса);
		ИначеЕсли Объект.ИНП <> "" Тогда	
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("УИН", Объект.ИНП);
			СтруктураСтроки.Вставить("НомерСтроки", 0);
			МассивДанных.Добавить(СтруктураСтроки);
			
			Объект.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаЗапросПолученияСведенийОПартиях();
		КонецЕсли;
	КонецЕсли;		
		
	МаксимальноеКоличество = 1;
	КоличествоСтрок = МассивДанных.Количество();
	
	Если КоличествоСтрок = 0 И МассивДанныхПовтор.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нет данных для отправки");	
	КонецЕсли;	
	ПартииНеОтправлено = Новый Массив();
	НомераСтрокНеОтправлено = Новый Массив();
	НомерПакета = Сч + 1;
	
	Для сч = 1 По КоличествоСтрок Цикл
		
		ТекущаяПартия = МассивДанных[сч - 1];
		
		ПартииНеОтправлено.Добавить(ТекущаяПартия);
		НомераСтрокНеОтправлено.Добавить(ТекущаяПартия.НомерСтроки);
		
		Если ПартииНеОтправлено.Количество() = МаксимальноеКоличество
			Или сч = КоличествоСтрок Тогда
			
			Результат = Новый Структура();
			Результат.Вставить("ПартииНеОтправлено", ТекущаяПартия);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаЗапросПолученияСведенийОПартиях());
			Пакеты.Вставить(НомерПакета, Результат);
			
			ПартииНеОтправлено = Новый Массив();
			НомераСтрокНеОтправлено = Новый Массив();
			НомерПакета = НомерПакета + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляОтправки = Новый Структура;
	ДанныеДляОтправки.Вставить("Пакеты", Пакеты);
	ДанныеДляОтправки.Вставить("МассивОшибок", МассивОшибок);
	
	Возврат ДанныеДляОтправки;

КонецФункции

&НаСервере
Функция ПодготовитьДанныеКомплектацииТоваров()
	
	ПоискТоваровПоВнутреннемуШК = Константы.ПоискТоваровПоВнутреннемуШК.Получить();
	ПоискТоваровПоПаспорту = Константы.ПоискТоваровПоПаспорту.Получить();

	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	КомплектацияТоваров.Комплект КАК Номенклатура,
	                       |	КомплектацияТоваров.Комплект.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	КомплектацияТоваров.Комплект.Камень КАК Камень,
	                       |	КомплектацияТоваров.Комплект.Наименование КАК Наименование,
	                       |	КомплектацияТоваров.Комплект.НаименованиеПолное КАК НаименованиеПолное,
	                       |	КомплектацияТоваров.Комплект.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.Наименование КАК НаименованиеСерии,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.НомерПаспорта КАК НомерПаспорта,
	                       |	КомплектацияТоваров.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ТОГДА ""PRODUCT""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие)
	                       |			ТОГДА ""JEWERLY""
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ТОГДА ""COMPLETE_SET""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	КомплектацияТоваров.Комплект.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ТОГДА ПартииТоваровНаСкладах.Количество
	                       |		ИНАЧЕ КомплектацияТоваров.КоличествоКомплекта
	                       |	КОНЕЦ КАК Количество,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ТОГДА ПартииТоваровНаСкладах.Вес
	                       |		ИНАЧЕ КомплектацияТоваров.ВесКомплекта
	                       |	КОНЕЦ КАК Вес,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА 1
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ТОГДА 2
	                       |		ИНАЧЕ 3
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	КомплектацияТоваров.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваров.Комплект.Проба.Металл КАК Металл,
	                       |	КомплектацияТоваров.Комплект.Проба.Проба КАК Проба,
	                       |	КомплектацияТоваров.Дата КАК Дата,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	КомплектацияТоваров.ВидОперации КАК ВидОперации,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.УИН КАК УИН,
	                       |	КомплектацияТоваров.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваров.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		КОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК > 0
	                       |			ТОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК
	                       |		ИНАЧЕ КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	КомплектацияТоваров.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	КомплектацияТоваров.Организация.ИНН КАК ОрганизацияИНН,
	                       |	КомплектацияТоваров.Организация.КПП КАК ОрганизацияКПП,
	                       |	КомплектацияТоваров.Организация.ОГРН КАК ОрганизацияОГРН,
	                       |	КомплектацияТоваров.ИмяМетода КАК ИмяМетода
	                       |ПОМЕСТИТЬ ШапкаДокумента
	                       |ИЗ
	                       |	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО КомплектацияТоваров.Ссылка = ПартииТоваровНаСкладах.Регистратор
	                       |			И КомплектацияТоваров.СерияНоменклатурыКомплекта = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И (КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом))
	                       |ГДЕ
	                       |	КомплектацияТоваров.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                       |	ВЫРАЗИТЬ(Товары.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	ВЫРАЗИТЬ(&Ссылка КАК Документ.ПреобразованиеВЛом) КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесВХимЧистоте,
	                       |	Товары.ИНП КАК ИНП,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	ВЫРАЗИТЬ(Товары.ХарактеристикаНоменклатуры КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
	                       |	Товары.ВесВХимЧистотеГИИСДМДК КАК ВесВХимЧистотеГИИСДМДК
	                       |ПОМЕСТИТЬ Товары
	                       |ИЗ
	                       |	&Товары КАК Товары
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	КомплектацияТоваровМеталл.ИНП КАК ИНП,
	                       |	КомплектацияТоваровМеталл.ТипМеталла КАК ТипМеталла,
	                       |	КомплектацияТоваровМеталл.Вес КАК Вес,
	                       |	КомплектацияТоваровМеталл.ВесВЧистоте КАК ВесВЧистоте,
	                       |	КомплектацияТоваровМеталл.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваровМеталл.НомерСтроки КАК НомерСтроки,
	                       |	КомплектацияТоваровМеталл.Проба КАК Проба,
	                       |	КомплектацияТоваровМеталл.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	КомплектацияТоваровМеталл.ОписаниеОшибки КАК ОписаниеОшибки,
	                       |	КомплектацияТоваровМеталл.СтатусЗапроса КАК Статус,
	                       |	КомплектацияТоваровМеталл.ИНПИзделия КАК ИНПИзделия
	                       |ПОМЕСТИТЬ Металлы
	                       |ИЗ
	                       |	Документ.ПреобразованиеВЛом.Металл КАК КомплектацияТоваровМеталл
	                       |ГДЕ
	                       |	КомплектацияТоваровМеталл.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	Товары.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |			ТОГДА Товары.ИНППреобразованияВЛом
	                       |		ИНАЧЕ Товары.СерияНоменклатуры.УИН
	                       |	КОНЕЦ КАК УИН,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ Товары.Номенклатура.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	Товары.Номенклатура.Проба.Проба КАК Проба,
	                       |	Товары.Номенклатура.Проба.Металл КАК Металл,
	                       |	Товары.Номенклатура КАК Номенклатура,
	                       |	Товары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	Товары.Номенклатура.Камень КАК Камень,
	                       |	Товары.Номенклатура.Наименование КАК Наименование,
	                       |	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	                       |	Товары.Номенклатура.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	Товары.СерияНоменклатуры.Наименование КАК НаименованиеСерии,
	                       |	Товары.СерияНоменклатуры.НомерПаспорта КАК НомерПаспорта,
	                       |	Товары.СсылкаНаДокумент.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""PRODUCT""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие)
	                       |			ТОГДА ""PRODUCT""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ТОГДА ""COMPLETE_SET""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""JEWERLY""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ТОГДА ""JEWERLY""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""BUYING_UP""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	Товары.Номенклатура.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	Товары.СсылкаНаДокумент.Дата КАК Дата,
	                       |	Товары.СсылкаНаДокумент.ВидОперации КАК ВидОперации,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		КОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте > 0
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	Товары.ИНП КАК ИНП,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	Товары.СсылкаНаДокумент.Организация.ЮрФизЛицо КАК СсылкаНаДокументОрганизацияЮрФизЛицо,
	                       |	Товары.СсылкаНаДокумент.Организация.ИНН КАК СсылкаНаДокументОрганизацияИНН,
	                       |	Товары.СсылкаНаДокумент.Организация.КПП КАК СсылкаНаДокументОрганизацияКПП,
	                       |	Товары.СсылкаНаДокумент.Организация.ОГРН КАК СсылкаНаДокументОрганизацияОГРН,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.СерияНоменклатуры КАК СерияНоменклатуры
	                       |ПОМЕСТИТЬ СтрокиДокумента
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО Товары.СсылкаНаДокумент = ПартииТоваровНаСкладах.Регистратор
	                       |			И Товары.Номенклатура = ПартииТоваровНаСкладах.Номенклатура
	                       |			И Товары.СерияНоменклатуры = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И Товары.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ШапкаДокумента.Номенклатура КАК Номенклатура,
	                       |	ШапкаДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	ШапкаДокумента.Камень КАК Камень,
	                       |	ШапкаДокумента.Наименование КАК Наименование,
	                       |	ШапкаДокумента.НаименованиеПолное КАК НаименованиеПолное,
	                       |	ШапкаДокумента.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	ШапкаДокумента.НаименованиеСерии КАК НаименованиеСерии,
	                       |	ШапкаДокумента.НомерПаспорта КАК НомерПаспорта,
	                       |	ШапкаДокумента.Номер КАК Номер,
	                       |	ШапкаДокумента.ТипПартии КАК ТипПартии,
	                       |	ШапкаДокумента.ВидПартии КАК ВидПартии,
	                       |	ШапкаДокумента.ЭтапОбработки КАК ЭтапОбработки,
	                       |	ШапкаДокумента.СтадияОбработки КАК СтадияОбработки,
	                       |	ШапкаДокумента.ОКПД2 КАК ОКПД2,
	                       |	ШапкаДокумента.Количество КАК Количество,
	                       |	ШапкаДокумента.Вес КАК Вес,
	                       |	ШапкаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ШапкаДокумента.Ссылка КАК Ссылка,
	                       |	ШапкаДокумента.Металл КАК Металл,
	                       |	ШапкаДокумента.Проба КАК Проба,
	                       |	ШапкаДокумента.Дата КАК Дата,
	                       |	ШапкаДокумента.УчетВКаратах КАК УчетВКаратах,
	                       |	ШапкаДокумента.ВидОперации КАК ВидОперации,
	                       |	ШапкаДокумента.УИН КАК УИН,
	                       |	ШапкаДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	ШапкаДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	0 КАК НомерСтроки,
	                       |	ШапкаДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	ШапкаДокумента.ОрганизацияЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	ШапкаДокумента.ОрганизацияИНН КАК ОрганизацияИНН,
	                       |	ШапкаДокумента.ОрганизацияКПП КАК ОрганизацияКПП,
	                       |	ШапкаДокумента.ОрганизацияОГРН КАК ОрганизацияОГРН,
	                       |	ШапкаДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |ГДЕ
	                       |	(ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом)
	                       |			ИЛИ ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |			ИЛИ ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |			ИЛИ ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие)
	                       |			ИЛИ ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие))
	                       |	И (ШапкаДокумента.СтатусЗапроса <> ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                       |			ИЛИ ШапкаДокумента.ИмяМетода = ""SendReserveBatchUic"")
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.Номенклатура,
	                       |	СтрокиДокумента.ВидНоменклатуры,
	                       |	СтрокиДокумента.Камень,
	                       |	СтрокиДокумента.Наименование,
	                       |	СтрокиДокумента.НаименованиеПолное,
	                       |	СтрокиДокумента.НаименованиеГИИСДМДК,
	                       |	СтрокиДокумента.НаименованиеСерии,
	                       |	СтрокиДокумента.НомерПаспорта,
	                       |	СтрокиДокумента.Номер,
	                       |	СтрокиДокумента.ТипПартии,
	                       |	СтрокиДокумента.ВидПартии,
	                       |	СтрокиДокумента.ЭтапОбработки,
	                       |	СтрокиДокумента.СтадияОбработки,
	                       |	СтрокиДокумента.ОКПД2,
	                       |	СтрокиДокумента.Количество,
	                       |	СтрокиДокумента.Вес,
	                       |	СтрокиДокумента.ЕдиницаИзмерения,
	                       |	СтрокиДокумента.СсылкаНаДокумент,
	                       |	СтрокиДокумента.Металл,
	                       |	СтрокиДокумента.Проба,
	                       |	СтрокиДокумента.Дата,
	                       |	СтрокиДокумента.УчетВКаратах,
	                       |	СтрокиДокумента.ВидОперации,
	                       |	СтрокиДокумента.УИН,
	                       |	СтрокиДокумента.СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса,
	                       |	СтрокиДокумента.НомерСтроки,
	                       |	СтрокиДокумента.ВесМеталлаВЧистоте,
	                       |	СтрокиДокумента.СсылкаНаДокументОрганизацияЮрФизЛицо,
	                       |	СтрокиДокумента.СсылкаНаДокументОрганизацияИНН,
	                       |	СтрокиДокумента.СсылкаНаДокументОрганизацияКПП,
	                       |	СтрокиДокумента.СсылкаНаДокументОрганизацияОГРН,
	                       |	СтрокиДокумента.ИмяМетода
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	(СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни))
	                       |	И (СтрокиДокумента.СсылкаНаДокумент.СтатусЗапроса <> ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                       |			ИЛИ СтрокиДокумента.СсылкаНаДокумент.ИмяМетода = ""SendGetBatch"")
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	НомерСтроки
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.Количество КАК Количество,
	                       |	СтрокиДокумента.Вес КАК Вес,
	                       |	СтрокиДокумента.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.УИН КАК УИН,
	                       |	СтрокиДокумента.УчетВКаратах КАК УчетВКаратах,
	                       |	СтрокиДокумента.Проба КАК Проба,
	                       |	СтрокиДокумента.Металл КАК Металл,
	                       |	СтрокиДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	СтрокиДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	СтрокиДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	(СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом)
	                       |			ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |			ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие)
	                       |			ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие)
	                       |			ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом))
	                       |	И (СтрокиДокумента.СсылкаНаДокумент.СтатусЗапроса <> ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                       |			ИЛИ СтрокиДокумента.СсылкаНаДокумент.ИмяМетода = ""SendReserveBatchUic"")
	                       |	И ВЫБОР
	                       |			КОГДА СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом)
	                       |					ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |					ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие)
	                       |				ТОГДА СтрокиДокумента.УИН <> """"
	                       |			КОГДА СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				ТОГДА СтрокиДокумента.ИНППреобразованияВЛом <> """"
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	ШапкаДокумента.Количество,
	                       |	ШапкаДокумента.Вес,
	                       |	ШапкаДокумента.Ссылка,
	                       |	0,
	                       |	ШапкаДокумента.УИН,
	                       |	ШапкаДокумента.УчетВКаратах,
	                       |	ШапкаДокумента.Проба,
	                       |	ШапкаДокумента.Металл,
	                       |	ШапкаДокумента.СтатусЗапроса,
	                       |	ШапкаДокумента.ИдентификаторЗапроса,
	                       |	ШапкаДокумента.ВесМеталлаВЧистоте,
	                       |	ШапкаДокумента.ИмяМетода
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |ГДЕ
	                       |	(ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ИЛИ ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни))
	                       |	И (ШапкаДокумента.СтатусЗапроса <> ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                       |			ИЛИ ШапкаДокумента.ИмяМетода = ""SendGetBatch"")
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	0,
	                       |	Металлы.Вес,
	                       |	Металлы.Ссылка,
	                       |	Металлы.НомерСтроки,
	                       |	Металлы.ИНП,
	                       |	ЛОЖЬ,
	                       |	Металлы.Проба,
	                       |	Металлы.ТипМеталла,
	                       |	Металлы.Статус,
	                       |	Металлы.ИдентификаторЗапроса,
	                       |	Металлы.ВесВЧистоте,
	                       |	""""
	                       |ИЗ
	                       |	Металлы КАК Металлы
	                       |ГДЕ
	                       |	Металлы.ИНП <> """"
	                       |	И Металлы.ТипМеталла <> ЗНАЧЕНИЕ(Справочник.ТипыДрагоценныхМеталлов.ПустаяСсылка)
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	НомерСтроки
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	0 КАК НомерСтрокиТаблЧасти,
	                       |	ШапкаДокумента.Номенклатура.Камень КАК Камень,
	                       |	ШапкаДокумента.Номенклатура.ФормаОгранки КАК ФормаОгранки,
	                       |	ШапкаДокумента.Номенклатура.ГруппаЦвета КАК ГруппаЦвета,
	                       |	ШапкаДокумента.Номенклатура.ГруппаДефекта КАК ГруппаДефекта,
	                       |	ШапкаДокумента.Номенклатура.Рассев КАК Рассев,
	                       |	ШапкаДокумента.Вес КАК Вес,
	                       |	ШапкаДокумента.Количество КАК Количество,
	                       |	ШапкаДокумента.Номенклатура.ГеометрияКамняГИИСДМДК КАК ГеометрияКамняГИИСДМДК,
	                       |	ШапкаДокумента.Номенклатура.СпособОблагораживанияГИИСДМДК КАК СпособОблагораживанияГИИСДМДК,
	                       |	0 КАК НомерСтроки,
	                       |	ШапкаДокумента.Номенклатура.Рассев.ЗначениеКлассификатораГИИСДМДК КАК РассевГИИСДМДК,
	                       |	ШапкаДокумента.Ссылка КАК Ссылка,
	                       |	ШапкаДокумента.УИН КАК УИН,
	                       |	ШапкаДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |ГДЕ
	                       |	ШапкаДокумента.ЭтоКамни = 1
	                       |	И (ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом)
	                       |			ИЛИ ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни))
	                       |	И ШапкаДокумента.СтатусЗапроса <> ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.НомерСтроки,
	                       |	СтрокиДокумента.Номенклатура.Камень,
	                       |	СтрокиДокумента.Номенклатура.ФормаОгранки,
	                       |	СтрокиДокумента.Номенклатура.ГруппаЦвета,
	                       |	СтрокиДокумента.Номенклатура.ГруппаДефекта,
	                       |	СтрокиДокумента.Номенклатура.Рассев,
	                       |	СтрокиДокумента.Вес,
	                       |	СтрокиДокумента.Количество,
	                       |	СтрокиДокумента.Номенклатура.ГеометрияКамняГИИСДМДК,
	                       |	СтрокиДокумента.Номенклатура.СпособОблагораживанияГИИСДМДК,
	                       |	СтрокиДокумента.НомерСтроки,
	                       |	СтрокиДокумента.Номенклатура.Рассев.ЗначениеКлассификатораГИИСДМДК,
	                       |	СтрокиДокумента.СсылкаНаДокумент,
	                       |	СтрокиДокумента.УИН,
	                       |	СтрокиДокумента.ИмяМетода
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	(СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ИЛИ СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие))
	                       |	И (СтрокиДокумента.СсылкаНаДокумент.СтатусЗапроса <> ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                       |			ИЛИ СтрокиДокумента.СсылкаНаДокумент.ИмяМетода = ""SendGetBatch"")
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	НомерСтроки
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.Количество КАК Количество,
	                       |	СтрокиДокумента.Вес КАК Вес,
	                       |	СтрокиДокумента.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНП КАК УИН,
	                       |	СтрокиДокумента.УчетВКаратах КАК УчетВКаратах,
	                       |	СтрокиДокумента.Проба КАК Проба,
	                       |	СтрокиДокумента.Металл КАК Металл,
	                       |	СтрокиДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	СтрокиДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	СтрокиДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Металлы КАК Металлы
	                       |		ПО СтрокиДокумента.ИНП = Металлы.ИНПИзделия
	                       |ГДЕ
	                       |	СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |	И СтрокиДокумента.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |	И СтрокиДокумента.СсылкаНаДокумент.СтатусЗапроса <> ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                       |	И ВЫБОР
	                       |			КОГДА Металлы.ИНП ЕСТЬ NULL
	                       |				ТОГДА СтрокиДокумента.ИНППреобразованияВЛом = """"
	                       |			ИНАЧЕ ЛОЖЬ
	                       |		КОНЕЦ
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	НомерСтроки
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ШапкаДокумента.УИН КАК УИН,
	                       |	ШапкаДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	ШапкаДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	"""" КАК ИмяМетода,
	                       |	0 КАК НомерСтроки
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |ГДЕ
	                       |	ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	НомерСтроки
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал КАК Материал,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Вес КАК Вес,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл КАК МатериалМеталл,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба КАК МатериалПроба
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеМатериалы КАК ХарактеристикиНоменклатурыДополнительныеМатериалы
	                       |		ПО Товары.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатурыДополнительныеМатериалы.Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Металлы.ИНП КАК ИНП,
	                       |	Металлы.ТипМеталла КАК ТипМеталла,
	                       |	Металлы.Вес КАК Вес,
	                       |	Металлы.ВесВЧистоте КАК ВесВЧистоте,
	                       |	Металлы.Ссылка КАК Ссылка,
	                       |	Металлы.НомерСтроки КАК НомерСтроки,
	                       |	Металлы.Проба КАК Проба,
	                       |	Металлы.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	Металлы.ОписаниеОшибки КАК ОписаниеОшибки,
	                       |	Металлы.Статус КАК СтатусЗапроса
	                       |ИЗ
	                       |	Металлы КАК Металлы
	                       |ГДЕ
	                       |	Металлы.ТипМеталла = ЗНАЧЕНИЕ(Справочник.ТипыДрагоценныхМеталлов.ПустаяСсылка)
	                       |	И Металлы.ИНП <> """"");
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДанныеШапкиДокументов = РезультатЗапроса[4].Выбрать();
	ДанныеПоТоварам = РезультатЗапроса[5].Выгрузить();
	ДанныеПоКамням = РезультатЗапроса[6].Выгрузить();
	ДанныеПоДопМатериалам = РезультатЗапроса[9].Выгрузить();
	ДанныеДляПреобразования = РезультатЗапроса[7].Выбрать();
	
	ДанныеДляПолученияВесаЧистоты = РезультатЗапроса[10].Выбрать();
	
	Пакеты = Новый Соответствие;
	ДанныеДляОтправки = Новый Структура;
	НомерПакета = 0;
	
	МассивТоваров = Новый Массив;
	
	ДопустимоеКоличествоПартий = 50;
	КоличествоВЗапросе = 0;
	НомераСтрокНеОтправлено = Новый Массив;
	МассивТоваровДляОтправкиВПакете = Новый Массив;
	
	Пока ДанныеДляПолученияВесаЧистоты.Следующий() Цикл
		Если ДанныеДляПолученияВесаЧистоты.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда	
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеДляПолученияВесаЧистоты.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", "CheckGetBatch");
			Результат.Вставить("ИмяТаблЧасти", "Металл");
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			НомераСтрокНеОтправлено.Добавить(ДанныеДляПолученияВесаЧистоты.НомерСтроки);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Результат.Вставить("УИН", ДанныеДляПолученияВесаЧистоты.ИНП);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", "SendGetBatch");
			Результат.Вставить("ИмяТабЧасти", "Металл");
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;	
	КонецЦикла;
	
	Пока ДанныеДляПреобразования.Следующий() Цикл
		Если ДанныеДляПреобразования.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() 
			И Не ДанныеДляПреобразования.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
			Продолжить;
		ИначеЕсли ДанныеДляПреобразования.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() 
			и (ДанныеДляПреобразования.ИмяМетода = "" 
				Или ДанныеДляПреобразования.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаРезультатОтправкаПреобразованиеВЛомНаРегистрацию()) Тогда	
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеДляПреобразования.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаРезультатОтправкаПреобразованиеВЛомНаРегистрацию());
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			СтруктураСтроки = Новый Структура;	
			СтруктураСтроки.Вставить("НомерСтроки", ДанныеДляПреобразования.НомерСтроки);
			СтруктураСтроки.Вставить("УИН", ДанныеДляПреобразования.УИН);
			МассивТоваровДляОтправкиВПакете.Добавить(СтруктураСтроки);
			НомераСтрокНеОтправлено.Добавить(ДанныеДляПреобразования.НомерСтроки);
			КоличествоВЗапросе = КоличествоВЗапросе + 1;
			Если КоличествоВЗапросе = ДопустимоеКоличествоПартий Тогда
				НомерПакета = НомерПакета + 1;
				Результат = Новый Структура();
				Результат.Вставить("Спецификации", МассивТоваровДляОтправкиВПакете);
				Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
				Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаПреобразованияВЛомНаРегистрацию());
				Пакеты.Вставить(НомерПакета, Результат);
				КоличествоВЗапросе = 0;
				МассивТоваровДляОтправкиВПакете = Новый Массив;
				НомераСтрокНеОтправлено = Новый Массив;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоВЗапросе > 0 Тогда		
		НомерПакета = НомерПакета + 1;
		Результат = Новый Структура();
		Результат.Вставить("Спецификации", МассивТоваровДляОтправкиВПакете);
		Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
		Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаПреобразованияВЛомНаРегистрацию());
		Пакеты.Вставить(НомерПакета, Результат);
		КоличествоВЗапросе = 0;		
	КонецЕсли;	
	
	Если ДанныеДляПреобразования.Количество() > 0 Тогда
		ДанныеДляПреобразования.Сбросить();
		Пока ДанныеДляПреобразования.Следующий() Цикл
			НомераСтрокНеОтправлено.Добавить(ДанныеДляПреобразования.НомерСтроки);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Результат.Вставить("УИН", ДанныеДляПреобразования.УИН);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", "SendGetBatch");
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЦикла;
	КонецЕсли;	
	
	Если ДанныеДляПолученияВесаЧистоты.Количество() = 0 Тогда
		Пока ДанныеШапкиДокументов.Следующий() Цикл
			Если ДанныеШапкиДокументов.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех()
				И Не ДанныеШапкиДокументов.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях()
				И Не ДанныеШапкиДокументов.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросНаРезервированиеДиапазонаУИН() Тогда
				Продолжить;
			ИначеЕсли ДанныеШапкиДокументов.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета()
				И Не ДанныеШапкиДокументов.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
				НомерПакета = НомерПакета + 1;
				Результат = Новый Структура;
				Результат.Вставить("ИдентификаторЗапроса", ДанныеШапкиДокументов.ИдентификаторЗапроса);
				ИмяМетодаРезультат = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияРезультата(ДанныеШапкиДокументов.ИмяМетода);
				Результат.Вставить("ИмяМетода", ?(ИмяМетодаРезультат = "", ДанныеШапкиДокументов.ИмяМетода, ИмяМетодаРезультат));
				Пакеты.Вставить(НомерПакета, Результат);
			ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие") Тогда	
				НомераСтрокНеОтправлено.Добавить(ДанныеШапкиДокументов.НомерСтроки);
				НомерПакета = НомерПакета + 1;
				Результат = Новый Структура();
				Результат.Вставить("УИН", Объект.ИНП);
				Результат.Вставить("Заменить", Истина);
				ВложенныеПартии = Новый Массив;
				Результат.Вставить("ВложенныеПартии", ВложенныеПартии);
				Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
				Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросОтправкаКомплектации());
				Пакеты.Вставить(НомерПакета, Результат);
			ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие")
				И (ДанныеШапкиДокументов.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросНаРезервированиеДиапазонаУИН()
					Или ДанныеШапкиДокументов.ИмяМетода = "")
				И Объект.ИНПЗарезирвированное = "" Тогда	
				НомераСтрокНеОтправлено.Добавить(ДанныеШапкиДокументов.НомерСтроки);
				НомерПакета = НомерПакета + 1;
				Результат = Новый Структура();
				Результат.Вставить("КоличествоУИН", 1);
				Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
				Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросНаРезервированиеДиапазонаУИН());
				Пакеты.Вставить(НомерПакета, Результат);
			ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие")
				И (ДанныеШапкиДокументов.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросОтправкаКомплектации()
					Или ДанныеШапкиДокументов.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросНаРезервированиеДиапазонаУИН())
				И Объект.ИНПЗарезирвированное <> "" Тогда	
				НомераСтрокНеОтправлено.Добавить(ДанныеШапкиДокументов.НомерСтроки);
				НомерПакета = НомерПакета + 1;
				Результат = Новый Структура();
				Результат.Вставить("УИН", Объект.ИНПЗарезирвированное);
				Результат.Вставить("Заменить", ложь);
				ВложенныеПартии = Новый Массив;
				Для Каждого ТекущийТовар Из ДанныеПоТоварам Цикл
					ВложенныеПартии.Добавить(ТекущийТовар.УИН);	
				КонецЦикла;	
				Результат.Вставить("ВложенныеПартии", ВложенныеПартии);
				Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
				Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросОтправкаКомплектации());
				Пакеты.Вставить(НомерПакета, Результат);	
			Иначе	
				Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")
					Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом"))
					И ЗначениеЗаполнено(ДанныеШапкиДокументов.УИН) Тогда
					НомераСтрокНеОтправлено.Добавить(ДанныеШапкиДокументов.НомерСтроки);
					НомерПакета = НомерПакета + 1;
					Результат = Новый Структура();
					Результат.Вставить("УИН", ДанныеШапкиДокументов.УИН);
					Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
					Результат.Вставить("ИмяМетода", "SendGetBatch");
					Пакеты.Вставить(НомерПакета, Результат);
				ИначеЕсли (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни")
					Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом")
					Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие"))
					И ЗначениеЗаполнено(ДанныеШапкиДокументов.УИН) Тогда	
					НомераСтрокНеОтправлено.Добавить(ДанныеШапкиДокументов.НомерСтроки);
					НомерПакета = НомерПакета + 1;
					Результат = Новый Структура();
					Результат.Вставить("УИН", ДанныеШапкиДокументов.УИН);
					Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
					Результат.Вставить("ИмяМетода", "SendGetBatch");
					Пакеты.Вставить(НомерПакета, Результат);
				КонецЕсли;	
				НомерПакета = НомерПакета + 1;
				Спецификация = ПодготовитьДанныеДокументаСОперациейКомплектации(ДанныеШапкиДокументов, ДанныеПоТоварам, ДанныеПоКамням, ДанныеПоДопМатериалам,
				ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту);
				
				Результат = Новый Структура();
				Результат.Вставить("Спецификации", Спецификация);
				Результат.Вставить("НомераСтрокНеОтправлено", ДанныеШапкиДокументов.НомерСтроки);
				МассивСтрок = Новый Массив;
				Для Каждого ТекСтр Из ДанныеПоТоварам Цикл
					МассивСтрок.Добавить(ТекСтр.НомерСтроки);
				КонецЦикла;	
				Результат.Вставить("НомераСтрокДляЗаполнения", МассивСтрок);
				Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")
					Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом")
					Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие")
					Или (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом")) Тогда
					Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектацийНаРегистрацию());
				Иначе
					Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаРазукомплектацийНаРегистрацию());
				КонецЕсли;
				Пакеты.Вставить(НомерПакета, Результат);
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;

	КоличествоВЗапросе = 0;
	НомераСтрокНеОтправлено = Новый Массив;
	МассивТоваровДляОтправкиВПакете = Новый Массив;
	// запрос веса металла
	ДанныеДляПолученияВесаЧистоты = РезультатЗапроса[8].Выбрать();
	Пока ДанныеДляПолученияВесаЧистоты.Следующий() Цикл
		Если ДанныеДляПолученияВесаЧистоты.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() 
			И (ДанныеДляПолученияВесаЧистоты.ИмяМетода = "SendGetBatch"
				Или ДанныеДляПолученияВесаЧистоты.ИмяМетода = "CheckGetBatch") Тогда	
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеДляПолученияВесаЧистоты.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", "CheckGetBatch");
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			НомераСтрокНеОтправлено.Добавить(ДанныеДляПолученияВесаЧистоты.НомерСтроки);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Результат.Вставить("УИН", ДанныеДляПолученияВесаЧистоты.УИН);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", "SendGetBatch");
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;	
	КонецЦикла;		
	
	// запрос информации по камням
	ПолучитьДанныеПоКамнямДляЗапроса(Пакеты, НомерПакета);
	
	ДанныеДляОтправки.Вставить("Пакеты", Пакеты);
	
	Возврат ДанныеДляОтправки;
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеПоКамнямДляЗапроса(Пакеты, НомерПакета)
	НомераСтрокНеОтправлено = Новый Массив;	
	Для Каждого ДанныеДляПолученияКамней Из Объект.Камни Цикл
		Если ДанныеДляПолученияКамней.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех()
			И ЗначениеЗаполнено(ДанныеДляПолученияКамней.ТипКамняГИИСДМДК) Тогда
			Продолжить;
		ИначеЕсли ДанныеДляПолученияКамней.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда	
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеДляПолученияКамней.ИдентификаторЗапроса);
			Результат.Вставить("ИмяТабЧасти", "Камни");
			Результат.Вставить("ИмяМетода", "CheckGetBatch");
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			НомераСтрокНеОтправлено.Добавить(ДанныеДляПолученияКамней.НомерСтроки);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Результат.Вставить("УИН", ДанныеДляПолученияКамней.ИНП);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяТабЧасти", "Камни");
			Результат.Вставить("ИмяМетода", "SendGetBatch");
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДокументаСОперациейКомплектации(ДанныеШапкиДокументов, ДанныеПоТоварам, ДанныеПоКамням, ДанныеПоДопПробе,
		ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту)
	
	МассивТоваров = Новый Массив;
	
	ТаблицаДополнительныхПроб = Новый ТаблицаЗначений;
	ТаблицаДополнительныхПроб.Колонки.Добавить("Металл");
	ТаблицаДополнительныхПроб.Колонки.Добавить("ВесМеталлаВЧистоте");
	ТаблицаДополнительныхПроб.Колонки.Добавить("Проба");
	
	Спецификация = Новый Структура;		
	Спецификация.Вставить("Номер", ДанныеШапкиДокументов.Номер);
	Спецификация.Вставить("Дата", ДанныеШапкиДокументов.Дата);
	
	ПараметрыНаименования = Новый Структура;
	ПараметрыНаименования.Вставить("ВидНоменклатуры", ДанныеШапкиДокументов.ВидНоменклатуры);
	ПараметрыНаименования.Вставить("Камень", ДанныеШапкиДокументов.Камень);
	ПараметрыНаименования.Вставить("Наименование", ДанныеШапкиДокументов.Наименование);
	ПараметрыНаименования.Вставить("НаименованиеПолное", ДанныеШапкиДокументов.НаименованиеПолное);
	ПараметрыНаименования.Вставить("НаименованиеГИИСДМДК", ДанныеШапкиДокументов.НаименованиеГИИСДМДК);
	ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", ДанныеШапкиДокументов.НаименованиеСерии);
	ПараметрыНаименования.Вставить("ШтрихкодПоставщика", ДанныеШапкиДокументов.НомерПаспорта);
	ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
	ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
	
	Наименования = ИнтеграцияГИИСДМДКЮТДСервер.НаименованияМатериала(ПараметрыНаименования);
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("НомерСтроки", 0);
	СтруктураСтроки.Вставить("Наименование", Наименования.Наименование);	
	Если ДанныеШапкиДокументов.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни
		Или ДанныеШапкиДокументов.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
		СтруктураСтроки.Вставить("УИН", ДанныеШапкиДокументов.УИН);
	КонецЕсли;
	СтруктураСтроки.Вставить("ТипПартии", ДанныеШапкиДокументов.ТипПартии);
	СтруктураСтроки.Вставить("ВидПартии", ДанныеШапкиДокументов.ВидПартии);
	СтруктураСтроки.Вставить("ЭтапОбработки", ДанныеШапкиДокументов.ЭтапОбработки);
	СтруктураСтроки.Вставить("СтадияОбработки", ДанныеШапкиДокументов.СтадияОбработки);
	СтруктураСтроки.Вставить("ОКПД2", ДанныеШапкиДокументов.ОКПД2);
	
	СтруктураОрганизации = Новый Структура;
	Если ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураОрганизации.Вставить("ТипКонтрагента", "legal");
		Если ДанныеШапкиДокументов.ОрганизацияКПП = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен КПП организации ");
		КонецЕсли;	
		Если ДанныеШапкиДокументов.ОрганизацияОГРН = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОГРН организации");
		КонецЕсли;
	ИначеЕсли ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		СтруктураОрганизации.Вставить("ТипКонтрагента", "physical");
		Если ДанныеШапкиДокументов.ОрганизацияОГРН = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОГРН организации");
		КонецЕсли;
	КонецЕсли;
	СтруктураОрганизации.Вставить("ИНН", ДанныеШапкиДокументов.ОрганизацияИНН);
	Если ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураОрганизации.Вставить("КПП", ДанныеШапкиДокументов.ОрганизацияКПП);
	Иначе
		СтруктураОрганизации.Вставить("КПП", "");
	КонецЕсли;	
	СтруктураОрганизации.Вставить("ОГРН", ДанныеШапкиДокументов.ОрганизацияОГРН);
	СтруктураСтроки.Вставить("Собственник", СтруктураОрганизации);

	Если ДанныеШапкиДокументов.УчетВКаратах Тогда
		СтруктураСтроки.Вставить("Вес", Окр(ДанныеШапкиДокументов.Вес / 5, 5) * ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса());
	Иначе	
		СтруктураСтроки.Вставить("Вес", ДанныеШапкиДокументов.Вес * ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса());
	КонецЕсли;
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", ДанныеШапкиДокументов.ЕдиницаИзмерения);
	
	
	Если ДанныеШапкиДокументов.ТипПартии = "GEMSTONE" Тогда
		СтруктураСтроки.Вставить("Количество", ДанныеШапкиДокументов.Количество);
		ДанныеПоКамнямПослеКодировки = ИнтеграцияГИИСДМДКЮТДСервер.ЗакодироватьКамниИзТаблицыПоКлассификатору(ДанныеПоКамням);
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НомерСтрокиТаблЧасти", ДанныеШапкиДокументов.НомерСтроки);
		СтруктураПоиска.Вставить("Ссылка", ДанныеШапкиДокументов.Ссылка);
		ЕстьСтрокиСКамнями = ДанныеПоКамнямПослеКодировки.НайтиСтроки(СтруктураПоиска);
		Если ЕстьСтрокиСКамнями.Количество() > 0 Тогда
			Для Каждого ДанныеКамня Из ЕстьСтрокиСКамнями Цикл
				
				Если ДанныеКамня.Ошибки.Количество() > 0 Тогда
					
					ОписаниеОшибки = СтрСоединить(ДанныеКамня.Ошибки, "; ");
					ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не верно заполнена спецификация вставок: " + ОписаниеОшибки + " в шапке документа " 
					+ ДанныеШапкиДокументов.Ссылка);
					Продолжить;
					
				КонецЕсли;
				
				СтрокаВставок = Новый Структура();
				СтрокаВставок.Вставить("ВидКамня", ДанныеКамня.БуквенныйКод);
				СтрокаВставок.Вставить("КлассификационныйКод", ДанныеКамня.КлассификационныйКод);
				СтрокаВставок.Вставить("Количество", ДанныеКамня.Количество);
				//СтрокаВставок.Вставить("МассаСырья", ДанныеКамня.Вес * ИнтеграцияГИИСДМДК.КоэффициентВеса());
			КонецЦикла;
			СтруктураСтроки.Вставить("СведенияОКамнях", СтрокаВставок);
		КонецЕсли;
	ИначеЕсли ДанныеШапкиДокументов.ТипПартии = "PRODUCT" Тогда	
		СтруктураСтроки.Вставить("Количество", ДанныеШапкиДокументов.Количество);
		СтруктураСтроки.Вставить("ТипПартии", ДанныеШапкиДокументов.ТипПартии);
		СтруктураСтроки.Вставить("ВидПартии", ДанныеШапкиДокументов.ВидПартии);
		СтруктураСтроки.Вставить("ЭтапОбработки", ДанныеШапкиДокументов.ЭтапОбработки);
		СтруктураСтроки.Вставить("СтадияОбработки", ДанныеШапкиДокументов.СтадияОбработки);
		СтруктураСтроки.Вставить("ОКПД2", ДанныеШапкиДокументов.ОКПД2);
				
		СтруктураСтроки.Вставить("Вес", ДанныеШапкиДокументов.Вес * ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса());
		СтруктураСтроки.Вставить("ЕдиницаИзмерения", "GRM");
		
		СтруктураПартии = Новый Структура;
		СтруктураПартии.Вставить("ВидОсновногоМеталла", ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(ДанныеШапкиДокументов.Металл));
		Если СтруктураПартии.ВидОсновногоМеталла = "No" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не определен вид металла для серии " + ДанныеШапкиДокументов.НаименованиеСерии);
		КонецЕсли;
		СтруктураПартии.Вставить("Металл", СтруктураПартии.ВидОсновногоМеталла);
		СтруктураПартии.Вставить("Проба", ДанныеШапкиДокументов.Проба*100);
		Если СтруктураПартии.Проба = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена проба для серии " + ДанныеШапкиДокументов.НаименованиеСерии);
		КонецЕсли;
		
		СтруктураПартии.Вставить("ПробаПодтвержденная", СтруктураПартии.Проба);
		МассивСплавов = Новый Массив;
		СтруктураМеталла = Новый Структура;
		СтруктураМеталла.Вставить("Металл", СтруктураПартии.ВидОсновногоМеталла);
		//ВесМеталлаВЧистоте = Окр(ДанныеШапкиДокументов.Вес * ДанныеШапкиДокументов.Проба / 999.9, 3);
		СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", ДанныеШапкиДокументов.ВесМеталлаВЧистоте * ИнтеграцияГИИСДМДК.КоэффициентВеса());
		СтруктураМеталла.Вставить("Проба", СтруктураПартии.Проба*100);
		СтруктураМеталла.Вставить("ПробаПодтвержденная", СтруктураПартии.Проба*100);
		МассивСплавов.Добавить(СтруктураМеталла);
		
		ТаблицаДополнительныхПроб.Очистить();
		Для Каждого СтрДопМатериал Из ДанныеПоДопПробе Цикл
			Если Не ЗначениеЗаполнено(СтрДопМатериал.МатериалМеталл) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрДопМатериал.Вес = 0 
				или СтрДопМатериал.МатериалМеталл.НеДрагоценныйМеталл  Тогда
				Продолжить;
			КонецЕсли;	
			Если СтрДопМатериал.МатериалМеталл.ПробаЧистоты = 0 Тогда
				ТекВесМеталлаВЧистоте = 0;
			Иначе	
				ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
				* СтрДопМатериал.МатериалПроба/СтрДопМатериал.МатериалМеталл.ПробаЧистоты, 3);
			КонецЕсли;
			Если ТекВесМеталлаВЧистоте = 0 Тогда
				Продолжить;
			КонецЕсли;	
			МеталлДопПробы = ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(СтрДопМатериал.МатериалМеталл);
			Если СтруктураМеталла.Металл = МеталлДопПробы И СтрДопМатериал.МатериалПроба*100 = СтруктураПартии.Проба Тогда
				Продолжить;	
			ИначеЕсли СтруктураМеталла.Металл = МеталлДопПробы Тогда
				СтруктураМеталла.ВесМеталлаВЧистоте = СтруктураМеталла.ВесМеталлаВЧистоте + ТекВесМеталлаВЧистоте*100000;
			Иначе	
				СтруктураДопМеталла = ТаблицаДополнительныхПроб.Добавить();
				СтруктураДопМеталла.Металл = МеталлДопПробы;				
				СтруктураДопМеталла.ВесМеталлаВЧистоте = ТекВесМеталлаВЧистоте*100000;
				СтруктураДопМеталла.Проба = СтрДопМатериал.МатериалПроба;
			КонецЕсли;
		КонецЦикла;	
		Если ТаблицаДополнительныхПроб.Количество() > 0 Тогда
			ТаблицаДополнительныхПроб.Свернуть("Металл,Проба", "ВесМеталлаВЧистоте");
			Для Каждого СтрокаДопПробы Из ТаблицаДополнительныхПроб Цикл
				СтруктураДопМеталла = Новый Структура;
				СтруктураДопМеталла.Вставить("Металл", СтрокаДопПробы.Металл);				
				СтруктураДопМеталла.Вставить("ВесМеталлаВЧистоте",  СтрокаДопПробы.ВесМеталлаВЧистоте);
				СтруктураДопМеталла.Вставить("Проба", СтрокаДопПробы.Проба*100);
				СтруктураДопМеталла.Вставить("ПробаПодтвержденная", СтрокаДопПробы.Проба*100);
				МассивСплавов.Добавить(СтруктураДопМеталла);	
			КонецЦикла;	
		КонецЕсли;
		
		СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);
		СтруктураСтроки.Вставить("СведенияОПродукции",  СтруктураПартии);
	Иначе
		СтруктураСтроки.Вставить("Количество", 0);
		СтруктураСтроки.Вставить("ТипПартии", "METAL");
		СтруктураСтроки.Вставить("ВидПартии", "SCRAP_METAL");
		СтруктураСтроки.Вставить("ЭтапОбработки", "DOMESTIC_TURNOVER");
		СтруктураСтроки.Вставить("СтадияОбработки", "STORED");
		СтруктураСтроки.Вставить("ОКПД2", ДанныеШапкиДокументов.ОКПД2);
				
		СтруктураСтроки.Вставить("Вес", ДанныеШапкиДокументов.Вес * ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса());
		СтруктураСтроки.Вставить("ЕдиницаИзмерения", "GRM");
		
		СтруктураПартии = Новый Структура;
		СтруктураПартии.Вставить("ВидОсновногоМеталла", ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(ДанныеШапкиДокументов.Металл));
		Если СтруктураПартии.ВидОсновногоМеталла = "No" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не определен вид металла для серии " + ДанныеШапкиДокументов.НаименованиеСерии);
		КонецЕсли;
		СтруктураПартии.Вставить("Металл", СтруктураПартии.ВидОсновногоМеталла);
		СтруктураПартии.Вставить("Проба", ДанныеШапкиДокументов.Проба*100);
		Если СтруктураПартии.Проба = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена проба для серии " + ДанныеШапкиДокументов.НаименованиеСерии);
		КонецЕсли;
		
		СтруктураПартии.Вставить("ПробаПодтвержденная", СтруктураПартии.Проба);
		МассивСплавов = Новый Массив;
		СтруктураМеталла = Новый Структура;
		СтруктураМеталла.Вставить("Металл", СтруктураПартии.ВидОсновногоМеталла);
		//ВесМеталлаВЧистоте = Окр(ДанныеШапкиДокументов.Вес * ДанныеШапкиДокументов.Проба / 999.9, 3);
		СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", ДанныеШапкиДокументов.ВесМеталлаВЧистоте * ИнтеграцияГИИСДМДК.КоэффициентВеса());
		СтруктураМеталла.Вставить("Проба", ДанныеШапкиДокументов.Проба*100);
		СтруктураМеталла.Вставить("ПробаПодтвержденная", ДанныеШапкиДокументов.Проба*100);
		МассивСплавов.Добавить(СтруктураМеталла);
		
		ТаблицаДополнительныхПроб.Очистить();
		Для Каждого СтрДопМатериал Из ДанныеПоДопПробе Цикл
			Если Не ЗначениеЗаполнено(СтрДопМатериал.МатериалМеталл) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрДопМатериал.Вес = 0 
				или СтрДопМатериал.МатериалМеталл.НеДрагоценныйМеталл  Тогда
				Продолжить;
			КонецЕсли;	
			Если СтрДопМатериал.МатериалМеталл.ПробаЧистоты = 0 Тогда
				ТекВесМеталлаВЧистоте = 0;
			Иначе	
				ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
				* СтрДопМатериал.МатериалПроба/СтрДопМатериал.МатериалМеталл.ПробаЧистоты, 3);
			КонецЕсли;
			Если ТекВесМеталлаВЧистоте = 0 Тогда
				Продолжить;
			КонецЕсли;	
			МеталлДопПробы = ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(СтрДопМатериал.МатериалМеталл);
			Если СтруктураМеталла.Металл = МеталлДопПробы И СтрДопМатериал.МатериалПроба*100 = СтруктураПартии.Проба Тогда
				Продолжить;	
			ИначеЕсли СтруктураМеталла.Металл = МеталлДопПробы Тогда
				СтруктураМеталла.ВесМеталлаВЧистоте = СтруктураМеталла.ВесМеталлаВЧистоте + ТекВесМеталлаВЧистоте*100000;
			Иначе	
				СтруктураДопМеталла = ТаблицаДополнительныхПроб.Добавить();
				СтруктураДопМеталла.Металл = МеталлДопПробы;				
				СтруктураДопМеталла.ВесМеталлаВЧистоте = ТекВесМеталлаВЧистоте*100000;
				СтруктураДопМеталла.Проба = СтрДопМатериал.МатериалПроба;
			КонецЕсли;
		КонецЦикла;	
		Если ТаблицаДополнительныхПроб.Количество() > 0 Тогда
			ТаблицаДополнительныхПроб.Свернуть("Металл,Проба", "ВесМеталлаВЧистоте");
			Для Каждого СтрокаДопПробы Из ТаблицаДополнительныхПроб Цикл
				СтруктураДопМеталла = Новый Структура;
				СтруктураДопМеталла.Вставить("Металл", СтрокаДопПробы.Металл);				
				СтруктураДопМеталла.Вставить("ВесМеталлаВЧистоте",  СтрокаДопПробы.ВесМеталлаВЧистоте);
				СтруктураДопМеталла.Вставить("Проба", СтрокаДопПробы.Проба*100);
				СтруктураДопМеталла.Вставить("ПробаПодтвержденная", СтрокаДопПробы.Проба*100);
				МассивСплавов.Добавить(СтруктураДопМеталла);	
			КонецЦикла;	
		КонецЕсли;
		
		СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);
		СтруктураСтроки.Вставить("СведенияОМеталле",  СтруктураПартии);
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СсылкаНаДокумент", ДанныеШапкиДокументов.Ссылка);
	ЕстьСтрокиДокумента = ДанныеПоТоварам.НайтиСтроки(СтруктураПоиска);
	МассивРодительскихПартий = Новый Массив;
	ВесМеталлаВЧистоте = 0;
	Для Каждого Стр Из ЕстьСтрокиДокумента Цикл
		СтруктураПартии = Новый Структура;	
		СтруктураПартии.Вставить("НомерСтроки", Стр.НомерСтроки);
		СтруктураПартии.Вставить("УИН", Стр.УИН);
		Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом
			Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни
			Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
			СтруктураПартии.Вставить("Количество", ДанныеШапкиДокументов.Количество);
			ТекВес = ДанныеШапкиДокументов.Вес;
			ТекВесВЧистоте = ДанныеШапкиДокументов.ВесМеталлаВЧистоте;
		Иначе
			СтруктураПартии.Вставить("Количество", Стр.Количество);
			ТекВес = Стр.Вес;
			ТекВесВЧистоте = Стр.ВесМеталлаВЧистоте;
		КонецЕсли;	
		Если ДанныеШапкиДокументов.ТипПартии = "GEMSTONE" и Стр.УчетВКаратах Тогда
			СтруктураПартии.Вставить("Вес", Окр(ТекВес / 5, 5) * ИнтеграцияГИИСДМДК.КоэффициентВеса());
		Иначе	
			СтруктураПартии.Вставить("Вес", ТекВес * ИнтеграцияГИИСДМДК.КоэффициентВеса());
			МассивСплавов = Новый Массив;
			СтруктураМеталла = Новый Структура;
			СтруктураМеталла.Вставить("Металл", ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(Стр.Металл));
			//ВесМеталлаВЧистоте = ?(ТекВесВЧистоте = 0, Окр(ТекВес * Стр.Проба / 999.9, 3), ТекВесВЧистоте);
			СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", ТекВесВЧистоте * ИнтеграцияГИИСДМДК.КоэффициентВеса());
			СтруктураМеталла.Вставить("Проба", Стр.Проба*100);
			СтруктураМеталла.Вставить("ПробаПодтвержденная", Стр.Проба*100);
			МассивСплавов.Добавить(СтруктураМеталла);
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("НомерСтроки", Стр.НомерСтроки);
			ЕстьСтрокиСХарактеристикой = ДанныеПоДопПробе.НайтиСтроки(СтруктураПоиска);
			ТаблицаДополнительныхПроб.Очистить();
			Для Каждого СтрДопМатериал Из ЕстьСтрокиСХарактеристикой Цикл
				Если Не ЗначениеЗаполнено(СтрДопМатериал.МатериалМеталл) Тогда
					Продолжить;
				КонецЕсли;
				Если СтрДопМатериал.Вес = 0 
					или СтрДопМатериал.МатериалМеталл.НеДрагоценныйМеталл  Тогда
					Продолжить;
				КонецЕсли;	
				Если СтрДопМатериал.МатериалМеталл.ПробаЧистоты = 0 Тогда
					ТекВесМеталлаВЧистоте = 0;
				Иначе	
					ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
					* СтрДопМатериал.МатериалПроба/СтрДопМатериал.МатериалМеталл.ПробаЧистоты, 3);
				КонецЕсли;
				Если ТекВесМеталлаВЧистоте = 0 Тогда
					Продолжить;
				КонецЕсли;	
				МеталлДопПробы = ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(СтрДопМатериал.МатериалМеталл);
				Если СтруктураМеталла.Металл = МеталлДопПробы Тогда
					СтруктураМеталла.ВесМеталлаВЧистоте = СтруктураМеталла.ВесМеталлаВЧистоте;// + ТекВесМеталлаВЧистоте*100000;
				Иначе	
					СтруктураДопМеталла = ТаблицаДополнительныхПроб.Добавить();
					СтруктураДопМеталла.Металл = МеталлДопПробы;				
					СтруктураДопМеталла.ВесМеталлаВЧистоте = ТекВесМеталлаВЧистоте*100000;
					СтруктураДопМеталла.Проба = СтрДопМатериал.МатериалПроба;
				КонецЕсли;
			КонецЦикла;
			ВесМеталлаВЧистоте = ВесМеталлаВЧистоте + ТекВесВЧистоте;
			Если ТаблицаДополнительныхПроб.Количество() > 0 Тогда
				ТаблицаДополнительныхПроб.Свернуть("Металл,Проба", "ВесМеталлаВЧистоте");
				Для Каждого СтрокаДопПробы Из ТаблицаДополнительныхПроб Цикл
					СтруктураДопМеталла = Новый Структура;
					СтруктураДопМеталла.Вставить("Металл", СтрокаДопПробы.Металл);				
					СтруктураДопМеталла.Вставить("ВесМеталлаВЧистоте",  СтрокаДопПробы.ВесМеталлаВЧистоте);
					СтруктураДопМеталла.Вставить("Проба", СтрокаДопПробы.Проба*100);
					СтруктураДопМеталла.Вставить("ПробаПодтвержденная", СтрокаДопПробы.Проба*100);
					МассивСплавов.Добавить(СтруктураДопМеталла);	
				КонецЦикла;	
			КонецЕсли;
			
			СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);
		КонецЕсли;
		Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни
			Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни Тогда
			Если Объект.РучноеИзменениеМассыСырья Тогда
				Если Стр.УчетВКаратах Тогда
					СтруктураПартии.Вставить("МассаСырья", Окр(ТекВесВЧистоте / 5, 5) * ИнтеграцияГИИСДМДК.КоэффициентВеса());
				Иначе
					СтруктураПартии.Вставить("МассаСырья", ТекВесВЧистоте * ИнтеграцияГИИСДМДК.КоэффициентВеса());
				КонецЕсли;	
			Иначе	
				СтруктураПартии.Вставить("МассаСырья", СтруктураПартии.Вес);
			КонецЕсли;
		КонецЕсли;
		МассивРодительскихПартий.Добавить(СтруктураПартии);				   
	КонецЦикла;
	СтруктураСтроки.Вставить("МассивРодительскихПартий", МассивРодительскихПартий);
	Если СтруктураСтроки.Свойство("СведенияОМеталле") Тогда
		СтруктураСтроки.СведенияОМеталле.СведенияОСплаве[0].ВесМеталлаВЧистоте = ВесМеталлаВЧистоте*100000;
	КонецЕсли;
	МассивТоваров.Добавить(СтруктураСтроки);
	
	Спецификация.Вставить("МассивТоваров", МассивТоваров);

	Возврат Спецификация;
	
КонецФункции

&НаСервере
Функция ДанныеЗаполненыКорректно()
	НетОшибок = Истина;
	//Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие")
	//	Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие") Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Для данного вида операции отправка данных не возможна");
	//	НетОшибок = Ложь;
	//	Возврат НетОшибок;
	//КонецЕсли;	
	//Если Объект.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Данные в ГИИС ДМДК уже успешно отправлены");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.Комплект) Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен комплект");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.СерияНоменклатурыКомплекта) Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена серия комплекта");
	//	НетОшибок = Ложь;	
	//ИначеЕсли ПустаяСтрока(Объект.СерияНоменклатурыКомплекта.УИН) 
	//	И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом")
	//	Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни")
	//	Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие")) Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен УИН в серии комплекта");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Объект.ВесКомплекта = 0 Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес комплекта");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Объект.КоличествоКомплекта = 0 
	//	И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")
	//	Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни")
	//	Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие")
	//	Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие")) Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнено количество комплекта");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена табличная часть ""Товары""");
		НетОшибок = Ложь;	
	КонецЕсли;
	
	Для Каждого Стр Из Объект.Товары Цикл
		Если Не ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена номенклатура");
			НетОшибок = Ложь;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Стр.СерияНоменклатуры) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена серия");
			НетОшибок = Ложь;
		ИначеЕсли ПустаяСтрока(Стр.СерияНоменклатуры.УИН)
			И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом")
				Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")
				Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом")
				Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие")) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен УИН в серии");
			НетОшибок = Ложь;	
		КонецЕсли;
		Если Стр.Вес = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес");
			НетОшибок = Ложь;	
		КонецЕсли;
		Если Стр.Количество = 0 
			И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни")
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие")
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие")) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнено количество");
			НетОшибок = Ложь;	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат НетОшибок;
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьИНППреобразованияВЛом(ТекСтрТовары, ТекУИН, НомерСтроки, ДополнительныеПараметры)
	
	ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
	ТекСтрТовары.ИНППреобразованияВЛом = "";
	ТекСтрТовары.ОписаниеОшибки = "";
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИНП", ТекУИН);
	ЕстьСтроки = Объект.Металл.НайтиСтроки(СтруктураОтбора);
	Если ЕстьСтроки.Количество() = 0 Тогда
		ТекСтрМеталл = Объект.Металл.Добавить();
		ТекСтрМеталл.ИНП = ТекУИН;
		ТекСтрМеталл.ИНПИзделия = ТекСтрТовары.ИНП;
	КонецЕсли;
	//НомерСледующегоПакета = ДополнительныеПараметры.НомерПакета + 1;
	//ТекПакет = ДополнительныеПараметры.Пакеты.Получить(НомерСледующегоПакета);
	//Пока ТекПакет <> Неопределено Цикл
	//	Если ТекПакет.ИмяМетода = "SendBatchUnion" Тогда
	//		Для Каждого ТекСтрРодительскойПартии Из ТекПакет.Спецификации.МассивТоваров[0].МассивРодительскихПартий Цикл
	//			Если ТекСтрРодительскойПартии.НомерСтроки = Число(НомерСтроки) Тогда
	//				Если ЗначениеЗаполнено(ТекСтрРодительскойПартии.УИН) Тогда
	//					НоваяРодительскаяПартия = ТекПакет.Спецификации.МассивТоваров[0].МассивРодительскихПартий.Добавить();
	//					НоваяРодительскаяПартия.НомерСтроки = ТекСтрРодительскойПартии.НомерСтроки;
	//					//НоваяРодительскаяПартия.Количество = Стр.Количество;
	//					//прервать!!!
	//					НоваяРодительскаяПартия.УИН = ТекУИН;
	//				Иначе	
	//					ТекСтрРодительскойПартии.УИН = ТекУИН;
	//				КонецЕсли;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;	
	//	КонецЕсли;
	//	НомерСледующегоПакета = НомерСледующегоПакета + 1;
	//	ТекПакет = ДополнительныеПараметры.Пакеты.Получить(НомерСледующегоПакета);
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНовыйСтатусНаСервере(Данные, НовыйСтатус, ДополнительныеПараметры)
	
	НомерСтроки = ДополнительныеПараметры.НомераСтрок;
	ИмяМетода = "";
	Если ТипЗнч(НомерСтроки) = Тип("Структура") Тогда
		Если НомерСтроки.Свойство("ИмяМетода") Тогда
			ИмяМетода = НомерСтроки.ИмяМетода;
		КонецЕсли;
	КонецЕсли;	
	ЕстьОшибки = Ложь;
	
	Если Данные.Количество() = 0 Тогда
		Возврат ЕстьОшибки;	
	КонецЕсли;
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Если Данные.Свойство("Ошибка") и Данные.Ошибка = ""	Тогда
			Возврат ЕстьОшибки;
		КонецЕсли;	
	КонецЕсли;
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	ОбработанныйПакет = ДополнительныеПараметры.Пакеты.Получить(ДополнительныеПараметры.НомерПакета);
	Для Каждого ТекУИН Из Данные Цикл
		Если НовыйСтатус = "Ошибка" 
			И ((ТекУИН.Свойство("Ошибка") и ТекУИН.Ошибка = "")
			Или (ТекУИН.Свойство("Значение") и ТекУИН.Значение = "")) Тогда
			Продолжить;
		КонецЕсли;	
		Если ОбработанныйПакет.ИмяМетода = "SendBatchConvert" 
			Или ОбработанныйПакет.ИмяМетода = "CheckBatchConvert" Тогда
			Если НовыйСтатус = "Успех" Тогда
				ТекСтрТовары = Объект.Товары[Число(ТекУИН.НомерСтроки) - 1];
			Иначе
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
				ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
				Если ЕстьСтроки.Количество() > 0 Тогда
					ТекСтрТовары = ЕстьСтроки[0];
				КонецЕсли;	
			КонецЕсли;
			
			Если НовыйСтатус = "Успех" Тогда
				Если ТипЗнч(ТекУИН.УИН) = Тип("Массив") Тогда
					Если ТекУИН.УИН.Количество() > 1 Тогда
						Для Каждого ТекУИНИзМассива Из ТекУИН.УИН Цикл
							ЗаполнитьИНППреобразованияВЛом(ТекСтрТовары, ТекУИНИзМассива, ТекУИН.НомерСтроки, ДополнительныеПараметры);	
						КонецЦикла;	
						ИНППреобразованияВЛом = "";
					Иначе
						ИНППреобразованияВЛом = ТекУИН.УИН[0];
					КонецЕсли;	
				Иначе
					ИНППреобразованияВЛом = ТекУИН.УИН;
				КонецЕсли;	
				ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
				ТекСтрТовары.ИНППреобразованияВЛом = ИНППреобразованияВЛом;
				ТекСтрТовары.ОписаниеОшибки = "";
				НомерСледующегоПакета = ДополнительныеПараметры.НомерПакета + 1;
				ТекПакет = ДополнительныеПараметры.Пакеты.Получить(НомерСледующегоПакета);
				Пока ТекПакет <> Неопределено Цикл
					Если ТекПакет.ИмяМетода = "SendBatchUnion" И ИНППреобразованияВЛом <> "" Тогда
						Для Каждого ТекСтрРодительскойПартии Из ТекПакет.Спецификации.МассивТоваров[0].МассивРодительскихПартий Цикл
							Если ТекСтрРодительскойПартии.НомерСтроки = Число(ТекУИН.НомерСтроки) Тогда
								ТекСтрРодительскойПартии.УИН = ТекУИН.УИН;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					ИначеЕсли ТекПакет.ИмяМетода = "SendBatchUnion" И ИНППреобразованияВЛом = "" Тогда	
						ДополнительныеПараметры.Пакеты.Удалить(НомерСледующегоПакета);
					КонецЕсли;
					НомерСледующегоПакета = НомерСледующегоПакета + 1;
					ТекПакет = ДополнительныеПараметры.Пакеты.Получить(НомерСледующегоПакета);
				КонецЦикла;
				Если ТекУИН.Свойство("Камни") Тогда
					Для Каждого КаменьУИН Из ТекУИН.Камни.УИН Цикл
						СтруктураПоиска = Новый Структура;
						СтруктураПоиска.Вставить("ИНП", КаменьУИН);
						ЕстьКамни = Объект.Камни.НайтиСтроки(СтруктураПоиска);
						Если ЕстьКамни.Количество() = 0 Тогда
							НовСтрКамень = Объект.Камни.Добавить();	
							НовСтрКамень.ИНП = КаменьУИН;
						КонецЕсли;
					КонецЦикла;
					Если Объект.Камни.Количество() > 0 Или Объект.Металл.Количество() > 0 Тогда
						Элементы.ГруппаМеталлыКамни.Показать();
					КонецЕсли;
					ВсегоПакетов = ДополнительныеПараметры.Пакеты.Количество();
					Если ДополнительныеПараметры.Пакеты.Получить(ВсегоПакетов) <> Неопределено Тогда
						ВсегоПакетов = ВсегоПакетов + 1;						
					КонецЕсли;	
					ПолучитьДанныеПоКамнямДляЗапроса(ДополнительныеПараметры.Пакеты, ВсегоПакетов);
				КонецЕсли;	
			ИначеЕсли НовыйСтатус = "Ошибка" Тогда
				ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
				ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
				ЕстьОшибки = Истина;	
			КонецЕсли;
			ТекСтрТовары.ИмяМетода = ОбработанныйПакет.ИмяМетода;
			НомерСтроки = 0;
		ИначеЕсли (ОбработанныйПакет.ИмяМетода = "SendGetBatch"
			Или ОбработанныйПакет.ИмяМетода = "CheckGetBatch") И ОбработанныйПакет.Свойство("ИмяТабЧасти") Тогда
			Если ТекУИН.Свойство("ДанныеОКамне") И ОбработанныйПакет.ИмяТабЧасти = "Камни" Тогда
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
				ЕстьСтроки = Объект.Камни.НайтиСтроки(СтруктураОтбора);
				Если ЕстьСтроки.Количество() > 0 Тогда
					ТекСтрТовары = ЕстьСтроки[0];
				КонецЕсли;
				Если НовыйСтатус = "Успех" Тогда
					Если ТекУИН.ДанныеОКамне.КлассификационныйКод = "" Тогда
						ДанныеРазбораКода = Неопределено;//ИнтеграцияГИИСДМДКЮТДСервер.РазобратьДанныеОКамне(ТекУИН.ДанныеОКамне);
					Иначе	
						ДанныеРазбораКода = ИнтеграцияГИИСДМДКЮТДСервер.РазобратьКлассификационныйКодПартииКамней(ТекУИН.ДанныеОКамне.КлассификационныйКод);
					КонецЕсли;
					Если ДанныеРазбораКода <> Неопределено
						И ТипЗнч(ДанныеРазбораКода) = Тип("Структура") Тогда
						
						Если ДанныеРазбораКода.Свойство("ВидКамня") Тогда
							
							ТекСтрТовары.Камень = ДанныеРазбораКода.ВидКамня;
							
						КонецЕсли;
						
						Если ДанныеРазбораКода.Свойство("ГруппаКодированияГИИСДМДК") Тогда
							
							ТекСтрТовары.ГруппаКодированияГИИСДМДК = ДанныеРазбораКода.ГруппаКодированияГИИСДМДК;
							
						КонецЕсли;
						
						Если ДанныеРазбораКода.Свойство("ХарактеристикиГИИСДМДК") Тогда
							
							Для Каждого ТекХарактеристика Из ДанныеРазбораКода.ХарактеристикиГИИСДМДК Цикл
								Если ТекХарактеристика.ИмяЭлементаКодирования = "ТипКамня" Тогда
									ТекСтрТовары.ТипКамняГИИСДМДК = ТекХарактеристика.ЗначениеКлассификатораГИИСДМДК;
								ИначеЕсли ТекХарактеристика.ИмяЭлементаКодирования = "ФормаОгранки" Тогда
									ТекСтрТовары.ФормаОгранкиГИИСДМДК = ТекХарактеристика.ЗначениеКлассификатораГИИСДМДК;
									ТекСтрТовары.ФормаОгранки = ТекХарактеристика.ЗначениеДанных;
								ИначеЕсли ТекХарактеристика.ИмяЭлементаКодирования = "ГруппаЧистоты" Тогда
									ТекСтрТовары.ГруппаЧистотыГИИСДМДК = ТекХарактеристика.ЗначениеКлассификатораГИИСДМДК;
									ТекСтрТовары.ГруппаЧистоты = ТекХарактеристика.ЗначениеДанных;
								ИначеЕсли ТекХарактеристика.ИмяЭлементаКодирования = "ГруппаЦвета" Тогда
									ТекСтрТовары.ГруппаЦветаГИИСДМДК = ТекХарактеристика.ЗначениеКлассификатораГИИСДМДК;
									ТекСтрТовары.ГруппаЦвета = ТекХарактеристика.ЗначениеДанных;	
								КонецЕсли;	
							КонецЦикла;	
							
						КонецЕсли;
					КонецЕсли;
					ТекСтрТовары.Количество = ТекУИН.Количество;
					ТекСтрТовары.Вес = ТекУИН.Вес*5/ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса();
				Иначе
					ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
					ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
					ЕстьОшибки = Истина;
				КонецЕсли;
			ИначеЕсли ОбработанныйПакет.ИмяТабЧасти	= "Металл" Тогда
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
				ЕстьСтроки = Объект.Металл.НайтиСтроки(СтруктураОтбора);
				Если ЕстьСтроки.Количество() > 0 Тогда
					ТекСтрТовары = ЕстьСтроки[0];
				КонецЕсли;
				Если НовыйСтатус = "Успех" Тогда
					Проба = ОписаниеТипаЧисло.ПривестиЗначение(ТекУИН.ДанныеОМеталле.Проба);
					ТекСтрТовары.ТипМеталла = ИнтеграцияГИИСДМДКЮТДСервер.ТипМеталлаКонфигурации(ТекУИН.ДанныеОМеталле.Металл);
					ТекСтрТовары.Проба = Проба / ИнтеграцияГИИСДМДК.КоэффициентПробы();
					ТекСтрТовары.Вес = ТекУИН.Вес/ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса();
					ТекСтрТовары.ВесВЧистоте = ТекУИН.ДанныеОМеталле.ОписаниеМеталла[0].Вес/ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса();
				Иначе
					ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
					ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
					ЕстьОшибки = Истина;
				КонецЕсли;
			КонецЕсли;
	
		ИначеЕсли ОбработанныйПакет.ИмяМетода = "SendGetBatch" Или ОбработанныйПакет.ИмяМетода = "CheckGetBatch" Тогда
			Если ТекУИН.Свойство("ДанныеОМеталле") и ТекУИН.ДанныеОМеталле.Свойство("ОписаниеМеталла") Тогда
				ТекВесКомплектаВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
				Если ТекВесКомплектаВХимЧистоте > 0 Тогда					
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
					ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
					Если ЕстьСтроки.Количество() > 0 Тогда
						ТекСтрТовары = ЕстьСтроки[0];
						ТекСтрТовары.ВесВХимЧистотеГИИСДМДК = ТекВесКомплектаВХимЧистоте;
						ТекСтрТовары.ИмяМетода = ОбработанныйПакет.ИмяМетода;
					Иначе
						Объект.ВесКомплектаВХимЧистоте = ТекВесКомплектаВХимЧистоте;
						Объект.ИмяМетода = ОбработанныйПакет.ИмяМетода;
					КонецЕсли;
					НомерСледующегоПакета = ДополнительныеПараметры.НомерПакета + 1;
					ТекПакет = ДополнительныеПараметры.Пакеты.Получить(НомерСледующегоПакета);
					Пока ТекПакет <> Неопределено Цикл
						Если ТекПакет.ИмяМетода = "SendBatchUnion" Тогда
							Для Каждого ТекСтрРодительскойПартии Из ТекПакет.Спецификации.МассивТоваров[0].МассивРодительскихПартий Цикл
								Если ТекСтрРодительскойПартии.УИН = Число(ТекУИН.УИН) Тогда
									ТекСтрРодительскойПартии.СведенияОСплаве[0].ВесМеталлаВЧистоте = ТекВесКомплектаВХимЧистоте;
									Прервать;
								КонецЕсли;
							КонецЦикла;	
						КонецЕсли;
						НомерСледующегоПакета = НомерСледующегоПакета + 1;
						ТекПакет = ДополнительныеПараметры.Пакеты.Получить(НомерСледующегоПакета);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;		
		ИначеЕсли ОбработанныйПакет.ИмяМетода = "SendGetBatchHierarchy" 
			Или ОбработанныйПакет.ИмяМетода = "CheckGetBatchHierarchy" Тогда
			Если ТекУИН.Свойство("ДанныеОМеталле") и ТекУИН.ДанныеОМеталле.Свойство("ОписаниеМеталла") Тогда
				ТекВесКомплектаВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
				Если ТекВесКомплектаВХимЧистоте > 0 Тогда
					Объект.ВесКомплектаВХимЧистоте = ТекВесКомплектаВХимЧистоте;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ОбработанныйПакет.ИмяМетода = "SendReserveBatchUic" 
			Или ОбработанныйПакет.ИмяМетода = "CheckReserveBatchUic" Тогда
			Если НовыйСтатус = "Успех" Тогда
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
				Объект.ОписаниеОшибки = "";
				Объект.ИНПЗарезирвированное = ТекУИН;
			Иначе	
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
				Объект.ОписаниеОшибки = ТекУИН.Ошибка;
			КонецЕсли;	
			Объект.ИмяМетода = ОбработанныйПакет.ИмяМетода;
		ИначеЕсли ОбработанныйПакет.ИмяМетода = "SendBatchCompleteset" 
			Или ОбработанныйПакет.ИмяМетода = "CheckBatchCompleteset" Тогда
			Если НовыйСтатус = "Успех" Тогда				
				Объект.ИНП = ?(ЗначениеЗаполнено(Объект.ИНПЗарезирвированное), Объект.ИНПЗарезирвированное, Объект.ИНП);
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
				Объект.ОписаниеОшибки = "";
			Иначе
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
				Объект.ОписаниеОшибки = ТекУИН.Ошибка;
			КонецЕсли;
			Объект.ИмяМетода = ОбработанныйПакет.ИмяМетода;
		ИначеЕсли (ТипЗнч(НомерСтроки) = Тип("Структура") И НомерСтроки.ИдентификаторЗапроса = Объект.ИдентификаторЗапроса)
			Или НомерСтроки = 0 Или Объект.ИдентификаторЗапроса = НомерСтроки Тогда
			Если НовыйСтатус = "Успех" Тогда
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
				Объект.ОписаниеОшибки = "";
				Объект.ИНП = ТекУИН.УИН;
				СерияОбъект = Объект.СерияНоменклатурыКомплекта.ПолучитьОбъект();
				СерияОбъект.УИН = Объект.ИНП;
				СерияОбъект.Записать();
			ИначеЕсли НовыйСтатус = "Ошибка" Тогда
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
				Объект.ОписаниеОшибки = ТекУИН.Ошибка;
				ЕстьОшибки = Истина;
			КонецЕсли;
			Объект.ИмяМетода = ОбработанныйПакет.ИмяМетода;
		Иначе	
			СтруктураОтбора = Новый Структура;
			Если ТипЗнч(НомерСтроки) = Тип("Структура") Тогда
				СтруктураОтбора.Вставить("ИдентификаторЗапроса", НомерСтроки.ИдентификаторЗапроса);
			Иначе	
				СтруктураОтбора.Вставить("НомерСтроки", НомерСтроки);
			КонецЕсли;
			ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
			Если ЕстьСтроки.Количество() > 0 Тогда
				ТекСтрТовары = ЕстьСтроки[0];
				Если НовыйСтатус = "Успех" Тогда
					ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");	
					ТекСтрТовары.ИНП = ТекУИН.УИН;
					СерияОбъект = ТекСтрТовары.СерияНоменклатуры.ПолучитьОбъект();
					СерияОбъект.УИН = ТекСтрТовары.ИНП;
					СерияОбъект.Записать();
					ТекСтрТовары.ОписаниеОшибки = "";
				ИначеЕсли НовыйСтатус = "Ошибка" Тогда
					ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
					ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
					ЕстьОшибки = Истина;
				КонецЕсли;
				ТекСтрТовары.ИмяМетода = ОбработанныйПакет.ИмяМетода;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(ПараметрыЗаписи);
		
	Если ЕстьОшибки = Ложь Тогда
		Если НомерСтроки = 0 Тогда
			Элементы.ГруппаДокументСтатус.Видимость = Истина;
			ЭтаФорма.ТолькоПросмотр = Истина;
		Иначе	
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("СтатусЗапроса", ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех"));
			Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие
				Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни
				Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом
				Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
				СтруктураОтбора.Вставить("ИмяМетода", "SendBatchUnion");
			КонецЕСли;	
			ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);	
			Если ЕстьСтроки.Количество() = Объект.Товары.Количество() Тогда	
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
				ПараметрыЗаписи = Новый Структура;
				ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
				Записать(ПараметрыЗаписи);
				ЭтаФорма.ТолькоПросмотр = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция ЗаписатьВесВХимЧистотеНаСервере(Данные, НовыйСтатус, НомерСтроки)
	
	ЕстьОшибки = Ложь;
	
	Если Данные.Количество() = 0 Тогда
		Возврат ЕстьОшибки;	
	КонецЕсли;	
	
	Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("Ошибка") и Данные.Ошибка = "" Тогда
		Возврат ЕстьОшибки;
	КонецЕсли;	
	Для Каждого ТекУИН Из Данные Цикл
		СтруктураОтбора = Новый Структура;
		Если ТипЗнч(НомерСтроки) = Тип("Структура") Тогда
			Если Объект.ИдентификаторЗапроса = НомерСтроки.ИдентификаторЗапроса Тогда
				ТекВесКомплектаВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
				Если ТекВесКомплектаВХимЧистоте > 0 Тогда
					Объект.ВесКомплектаВХимЧистоте = ТекВесКомплектаВХимЧистоте;
				КонецЕсли;
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");	
				Объект.ОписаниеОшибки = "";
				Объект.ИдентификаторЗапроса = "";
				Продолжить;
			Иначе	
				СтруктураОтбора.Вставить("ИдентификаторЗапроса", НомерСтроки.ИдентификаторЗапроса);
				ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
				Если ЕстьСтроки.Количество() > 0 Тогда
					ТекСтрТовары = ЕстьСтроки[0];
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НомерСтроки = 0 
			Или (ТипЗнч(НомерСтроки) = Тип("Массив") И НомерСтроки.Количество() = 1 И НомерСтроки[0] = 0) Тогда
			ТекВесКомплектаВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
			Если ТекВесКомплектаВХимЧистоте > 0 Тогда
				Объект.ВесКомплектаВХимЧистоте = ТекВесКомплектаВХимЧистоте;
			КонецЕсли;
			Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");	
			Объект.ОписаниеОшибки = "";
			Объект.ИдентификаторЗапроса = "";
			Продолжить;
		Иначе	
			ТекСтрТовары = Объект.Товары[НомерСтроки[0]-1];
			СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
		КонецЕсли;
		
		Если НовыйСтатус = "Успех" Тогда
			ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");	
			ТекСтрТовары.ОписаниеОшибки = "";
			ТекВесКомплектаВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
			Если ТекВесКомплектаВХимЧистоте > 0 Тогда
				ТекСтрТовары.ВесВХимЧистотеГИИСДМДК = ТекВесКомплектаВХимЧистоте;
			КонецЕсли;
			ТекСтрТовары.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаЗапросПолученияСведенийОПартиях();
			Если ТекСтрТовары.ВесВХимЧистотеГИИСДМДК = 0 Тогда
				ТекУИН = ?(ТекСтрТовары.ИНППреобразованияВЛом = "", ТекСтрТовары.ИНП, ТекСтрТовары.ИНППреобразованияВЛом);
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("По УИН: " + ТекУИН + " не удалось получить вес в хим.чистоте");
			КонецЕсли;	
		ИначеЕсли НовыйСтатус = "Ошибка" Тогда
			ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
			ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки = Ложь Тогда
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
	КонецЕсли;	
	Возврат ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура НадписьПредупреждениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПродолжительностьСекунд = 600;
	ДатаНачалаСобытий = ОбщегоНазначенияКлиент.ДатаСеанса() - ПродолжительностьСекунд;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЗапускатьНеВФоне", Истина);
	ПараметрыОтбора.Вставить("Уровень", "Ошибка");
	ПараметрыОтбора.Вставить("Пользователь", ТекущийПользователь);
	ПараметрыОтбора.Вставить("ДатаНачала", ДатаНачалаСобытий);
	
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ПараметрыОтбора, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПредупреждения(Значение)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКартинкаИНадписьПредупреждение",
		"Видимость", Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВесВХимЧистотеГИИСДМДК(Данные, НовыйСтатус, НомерСтроки)
	ЕстьОшибки = ЗаписатьВесВХимЧистотеНаСервере(Данные, НовыйСтатус, НомерСтроки);
	Если ЕстьОшибки Тогда
		УстановитьВидимостьПредупреждения(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНовыйСтатус(Данные, НовыйСтатус, ДополнительныеПараметры)
	ЕстьОшибки = ЗаписатьНовыйСтатусНаСервере(Данные, НовыйСтатус, ДополнительныеПараметры);
	Если ЕстьОшибки Тогда
		УстановитьВидимостьПредупреждения(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоОжидающимОтветаВСтроке(НомерСтроки, messageId, ИмяМетода)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("НомерСтроки", НомерСтроки);
	ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
	Если ЕстьСтроки.Количество() > 0 Тогда
		ТекСтр = ЕстьСтроки[0];
		ТекСтр.ИдентификаторЗапроса = messageId;
		ТекСтр.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета();
		ТекСтр.ОписаниеОшибки = "";
		ТекСтр.ИмяМетода = ИмяМетода;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоОжидающимОтвета(НомерСтроки, messageId, ДополнительныеПараметры)
	
	ИмяМетода = ДополнительныеПараметры.Пакеты[ДополнительныеПараметры.НомерПакета].ИмяМетода;
	
	ИмяМетодаРезультат = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияРезультата(ИмяМетода);
	ИмяМетода = ?(ИмяМетодаРезультат = "", ИмяМетода, ИмяМетодаРезультат);
	Если НомерСтроки = 0 
		Или (ТипЗнч(НомерСтроки) = Тип("Массив") И НомерСтроки.Количество() = 1 И НомерСтроки[0] = 0) Тогда
		Объект.ИдентификаторЗапроса = messageId;
		Объект.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета();
		Объект.ОписаниеОшибки = "";
		Объект.ИмяМетода = ИмяМетода;
		Элементы.ГруппаДокументСтатус.Видимость = Истина;
	Иначе	
		ОбработанныйПакет = ДополнительныеПараметры.Пакеты.Получить(ДополнительныеПараметры.НомерПакета);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИдентификаторЗапроса", messageId);
		Если (ОбработанныйПакет.ИмяМетода = "SendGetBatch"
			Или ОбработанныйПакет.ИмяМетода = "CheckGetBatch") И ОбработанныйПакет.Свойство("ИмяТабЧасти") Тогда
			ЕстьСтроки = Объект[ОбработанныйПакет.ИмяТабЧасти].НайтиСтроки(СтруктураОтбора);
		Иначе	
			ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
		КонецЕсли;
		Если ЕстьСтроки.Количество() = 0 Тогда
			
			Если ТипЗнч(НомерСтроки) = Тип("Массив") Тогда
				Для Каждого ТекСтр Из НомерСтроки Цикл
					ЗаполнитьИнформациюПоОжидающимОтветаВСтроке(ТекСтр, messageId, ИмяМетода);	
				КонецЦикла;	
			Иначе
				ЗаполнитьИнформациюПоОжидающимОтветаВСтроке(НомерСтроки, messageId, ИмяМетода);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(ПараметрыЗаписи);
		
	Если Не ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаКомплектацийВГИИСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успех = Истина Тогда
		
		ЗаписатьНовыйСтатус(Результат.Данные.Данные, "Успех", ДополнительныеПараметры);
		ЗаписатьНовыйСтатус(Результат.Данные.Ошибки, "Ошибка", ДополнительныеПараметры);
		
	ИначеЕсли Результат.Успех = Ложь Тогда
		
		УстановитьВидимостьПредупреждения(Истина);
		
		Если ЗначениеЗаполнено(Результат.messageId) Тогда
			ЗаполнитьИнформациюПоОжидающимОтвета(ДополнительныеПараметры.НомераСтрок, Результат.messageId, ДополнительныеПараметры);
		КонецЕсли;
			
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(ПараметрыЗаписи);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("СтатусЗапроса", ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех"));
	ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);				
				
	Если ДополнительныеПараметры.Свойство("НомерПакета") И Результат.Успех = Истина И Результат.Данные.Данные.Количество() > 0 Тогда
			
		ОтправитьИнформациюОКомплектации(ДополнительныеПараметры.Сертификат, ДополнительныеПараметры.Пакеты,
				ДополнительныеПараметры.НомерПакета + 1);
		
	Иначе
		
		ИдетОтправкаДанных = Ложь;
		
		ПараметрыЗаписи = Новый Структура;
    	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаПолучениеВесаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успех = Истина Тогда
		
		ЗаписатьВесВХимЧистотеГИИСДМДК(Результат.Данные.Данные, "Успех", ДополнительныеПараметры.НомераСтрок);
		ЗаписатьВесВХимЧистотеГИИСДМДК(Результат.Данные.Ошибки, "Ошибка", ДополнительныеПараметры.НомераСтрок);
		
	ИначеЕсли Результат.Успех = Ложь Тогда
		
		УстановитьВидимостьПредупреждения(Истина);
		
		Если ЗначениеЗаполнено(Результат.messageId) Тогда
			ЗаполнитьИнформациюПоОжидающимОтвета(ДополнительныеПараметры.НомераСтрок, Результат.messageId, ДополнительныеПараметры);
		КонецЕсли;
			
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(ПараметрыЗаписи);			
				
	Если ДополнительныеПараметры.Свойство("НомерПакета") Тогда
			
		ОтправитьЗапросНаПолучениеВеса(ДополнительныеПараметры.Сертификат, ДополнительныеПараметры.Пакеты,
				ДополнительныеПараметры.НомерПакета + 1);
		
	Иначе
		
		ИдетОтправкаДанных = Ложь;
		
		ПараметрыЗаписи = Новый Структура;
    	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьИнформациюОКомплектации(ВыбСертификат, Пакеты, НомерПакета = 1)
	ДанныеРегистрации = Пакеты.Получить(НомерПакета);
	
	Если ДанныеРегистрации = Неопределено Тогда
		
		ИдетОтправкаДанных = Ложь;
		
		ПараметрыЗаписи = Новый Структура;
    	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
		
		Возврат;
		
	КонецЕсли;
	
	Если ДанныеРегистрации.Свойство("ИдентификаторЗапроса") = Истина Тогда
		ДанныеОЗапросе = Новый Структура;
		ДанныеОЗапросе.Вставить("messageId", ДанныеРегистрации.ИдентификаторЗапроса);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("НомераСтрок", ДанныеРегистрации);
		ДополнительныеПараметры.Вставить("Пакеты", Пакеты);
		ДополнительныеПараметры.Вставить("НомерПакета", НомерПакета);
		ДополнительныеПараметры.Вставить("Сертификат", ВыбСертификат);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаКомплектацийВГИИСЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыВыполнения = ИнтеграцияГИИСДМДККлиент.ИнициализироватьПараметрыВыполнения();
		ПараметрыВыполнения.ИмяМетода = ДанныеРегистрации.ИмяМетода;
		ПараметрыВыполнения.ТребуетсяПодпись = Истина;
		ПараметрыВыполнения.Сертификат = ВыбСертификат;
		ПараметрыВыполнения.МетодПодписи = "БСП";
		ПараметрыВыполнения.ПолучатьРезультат = Ложь;
		ПараметрыВыполнения.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		ПараметрыВыполнения.КоличествоПопыток = КоличествоПопыток;
		ПараметрыВыполнения.ПодписьНаСервере = ПодписьНаСервере;
		ПараметрыВыполнения.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.Организация = Объект.Организация;
		
		НастройкиПоОрганизации.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		НастройкиПоОрганизации.КоличествоПопыток = КоличествоПопыток;
		НастройкиПоОрганизации.ПодписьНаСервере = ПодписьНаСервере;
		НастройкиПоОрганизации.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.НастройкиОбмена = НастройкиПоОрганизации;
		
		ИнтеграцияГИИСДМДККлиент.ВыполнитьМетодСервиса(ДанныеОЗапросе, ПараметрыВыполнения, ЭтотОбъект, ОписаниеОповещения);
		
	Иначе
		Если ДанныеРегистрации.Свойство("Спецификации") И Не ЗначениеЗаполнено(ДанныеРегистрации.Спецификации) Тогда
			ИдетОтправкаДанных = Ложь;
			Возврат;
		КонецЕсли;
		Если ДанныеРегистрации.Свойство("УИН") И Не ЗначениеЗаполнено(ДанныеРегистрации.УИН) Тогда
			ИдетОтправкаДанных = Ложь;
			Возврат;
		КонецЕсли;
			
		ДанныеДляОтправки = Новый Структура();
		Если ДанныеРегистрации.Свойство("Спецификации") Тогда
			Спецификации = Новый Массив;
			Спецификации.Добавить(ДанныеРегистрации.Спецификации);
			ДанныеДляОтправки.Вставить("Спецификации", Спецификации);
		ИначеЕсли ДанныеРегистрации.Свойство("КоличествоУИН") Тогда
			ДанныеДляОтправки.Вставить("КоличествоУИН", ДанныеРегистрации.КоличествоУИН);
		ИначеЕсли ДанныеРегистрации.ИмяМетода = "SendBatchCompleteset" Тогда
			Спецификации = Новый Массив;
			Спецификации.Добавить(ДанныеРегистрации);
			ДанныеДляОтправки.Вставить("Партии", Спецификации);
		Иначе
			ДанныеДляОтправки.Вставить("УИН", ДанныеРегистрации.УИН);
			Если ДанныеРегистрации.Свойство("ТипИерархии") Тогда
				ДанныеДляОтправки.Вставить("ТипИерархии", ДанныеРегистрации.ТипИерархии);
			КонецЕсли;
			Если ДанныеРегистрации.Свойство("page") Тогда
				ДанныеДляОтправки.Вставить("page", ДанныеРегистрации.page);
			КонецЕсли;
			Если ДанныеРегистрации.Свойство("size") Тогда
				ДанныеДляОтправки.Вставить("size", ДанныеРегистрации.size);
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("НомераСтрок", ДанныеРегистрации.НомераСтрокНеОтправлено);
		ДополнительныеПараметры.Вставить("Пакеты", Пакеты);
		ДополнительныеПараметры.Вставить("НомерПакета", НомерПакета);
		ДополнительныеПараметры.Вставить("Сертификат", ВыбСертификат);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаКомплектацийВГИИСЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыВыполнения = ИнтеграцияГИИСДМДККлиент.ИнициализироватьПараметрыВыполнения();
		ПараметрыВыполнения.ИмяМетода = ДанныеРегистрации.ИмяМетода;
		ПараметрыВыполнения.ТребуетсяПодпись = Истина;
		ПараметрыВыполнения.Сертификат = ВыбСертификат;
		ПараметрыВыполнения.МетодПодписи = "БСП";
		ПараметрыВыполнения.ПолучатьРезультат = Истина;
		ПараметрыВыполнения.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		ПараметрыВыполнения.КоличествоПопыток = КоличествоПопыток;
		ПараметрыВыполнения.ПодписьНаСервере = ПодписьНаСервере;
		ПараметрыВыполнения.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.Организация = Объект.Организация;
		
		НастройкиПоОрганизации.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		НастройкиПоОрганизации.КоличествоПопыток = КоличествоПопыток;
		НастройкиПоОрганизации.ПодписьНаСервере = ПодписьНаСервере;
		НастройкиПоОрганизации.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.НастройкиОбмена = НастройкиПоОрганизации;
		
		ИнтеграцияГИИСДМДККлиент.ВыполнитьМетодСервиса(ДанныеДляОтправки, ПараметрыВыполнения, ЭтотОбъект, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаПолучениеВеса(ВыбСертификат, Пакеты, НомерПакета = 1)
	ДанныеРегистрации = Пакеты.Получить(НомерПакета);
	
	Если ДанныеРегистрации = Неопределено Тогда
		
		ИдетОтправкаДанных = Ложь;
		ПараметрыЗаписи = Новый Структура;
    	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
		
		Возврат;
		
	КонецЕсли;
	
	Если ДанныеРегистрации.Свойство("ИдентификаторЗапроса") Тогда
		ДанныеОЗапросе = Новый Структура;
		ДанныеОЗапросе.Вставить("messageId", ДанныеРегистрации.ИдентификаторЗапроса);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("НомераСтрок", ДанныеРегистрации);
		ДополнительныеПараметры.Вставить("Пакеты", Пакеты);
		ДополнительныеПараметры.Вставить("НомерПакета", НомерПакета);
		ДополнительныеПараметры.Вставить("Сертификат", ВыбСертификат);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЗапросНаПолучениеВесаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыВыполнения = ИнтеграцияГИИСДМДККлиент.ИнициализироватьПараметрыВыполнения();
		ПараметрыВыполнения.ИмяМетода = ДанныеРегистрации.ИмяМетода;
		ПараметрыВыполнения.ТребуетсяПодпись = Истина;
		ПараметрыВыполнения.Сертификат = ВыбСертификат;
		ПараметрыВыполнения.МетодПодписи = "БСП";
		ПараметрыВыполнения.ПолучатьРезультат = Ложь;
		ПараметрыВыполнения.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		ПараметрыВыполнения.КоличествоПопыток = КоличествоПопыток;
		ПараметрыВыполнения.ПодписьНаСервере = ПодписьНаСервере;
		ПараметрыВыполнения.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.Организация = Объект.Организация;
		
		НастройкиПоОрганизации.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		НастройкиПоОрганизации.КоличествоПопыток = КоличествоПопыток;
		НастройкиПоОрганизации.ПодписьНаСервере = ПодписьНаСервере;
		НастройкиПоОрганизации.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.НастройкиОбмена = НастройкиПоОрганизации;
		
		ИнтеграцияГИИСДМДККлиент.ВыполнитьМетодСервиса(ДанныеОЗапросе, ПараметрыВыполнения, ЭтотОбъект, ОписаниеОповещения);
		
	Иначе
		Если Не ЗначениеЗаполнено(ДанныеРегистрации.ПартииНеОтправлено) Тогда
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("НомераСтрок", ДанныеРегистрации.НомераСтрокНеОтправлено);
		ДополнительныеПараметры.Вставить("Пакеты", Пакеты);
		ДополнительныеПараметры.Вставить("НомерПакета", НомерПакета);
		ДополнительныеПараметры.Вставить("Сертификат", ВыбСертификат);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЗапросНаПолучениеВесаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыВыполнения = ИнтеграцияГИИСДМДККлиент.ИнициализироватьПараметрыВыполнения();
		ПараметрыВыполнения.ИмяМетода = ИнтеграцияГИИСДМДККлиент.ИмяМетодаЗапросПолученияСведенийОПартиях();
		ПараметрыВыполнения.ТребуетсяПодпись = Истина;
		ПараметрыВыполнения.Сертификат = ВыбСертификат;
		ПараметрыВыполнения.МетодПодписи = "БСП";
		ПараметрыВыполнения.ПолучатьРезультат = Истина;
		ПараметрыВыполнения.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		ПараметрыВыполнения.КоличествоПопыток = КоличествоПопыток;
		ПараметрыВыполнения.ПодписьНаСервере = ПодписьНаСервере;
		ПараметрыВыполнения.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.Организация = Объект.Организация;
		
		НастройкиПоОрганизации.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		НастройкиПоОрганизации.КоличествоПопыток = КоличествоПопыток;
		НастройкиПоОрганизации.ПодписьНаСервере = ПодписьНаСервере;
		НастройкиПоОрганизации.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.НастройкиОбмена = НастройкиПоОрганизации;
		
		ИнтеграцияГИИСДМДККлиент.ВыполнитьМетодСервиса(ДанныеРегистрации.ПартииНеОтправлено, ПараметрыВыполнения, ЭтотОбъект, ОписаниеОповещения);
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьОтправитьДанныеПоДокументу(ВыбСертификат)
	
	УстановитьВидимостьПредупреждения(Ложь);
	
	ПредварительныеДанныеДляОтправки = ПодготовитьДанныеКомплектацииТоваров();
	
	Если ПредварительныеДанныеДляОтправки.Пакеты.Количество() > 0 Тогда
		ОтправитьИнформациюОКомплектации(ВыбСертификат, ПредварительныеДанныеДляОтправки.Пакеты);
	Иначе
		ИдетОтправкаДанных = Ложь;
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нет данных для отправки");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьОтправитьДанныеПоВесам(ВыбСертификат)
	
	УстановитьВидимостьПредупреждения(Ложь);
	
	ПредварительныеДанныеДляОтправки = ПодготовитьДанныеДляЗапросаХимЧистоты();
	
	Если ПредварительныеДанныеДляОтправки.Пакеты.Количество() > 0 Тогда
		ОтправитьЗапросНаПолучениеВеса(ВыбСертификат, ПредварительныеДанныеДляОтправки.Пакеты);
	Иначе
		ИдетОтправкаДанных = Ложь;
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нет данных для отправки");
	КонецЕсли;
	
КонецПроцедуры
		
&НаКлиенте
Процедура ПослеВыбораСертификатаПоВесам(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не выбран сертификат по организации. Отправка информации о документе не возможна");
		ИдетОтправкаДанных = Ложь;
		Возврат;
	КонецЕсли;	
	
	ВыбСертификат = Результат.Значение;

	ПодготовитьОтправитьДанныеПоВесам(ВыбСертификат);	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораСертификата(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не выбран сертификат по организации. Отправка информации о документе не возможна");
		ИдетОтправкаДанных = Ложь;
		Возврат;
	КонецЕсли;	
	
	ВыбСертификат = Результат.Значение;

	ПодготовитьОтправитьДанныеПоДокументу(ВыбСертификат);	
	
КонецПроцедуры	

&НаКлиенте
Процедура ВопросЗаписиПередПолучениемИНП(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
		
		ПолучитьИНППродолжить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИНППродолжить()
	
	ОчиститьСообщения();
	
	Если Не ДанныеЗаполненыКорректно() Тогда
		Возврат;
	КонецЕсли;
	
	ИдетОтправкаДанных = Истина;
	
	Если СписокСертификатов.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораСертификата", ЭтотОбъект);
		СписокСертификатов.ПоказатьВыборЭлемента(Оповещение, "Выберите сертификат");
	Иначе
		ПодготовитьОтправитьДанныеПоДокументу(Сертификат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИНП(Команда)
	Если ИдетОтправкаДанных Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен = Ложь Тогда
		
		ТекстПредупреждения = НСтр("ru='Отправка данных возможна только для проведенных документов.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗаписиПередПолучениемИНП", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Данные были изменены, перед отправкой данных документ необходимо записать. Записать?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПолучитьИНППродолжить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ИнтеграцияГИИСДМДК.ПолучитьСертификатыОрганизации(Объект.Организация, ЭтотОбъект);

	НастройкиПоОрганизации = РегистрыСведений.НастройкиОбменаГИИСДМДК.НастройкиПоОрганизации(Объект.Организация);
	
	ТаймаутМеждуПопытками = НастройкиПоОрганизации.ТаймаутМеждуПопытками;
	КоличествоПопыток = НастройкиПоОрганизации.КоличествоПопыток;
	ПодписьНаСервере = НастройкиПоОрганизации.ПодписьНаСервере;
	ОтправкаНаСервере = НастройкиПоОрганизации.ОтправкаНаСервере;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВесКомплектаПриИзменении(Элемент)
	ПересчитатьВесВХимЧистоте();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВесВХимЧистоте(ТекСтрока = Неопределено)
	Если ТекСтрока = Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.Комплект) и ЗначениеЗаполнено(Объект.Комплект.Проба) Тогда
			ВесВХимЧистотеНовый = 0;
			ВесКомплектаНовый = 0;
			Для Каждого Стр Из Объект.Товары Цикл
				Если Не ЗначениеЗаполнено(Стр.ИНП) Тогда
					Стр.ИНП = Стр.СерияНоменклатуры.УИН;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Стр.ВесВХимЧистотеГИИСДМДК) Тогда
					Стр.ВесВХимЧистоте = Стр.ВесВХимЧистотеГИИСДМДК;	
				КонецЕсли;
				ВесВХимЧистотеНовый = ?(Объект.РасчетВесаБезУчетаВставок, ВесВХимЧистотеНовый + Окр(Стр.Вес * Стр.Номенклатура.Проба.Проба / Стр.Номенклатура.Проба.Металл.ПробаЧистоты, 4), ВесВХимЧистотеНовый + Стр.ВесВХимЧистоте);
				Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие
					Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
					ВесКомплектаНовый = ВесКомплектаНовый + Стр.Вес;
				Иначе
					ВесКомплектаНовый = ?(Объект.РасчетВесаБезУчетаВставок, ВесКомплектаНовый + Стр.Вес, ВесКомплектаНовый + Стр.Вес - Стр.ВесВставок);
				КонецЕсли;
			КонецЦикла;	
			Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом Тогда
				Объект.ВесКомплектаВХимЧистоте = Окр(Объект.ВесКомплекта * Объект.Комплект.Проба.Проба / Объект.Комплект.Проба.Металл.ПробаЧистоты, 3);
			Иначе
				Объект.ВесКомплектаВХимЧистоте = ВесВХимЧистотеНовый;
				Объект.ВесКомплекта = ВесКомплектаНовый;
			КонецЕсли;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни Тогда
			Объект.ВесКомплектаВХимЧистоте = Объект.Товары.Итог("Вес");
		Иначе
			Объект.ВесКомплектаВХимЧистоте = 0;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) и ЗначениеЗаполнено(ТекСтрока.Номенклатура.Проба) Тогда
			ЮвелирнаяТорговля.РассчитатьВесВставокИДопМатериалов(ТекСтрока);
			
			ДельтаМеждуВесами = Объект.ВесКомплектаВХимЧистоте - Объект.Товары.Итог("ВесВХимЧистоте");
			Если ДельтаМеждуВесами > -0.01 И Объект.ВесКомплектаВХимЧистоте <> 0 И ДельтаМеждуВесами < 0.01 Тогда
				ТекСтрока.ВесВХимЧистоте = ТекСтрока.ВесВХимЧистоте + ДельтаМеждуВесами;
			КонецЕсли;	
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни Тогда
			ТекСтрока.ВесВХимЧистоте = ТекСтрока.Вес;
		Иначе
			ТекСтрока.ВесВХимЧистоте = 0;
		КонецЕсли;
	КонецЕсли;
	Объект.КоличествоКомплекта = Объект.Товары.Итог("Количество");
КонецПроцедуры

&НаСервере
Процедура ТоварыВесПриИзменениинаСервере(ИдСтроки)
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ИдСтроки);
	ПересчитатьВесВХимЧистоте(ТекСтрока);	
Конецпроцедуры

&НаКлиенте
Процедура ТоварыВесПриИзменении(Элемент)
	ТоварыВесПриИзменениинаСервере(Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры


#КонецОбласти

&НаСервере
Процедура ПолучитьНастройкиСКД(Перезаполнить = Ложь)

	Если Параметры.Ключ.Пустая() Или Перезаполнить Тогда
		СхемаСКД = Документы.ПреобразованиеВЛом.ПолучитьМакет("НастройкиЗаполнения");
	Иначе
		СхемаСКД = РеквизитФормыВЗначение("Объект").НастройкиЗаполнения.Получить();
		Если СхемаСКД = Неопределено Тогда
			СхемаСКД = Документы.ПреобразованиеВЛом.ПолучитьМакет("НастройкиЗаполнения");
		КонецЕсли;
	КонецЕсли;

	АдресСхемаСКД = ПоместитьВоВременноеХранилище(СхемаСКД, УникальныйИдентификатор);

	Попытка
		ОтборыСКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемаСКД));
	Исключение
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(
			"Не удалось инициализировать отборы скд для настроек заполнения");
	КонецПопытки;

	ОтборыСКД.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);

	ОтборыСКД.Восстановить();

КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройки(Команда)

	ПолучитьНастройкиСКД(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)

	Если Объект.Товары.Количество() > 0 Тогда
		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОстаткамЗавершение", ЭтотОбъект), ТекстВопроса,
			РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		ЗаполнитьТовары();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткамЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Ответ = РезультатВопроса;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьТовары();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары()

	Объект.Товары.Очистить();
	СхемаСКД = ПолучитьИзВременногоХранилища(АдресСхемаСКД);
	СхемаСКД.Параметры.Склад.Значение = Объект.Склад;
	СхемаСКД.Параметры.Склад.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	СхемаСКД.Параметры.Организация.Значение = Объект.Организация;
	СхемаСКД.Параметры.Организация.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	СхемаСКД.Параметры.Период.Значение = Объект.Дата;
	СхемаСКД.Параметры.Период.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	
	ПараметрПериод = ОтборыСКД.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если ПараметрПериод <> Неопределено Тогда
		ПараметрПериод.Значение = Объект.Дата;
		ПараметрПериод.Использование = Истина;
	КонецЕсли;
	
	ПараметрСклад = ОтборыСКД.Настройки.ПараметрыДанных.Элементы.Найти("Склад");
	Если ПараметрСклад <> Неопределено Тогда
		ПараметрСклад.Значение = Объект.Склад;
		ПараметрСклад.Использование = Истина;
	КонецЕсли;
	
	ПараметрОрганизация = ОтборыСКД.Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	Если ПараметрОрганизация <> Неопределено Тогда
		ПараметрОрганизация.Значение = Объект.Организация;
		ПараметрОрганизация.Использование = Истина;
	КонецЕсли;
	ЗаполнитьТоварыПоСКД(СхемаСКД, ОтборыСКД.Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоСКД(СКД, Настройки)

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СКД, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Для Каждого Выборка Из ТаблицаЗначений Цикл
		Если Выборка.Номенклатура = Неопределено Или ТипЗнч(Выборка.Номенклатура) = Тип("Null") Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = Объект.Товары.Добавить();
		
		СтрокаТабличнойЧасти.Номенклатура               = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
		СтрокаТабличнойЧасти.ИНП				        = Выборка.УИН;
		СтрокаТабличнойЧасти.Количество                 = Выборка.Количество;
		СтрокаТабличнойЧасти.Вес	                    = Выборка.Вес;
		СтрокаТабличнойЧасти.ВесВХимЧистоте				= Выборка.ВесВХимЧистоте;
		ПересчитатьВесВХимЧистоте(СтрокаТабличнойЧасти);
		СтрокаТабличнойЧасти.Размер	                    = Выборка.Размер;
		СтрокаТабличнойЧасти.Стоимость			        = Выборка.Стоимость;
		СтрокаТабличнойЧасти.СтоимостьБезНДС			= Выборка.СтоимостьБезНДС;
		СтрокаТабличнойЧасти.ДокументПоступления        = Выборка.ДокументОприходования;
		Если Объект.Склад.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
			СтрокаТабличнойЧасти.ЦенаВРознице = Выборка.ЦенаВРознице;
		КонецЕсли;	

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Если Объект.ПараллельнаяОтправкаДанных Тогда
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИНП", Элементы.Товары.ТекущиеДанные.ИНП);
		ЕстьСтрокиЗапросов = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
		МожноУдалитьСтроку = Истина;
		Для Каждого ТекЗапрос Из ЕстьСтрокиЗапросов Цикл
			Если Объект.ВидОперации 
				= ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие")
				И ТекЗапрос.Очередь > 1 И ТекЗапрос.Статус <> ИнтеграцияГИИСДМДККлиент.СтатусНеОтправлено() Тогда
				Отказ = Истина;
				МожноУдалитьСтроку = Ложь;
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя удалять строки, по которым есть отправленные запросы");
				Прервать;
			ИначеЕсли НЕ Объект.ВидОперации 
				= ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие")
				И ТекЗапрос.Очередь > 2 И ТекЗапрос.Статус <> ИнтеграцияГИИСДМДККлиент.СтатусНеОтправлено() Тогда
				Отказ = Истина;
				МожноУдалитьСтроку = Ложь;
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя удалять строки, по которым есть отправленные запросы");
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если МожноУдалитьСтроку Тогда
			Для Каждого ТекЗапрос Из ЕстьСтрокиЗапросов Цикл
				Объект.СписокЗапросов.Удалить(ТекЗапрос);	
			КонецЦикла;
			Если Элементы.Товары.ТекущиеДанные.НомерСтрокиТаблЧасти > 0 Тогда
				ТекущийПромежуточныйКомплект = Объект.ПромежуточныеКомплекты[Элементы.Товары.ТекущиеДанные.НомерСтрокиТаблЧасти - 1];
				ТекущийПромежуточныйКомплект.Количество = ТекущийПромежуточныйКомплект.Количество - Элементы.Товары.ТекущиеДанные.Количество;
				ТекущийПромежуточныйКомплект.Вес = ТекущийПромежуточныйКомплект.Вес - Элементы.Товары.ТекущиеДанные.Вес;
				Если ТекущийПромежуточныйКомплект.Количество = 0 И ТекущийПромежуточныйКомплект.Вес = 0 Тогда
					Объект.ПромежуточныеКомплекты.Удалить(ТекущийПромежуточныйКомплект);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	Иначе 
		
		Если Элементы.Товары.ТекущиеДанные.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусУспех() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя удалять строки с присвоенным УИН");
		ИначеЕсли Элементы.Товары.ТекущиеДанные.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета() Тогда	
			Отказ = Истина;
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя удалять строки по которым ожидается ответ от ГИИС ДМДК");
		Иначе
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("НомерСтрокиТаблЧасти", Элементы.Товары.ТекущиеДанные.НомерСтроки);
			ЕстьСтроки = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
			КоличествоСтрок = ЕстьСтроки.Количество();
			Если КоличествоСтрок > 0 Тогда
				ЕстьСтрокиНельзяУдалять = Ложь;
				Для Каждого ЕстьСтрока Из ЕстьСтроки Цикл
					Если ЕстьСтрока.Статус = ИнтеграцияГИИСДМДККлиент.СтатусУспех()
						Или ЕстьСтрока.Статус = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета() Тогда
						Прервать;
						ЕстьСтрокиНельзяУдалять = Истина;
					КонецЕсли;	
				КонецЦикла;
				Если ЕстьСтрокиНельзяУдалять Тогда
					Отказ = Истина;
					ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя удалять строки по которым отправлялись данные ГИИС ДМДК");
				Иначе
					Пока КоличествоСтрок > 0 Цикл
						ЕстьСтрока = ЕстьСтроки[КоличествоСтрок - 1];
						Объект.СписокЗапросов.Удалить(ЕстьСтрока);	
						КоличествоСтрок = КоличествоСтрок - 1;
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВесВХимЧистотеПродолжить(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
		
	ИдетОтправкаДанных = Истина;
	
	Если СписокСертификатов.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораСертификатаПоВесам", ЭтотОбъект);
		СписокСертификатов.ПоказатьВыборЭлемента(Оповещение, "Выберите сертификат");
	Иначе
		ПодготовитьОтправитьДанныеПоВесам(Сертификат);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВесВХимЧистоте(Команда)
	Если ИдетОтправкаДанных Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен = Ложь Тогда
		
		ТекстПредупреждения = НСтр("ru='Запрос данных возможен только для проведенных документов.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьВесВХимЧистотеПродолжить", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Данные были изменены, перед запросом данных документ необходимо записать. Записать?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПолучитьВесВХимЧистотеПродолжить(КодВозвратаДиалога.Да);
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура РучноеИзменениеМассыСырьяПриИзменении(Элемент)
	Элементы.ВесКомплектаВХимЧистоте.ТолькоПросмотр = Не Объект.РучноеИзменениеМассыСырья;
	Элементы.ТоварыВесВХимЧистоте.ТолькоПросмотр = Не Объект.РучноеИзменениеМассыСырья;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруКамнейНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КомплектацияТоваровКамни.НомерСтроки КАК НомерСтроки,
	                      |	КомплектацияТоваровКамни.Номенклатура КАК НоменклатураСсылка,
	                      |	КомплектацияТоваровКамни.Камень КАК КаменьДок,
	                      |	КомплектацияТоваровКамни.ФормаОгранки КАК ФормаОгранкиДок,
	                      |	КомплектацияТоваровКамни.ГруппаЦвета КАК ГруппаЦветаДок,
	                      |	КомплектацияТоваровКамни.ГруппаЧистоты КАК ГруппаЧистотыДок,
	                      |	КомплектацияТоваровКамни.Рассев КАК РассевДок,
	                      |	КомплектацияТоваровКамни.СпособОблагораживанияГИИСДМДК КАК СпособОблагораживанияГИИСДМДКДок
	                      |ПОМЕСТИТЬ ДанныеДокумента
	                      |ИЗ
	                      |	&Камни КАК КомплектацияТоваровКамни
	                      |ГДЕ
	                      |	КомплектацияТоваровКамни.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |	И НЕ КомплектацияТоваровКамни.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	                      |	Номенклатура.Ссылка КАК Ссылка,
	                      |	ДанныеДокумента.КаменьДок КАК КаменьДок,
	                      |	ДанныеДокумента.ФормаОгранкиДок КАК ФормаОгранкиДок,
	                      |	ДанныеДокумента.ГруппаЦветаДок КАК ГруппаЦветаДок,
	                      |	ДанныеДокумента.ГруппаЧистотыДок КАК ГруппаЧистотыДок,
	                      |	ДанныеДокумента.РассевДок КАК РассевДок,
	                      |	ДанныеДокумента.СпособОблагораживанияГИИСДМДКДок КАК СпособОблагораживанияГИИСДМДКДок
	                      |ИЗ
	                      |	ДанныеДокумента КАК ДанныеДокумента
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                      |		ПО ДанныеДокумента.КаменьДок = Номенклатура.Камень
	                      |			И ДанныеДокумента.ФормаОгранкиДок = Номенклатура.ФормаОгранки
	                      |			И ДанныеДокумента.ГруппаЦветаДок = Номенклатура.ГруппаЦвета
	                      |			И ДанныеДокумента.ГруппаЧистотыДок = Номенклатура.ГруппаДефекта
	                      |			И ДанныеДокумента.РассевДок = Номенклатура.Рассев
	                      |			И ДанныеДокумента.СпособОблагораживанияГИИСДМДКДок = Номенклатура.СпособОблагораживанияГИИСДМДК" );
	Запрос.УстановитьПараметр("Камни", Объект.Камни.Выгрузить());
	ТаблицаКамней = Запрос.Выполнить().Выгрузить();
	ЕдиницаКарат = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("162");
	Для Каждого Стр Из ТаблицаКамней Цикл
		Если ЗначениеЗаполнено(Стр.Ссылка) Тогда
			Объект.Камни[Стр.НомерСтроки - 1].Номенклатура = Стр.Ссылка;
		Иначе
			НовыйКамень = Справочники.Номенклатура.СоздатьЭлемент();
			НовыйКамень.БазоваяЕдиницаИзмерения = ЕдиницаКарат;
			НовыйКамень.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Вставка;
			НовыйКамень.Весовой = Истина;
			НовыйКамень.Камень = Стр.КаменьДок;
			НовыйКамень.ФормаОгранки = Стр.ФормаОгранкиДок;
			НовыйКамень.Рассев = Стр.РассевДок;
			НовыйКамень.ГруппаДефекта = Стр.ГруппаЧистотыДок;
			НовыйКамень.ГруппаЦвета = Стр.ГруппаЦветаДок;
			НовыйКамень.СпособОблагораживанияГИИСДМДК = Стр.СпособОблагораживанияГИИСДМДКДок;
			НовыйКамень.НаименованиеПолное = ЮвелирнаяТорговля.СформироватьНаименованиеНоменклатуры(НовыйКамень);
			НовыйКамень.Наименование = НовыйКамень.НаименованиеПолное;
			НовыйКамень.Записать();
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("КаменьДок", Стр.КаменьДок);
			СтруктураПоиска.Вставить("ФормаОгранкиДок", Стр.ФормаОгранкиДок);
			СтруктураПоиска.Вставить("РассевДок", Стр.РассевДок);
			СтруктураПоиска.Вставить("ГруппаЧистотыДок", Стр.ГруппаЧистотыДок);
			СтруктураПоиска.Вставить("ГруппаЦветаДок", Стр.ГруппаЦветаДок);
			СтруктураПоиска.Вставить("СпособОблагораживанияГИИСДМДКДок", Стр.СпособОблагораживанияГИИСДМДКДок);
			ЕстьСтроки = ТаблицаКамней.НайтиСтроки(СтруктураПоиска);
			Для Каждого ТекКамень Из ЕстьСтроки Цикл
				ТекКамень.Ссылка = НовыйКамень.Ссылка;
			КонецЦикла;
			Объект.Камни[Стр.НомерСтроки - 1].Номенклатура = НовыйКамень.Ссылка;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруКамней(Команда)
	ЗаполнитьНоменклатуруКамнейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьОтправитьДанныеПоКамням(ВыбСертификат)
	
	УстановитьВидимостьПредупреждения(Ложь);
	
	Пакеты = Новый Соответствие;
	НомерПакета = 0;

	ПолучитьДанныеПоКамнямДляЗапроса(Пакеты, НомерПакета);
	
	ПредварительныеДанныеДляОтправки = Новый Структура;
	ПредварительныеДанныеДляОтправки.Вставить("Пакеты", Пакеты);
	
	Если ПредварительныеДанныеДляОтправки.Пакеты.Количество() > 0 Тогда
		ОтправитьИнформациюОКомплектации(ВыбСертификат, ПредварительныеДанныеДляОтправки.Пакеты);
	Иначе
		ИдетОтправкаДанных = Ложь;
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нет данных для отправки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСертификатаПоКамням(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не выбран сертификат по организации. Отправка информации о документе не возможна");
		ИдетОтправкаДанных = Ложь;
		Возврат;
	КонецЕсли;	
	
	ВыбСертификат = Результат.Значение;

	ПодготовитьОтправитьДанныеПоКамням(ВыбСертификат);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоКамнямПродолжить()
	
	ОчиститьСообщения();
		
	ИдетОтправкаДанных = Истина;
	
	Если СписокСертификатов.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораСертификатаПоКамням", ЭтотОбъект);
		СписокСертификатов.ПоказатьВыборЭлемента(Оповещение, "Выберите сертификат");
	Иначе
		ПодготовитьОтправитьДанныеПоКамням(Сертификат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеКамней(Команда)
	Если ИдетОтправкаДанных Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен = Ложь Тогда
		
		ТекстПредупреждения = НСтр("ru='Отправка данных возможна только для проведенных документов.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
			
	ПолучитьДанныеПоКамнямПродолжить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВесМеталлаПриИзменении(Элемент)
	Если Элементы.Товары.ТекущиеДанные.ВесМеталла < Элементы.Товары.ТекущиеДанные.ВесВХимЧистоте Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Вес металла меньше веса в хим.чистоте");
	КонецЕсли;	
	Элементы.Товары.ТекущиеДанные.РучноеИзменение = Истина;
	ПересчитатьВесВХимЧистоте();	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.Прочитать();
		
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникОткрыть(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПараметрыЗаписи = Новый Структура;
    		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
			Записать(ПараметрыЗаписи);	
		КонецЕсли;	
		ПараметрыОткрытияПомощника = Новый Структура;
		ПараметрыОткрытияПомощника.Вставить("Ключ", Объект.Ссылка);
		
		Оповещение = Новый ОписаниеОповещения("ПомощникРезультат", ЭтотОбъект);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИмяМетода", "");
		ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		Если (ЕстьСтроки.Количество() = Объект.Товары.Количество()
			И Объект.ИмяМетода = "") Или Объект.СписокЗапросов.Количество() = 0 Или Объект.ПараллельнаяОтправкаДанных Тогда
			ОткрытьФорму("Документ.ПреобразованиеВЛом.Форма.ФормаПомощника", ПараметрыОткрытияПомощника,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
		Иначе
			ОткрытьФорму("Документ.ПреобразованиеВЛом.Форма.ФормаПомощникаСтарый", ПараметрыОткрытияПомощника,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Помощник(Команда)
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Оповещение = Новый ОписаниеОповещения("ПомощникОткрыть", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Данные были изменены, документ нужно записать. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ПомощникОткрыть(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	Если Элементы.ЗаполнитьВесПоКомплектующим.Видимость = Истина Тогда
		ЗаполнитьВесПоКомплектующимНаСервере();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросовРедактированиеПриИзменении(Элемент)
	Элементы.СписокЗапросов.ТолькоПросмотр = Не ЭтаФорма.СписокЗапросовРедактирование;
КонецПроцедуры
