
&После("ПриНачалеРаботыСистемы")
Процедура B1_ПриНачалеРаботыСистемы()
	
	Если СтрНайти(СтрокаСоединенияИнформационнойБазы(), "development") = 0 Тогда
		ФормаОбработки = ПолучитьФорму("Обработка.ВыгрузкаНаСайтУФ.Форма.Форма");
		
		Если ФормаОбработки <> Неопределено Тогда
			ФормаОбработки.Открыть();
			ФормаОбработки.СохранитьВФайл = Ложь;
			ФормаОбработки.ВыгрузитьДанные(Неопределено);
			Если ФормаОбработки.ЗначениеТаймера > 0 Тогда
				ФормаОбработки.ЗапуститьТаймер(Неопределено);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры
