
//&НаКлиентеНаСервереБезКонтекста
//&ИзменениеИКонтроль("КоличествоПартийСпецификацииВЗапросе")
//Функция B1_КоличествоПартийСпецификацииВЗапросе()

//	#Удаление
//	Возврат 25;
//	#КонецУдаления
//	#Вставка
//	Возврат B1_ИнтеграцияГИИСДМДКСерверВызовСервера.B1_ПолучитьКоличествоПартийВЗапросеИзНастроек();
//	#КонецВставки

//КонецФункции

//&НаСервере
//&ИзменениеИКонтроль("ПодготовитьНезавершенныеДанныеОтгрузкиГотовойПродукции")
//Процедура B1_ПодготовитьНезавершенныеДанныеОтгрузкиГотовойПродукции(Результат, ДанныеТаблиц, ВидДокументов, НомерЗапроса)

//	ДокументыДляРегистрации = ДанныеТаблиц.ДокументыНезавершенные;
//	Товары = ИнтеграцияГИИСДМДКЮТДСервер.МассивСтруктурВТаблицуПартий(ДанныеТаблиц.Товары);

//	ДопустимоеКоличествоПартий = КоличествоПартийСпецификацииВЗапросе();

//	Для каждого СтрокаДокументов Из ДокументыДляРегистрации Цикл

//		ОтборТоваров = Новый Структура("Ссылка");

//		ЗаполнитьЗначенияСвойств(ОтборТоваров, СтрокаДокументов);

//		ТоварыДокумента = Товары.НайтиСтроки(ОтборТоваров);

//		Если ТоварыДокумента.Количество() = 0 Тогда
//			Продолжить;		
//		КонецЕсли;

//		Партии = Новый Массив;
//		СерииНоменклатуры = Новый Массив;

//		КоличествоВЗапросе = 0;

//		Для каждого СтрокаТоваров Из ТоварыДокумента Цикл
//			
//			#Вставка
//			//Для УИН, которые уже спианы
//			//Если СтрокаТоваров.УИН = "6432401438737990" Тогда
//			//	Продолжить;		
//			//КонецЕсли;
//			#КонецВставки
//			Если КоличествоВЗапросе = ДопустимоеКоличествоПартий Тогда

//				ДанныеЗапроса = Новый Структура;
//				ДанныеЗапроса.Вставить("НомерСпецификации", СтрокаДокументов.НомерСпецификации);
//				ДанныеЗапроса.Вставить("Замена", Ложь);
//				ДанныеЗапроса.Вставить("Партии", Партии);
//				ДанныеЗапроса.Вставить("Документ", СтрокаДокументов.Ссылка);
//				ДанныеЗапроса.Вставить("СерииНоменклатуры", СерииНоменклатуры);
//				ДанныеЗапроса.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаЗапросДобавленияПартийВСпецификации());

//				НомерЗапроса = НомерЗапроса + 1;

//				Результат.Вставить(НомерЗапроса, ДанныеЗапроса);

//				КоличествоВЗапросе = 0;

//				Партии = Новый Массив;
//				СерииНоменклатуры = Новый Массив;

//			КонецЕсли;

//			Партии.Добавить(СтрокаТоваров.УИН);
//			СерииНоменклатуры.Добавить(СтрокаТоваров.СерияНоменклатуры);

//			КоличествоВЗапросе = КоличествоВЗапросе + 1;

//		КонецЦикла;

//		Если КоличествоВЗапросе > 0 Тогда

//			ДанныеЗапроса = Новый Структура;
//			ДанныеЗапроса.Вставить("НомерСпецификации", СтрокаДокументов.НомерСпецификации);
//			ДанныеЗапроса.Вставить("Замена", Ложь);
//			ДанныеЗапроса.Вставить("Партии", Партии);
//			ДанныеЗапроса.Вставить("Документ", СтрокаДокументов.Ссылка);
//			ДанныеЗапроса.Вставить("СерииНоменклатуры", СерииНоменклатуры);
//			ДанныеЗапроса.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаЗапросДобавленияПартийВСпецификации());

//			НомерЗапроса = НомерЗапроса + 1;

//			Результат.Вставить(НомерЗапроса, ДанныеЗапроса);

//		КонецЕсли;

//	КонецЦикла;

//КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("КоличествоПартийСпецификацииВЗапросе")
Функция B1_КоличествоПартийСпецификацииВЗапросе(КоличествоПартийСпецификацииВЗапросе)

	#Удаление
	Возврат ?(КоличествоПартийСпецификацииВЗапросе = 0, 25, КоличествоПартийСпецификацииВЗапросе);
	#КонецУдаления
	#Вставка
	Возврат B1_ИнтеграцияГИИСДМДКСерверВызовСервера.B1_ПолучитьКоличествоПартийВЗапросеИзНастроек();
	#КонецВставки

КонецФункции


&НаСервере
&ИзменениеИКонтроль("ПодготовитьНезавершенныеДанныеОтгрузкиГотовойПродукции")
Процедура B1_ПодготовитьНезавершенныеДанныеОтгрузкиГотовойПродукции(Результат, ДанныеТаблиц, ВидДокументов, НомерЗапроса)

	ДокументыДляРегистрации = ДанныеТаблиц.ДокументыНезавершенные;
	Товары = ИнтеграцияГИИСДМДКЮТДСервер.МассивСтруктурВТаблицуПартий(ДанныеТаблиц.Товары);

	ДопустимоеКоличествоПартий = КоличествоПартийСпецификацииВЗапросе(КоличествоПартийСпецификацииВЗапросе);

	Для каждого СтрокаДокументов Из ДокументыДляРегистрации Цикл

		ОтборТоваров = Новый Структура("Ссылка");

		ЗаполнитьЗначенияСвойств(ОтборТоваров, СтрокаДокументов);

		ТоварыДокумента = Товары.НайтиСтроки(ОтборТоваров);

		Если ТоварыДокумента.Количество() = 0 Тогда
			Продолжить;		
		КонецЕсли;

		Партии = Новый Массив;
		СерииНоменклатуры = Новый Массив;

		КоличествоВЗапросе = 0;

		Для каждого СтрокаТоваров Из ТоварыДокумента Цикл
			 
			#Вставка
			//Для УИН, которые уже спианы
			//Если СтрокаТоваров.УИН = "6432401438737990" Тогда
			//	Продолжить;		
			//КонецЕсли;
			#КонецВставки
			Если КоличествоВЗапросе = ДопустимоеКоличествоПартий Тогда

				ДанныеЗапроса = Новый Структура;
				ДанныеЗапроса.Вставить("НомерСпецификации", СтрокаДокументов.НомерСпецификации);
				ДанныеЗапроса.Вставить("Замена", Ложь);
				ДанныеЗапроса.Вставить("Партии", Партии);
				ДанныеЗапроса.Вставить("Документ", СтрокаДокументов.Ссылка);
				ДанныеЗапроса.Вставить("СерииНоменклатуры", СерииНоменклатуры);
				ДанныеЗапроса.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаЗапросДобавленияПартийВСпецификации());

				НомерЗапроса = НомерЗапроса + 1;

				Результат.Вставить(НомерЗапроса, ДанныеЗапроса);

				КоличествоВЗапросе = 0;

				Партии = Новый Массив;
				СерииНоменклатуры = Новый Массив;

			КонецЕсли;

			Партии.Добавить(СтрокаТоваров.УИН);
			СерииНоменклатуры.Добавить(СтрокаТоваров.СерияНоменклатуры);

			КоличествоВЗапросе = КоличествоВЗапросе + 1;

		КонецЦикла;

		Если КоличествоВЗапросе > 0 Тогда

			ДанныеЗапроса = Новый Структура;
			ДанныеЗапроса.Вставить("НомерСпецификации", СтрокаДокументов.НомерСпецификации);
			ДанныеЗапроса.Вставить("Замена", Ложь);
			ДанныеЗапроса.Вставить("Партии", Партии);
			ДанныеЗапроса.Вставить("Документ", СтрокаДокументов.Ссылка);
			ДанныеЗапроса.Вставить("СерииНоменклатуры", СерииНоменклатуры);
			ДанныеЗапроса.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаЗапросДобавленияПартийВСпецификации());

			НомерЗапроса = НомерЗапроса + 1;

			Результат.Вставить(НомерЗапроса, ДанныеЗапроса);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
