
&НаКлиенте
Процедура ВыбратьТипЦены(Команда)
	
	Если Не ЗначениеЗаполнено(ТипЦены) Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не указан тип цены");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("ТипЦены", ТипЦены);
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипЦены = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("00005");
КонецПроцедуры
