
&НаСервере
Процедура ЗаполнитьНаСервере()
	Для каждого СтрокаТовара Из ТабличноеПолеТовары Цикл
		СтрокаТовара.НовыйШтрихкод = ПолучитьАктуальныйШтрихшкод(СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры, СтрокаТовара.Размер);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальныйШтрихшкод(НоменклатураИзДокумента, ХарактеристикаНоменклатурыИзДокумента, РазмерИзДокумента)
	
	ВозвращаемыйШтрихкод = "";
	
	Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.ПоступлениеПродукцииИзПроизводства")Тогда
		ДокументСтрока = "ПоступлениеПродукцииИзПроизводства";	
	Иначе
		ДокументСтрока = "ПоступлениеТоваровУслуг";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.Размер КАК Размер,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры.Наименование КАК СННаименование,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК Дата
	|ПОМЕСТИТЬ Таб1
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата <= &Дата
	|	И ПоступлениеТоваровУслугТовары.Ссылка <> &ССЫЛКА
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
	|	И ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ПоступлениеТоваровУслугТовары.Размер = &Размер
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Размер,
	|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры.Наименование,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеПродукцииИзПроизводстваТовары.Номенклатура,
	|	ПоступлениеПродукцииИзПроизводстваТовары.ХарактеристикаНоменклатуры,
	|	ПоступлениеПродукцииИзПроизводстваТовары.Размер,
	|	ПоступлениеПродукцииИзПроизводстваТовары.СерияНоменклатуры.Наименование,
	|	ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ПоступлениеПродукцииИзПроизводства.Товары КАК ПоступлениеПродукцииИзПроизводстваТовары
	|ГДЕ
	|	ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.Дата <= &Дата
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Ссылка <> &ССЫЛКА
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.Проведен = ИСТИНА
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Номенклатура = &Номенклатура
	|	И ПоступлениеПродукцииИзПроизводстваТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Размер = &Размер
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеПродукцииИзПроизводстваТовары.Размер,
	|	ПоступлениеПродукцииИзПроизводстваТовары.ХарактеристикаНоменклатуры,
	|	ПоступлениеПродукцииИзПроизводстваТовары.СерияНоменклатуры.Наименование,
	|	ПоступлениеПродукцииИзПроизводстваТовары.Номенклатура,
	|	ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таб1.Номенклатура КАК Номенклатура,
	|	Таб1.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Таб1.Размер КАК Размер,
	|	Таб1.СННаименование КАК Наименование,
	|	Таб1.Дата КАК Дата
	|ИЗ
	|	Таб1 КАК Таб1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", ИсходныйДокумент.Дата);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//"ВЫБРАТЬ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СерииНоменклатуры.Наименование) КАК КоличествоНаименований
	//|ИЗ
	//|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	//|ГДЕ
	//|	СерииНоменклатуры.Владелец = &Номенклатура
	//|	И СерииНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	//|	И СерииНоменклатуры.Размер = &Размер
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СерииНоменклатуры.Наименование) = 1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СУММА(1) КАК КоличествоШтрихкодов,
	//|	СерииНоменклатуры.Наименование КАК Наименование
	//|ИЗ
	//|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	//|ГДЕ
	//|	СерииНоменклатуры.Владелец = &Номенклатура
	//|	И СерииНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	//|	И СерииНоменклатуры.Размер = &Размер
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СерииНоменклатуры.Наименование
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(1) > 1";
	
	//РезультатЗапроса = Запрос.ВыполнитьПакет();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	//	
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		ВозвращаемыйШтрихкод = ВыборкаДетальныеЗаписи.Наименование;
	//	КонецЕсли;	 
	//	
	//КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураИзДокумента);
	Запрос.УстановитьПараметр("ССЫЛКА", ИсходныйДокумент.Ссылка);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатурыИзДокумента);	
	Запрос.УстановитьПараметр("Размер", РазмерИзДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВозвращаемыйШтрихкод = ВыборкаДетальныеЗаписи.Наименование;
	КонецЦикла;
	
	Возврат ВозвращаемыйШтрихкод;

КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	Для каждого СтрокаТабличногоПоля Из ТабличноеПолеТовары Цикл
		Если ЗначениеЗаполнено(СтрокаТабличногоПоля.НовыйШтрихкод) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", СтрокаТабличногоПоля.Номенклатура);
			ПараметрыОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличногоПоля.ХарактеристикаНоменклатуры);
			ПараметрыОтбора.Вставить("Размер", СтрокаТабличногоПоля.Размер);
			НайденныеСтроки = ТоварыТаблица.НайтиСтроки(ПараметрыОтбора); 

			Если НайденныеСтроки.Количество() Тогда
				
				ПоказатьСообщение = Ложь;
				Для каждого НайденнаяСторка Из НайденныеСтроки Цикл
					Если НайденнаяСторка.СерияНоменклатуры <> Справочники.СерииНоменклатуры.ПустаяСсылка()
						И НайденнаяСторка.СерияНоменклатуры.Наименование <> СтрокаТабличногоПоля.НовыйШтрихкод Тогда
						
						ПоказатьСообщение = Истина;
						СерияНоменклатурыОбъект = НайденнаяСторка.СерияНоменклатуры.ПолучитьОбъект();
						СерияНоменклатурыОбъект.Наименование = СтрокаТабличногоПоля.НовыйШтрихкод;
						
						Попытка
							СерияНоменклатурыОбъект.Записать();
						Исключение
							ПоказатьСообщение = Ложь;
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при записи серии номенклатуры " + НайденнаяСторка.СерияНоменклатуры + ОписаниеОшибки();
							Сообщение.Сообщить();
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
				
				Если ПоказатьСообщение Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Установлен штрихкод " + СтрокаТабличногоПоля.НовыйШтрихкод + " для " + 
					СтрокаТабличногоПоля.Номенклатура + ", " +
					СтрокаТабличногоПоля.ХарактеристикаНоменклатуры + ", размер: " + СтрокаТабличногоПоля.Размер;
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Выполнение обработки завершено");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивТоваров") Тогда
		
		МассивТоваров = Параметры.МассивТоваров;
		
		Для Каждого ЭлементМассива Из МассивТоваров Цикл
			ЗаполнитьЗначенияСвойств(ТоварыТаблица.Добавить(), ЭлементМассива); 
		КонецЦикла;
		
		СчетчикСтрок = 0;
		ТоварыСвернутыеТаблица = ТоварыТаблица.Выгрузить();
		ТоварыСвернутыеТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Размер");
		Для каждого СтрокаТоварыСвернутые Из ТоварыСвернутыеТаблица Цикл
			НоваяСтрока = ТабличноеПолеТовары.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоварыСвернутые);
			НоваяСтрока.Артикул = СтрокаТоварыСвернутые.Номенклатура.Артикул;
			НоваяСтрока.Проба = СтрокаТоварыСвернутые.Номенклатура.Проба;
			СчетчикСтрок = СчетчикСтрок + 1;
			НоваяСтрока.НомерСтроки = СчетчикСтрок;
		КонецЦикла; 		
		
	КонецЕсли;
	
	Если Параметры.Свойство("ИсходныйДокумент") Тогда
		ИсходныйДокумент = Параметры.ИсходныйДокумент;
	КонецЕсли;

КонецПроцедуры
