
&НаКлиенте
Процедура ОтправитьДанныеВГИИСДМДК(Команда)
	
	Элементы.ГруппаОшибки.Видимость = Ложь;
	Для Каждого ТекущийЭлементСписка Из СписокОпераций Цикл
		Если Элементы["ПолеГалка"+ТекущийЭлементСписка.Значение].Картинка <> БиблиотекаКартинок.СостоянияРасширенийПодключено Тогда
			ОтправитьДанныеПоОперации("Описание"+ТекущийЭлементСписка.Значение, Истина);
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//ОбъектЗаписи = Объект.Ссылка.ПолучитьОбъект();
//ОбъектЗаписи.ПромежуточныеКомплекты.Очистить();

//СтруктураДляПоиска = Новый Структура("Очередь", 3); 
//ТабличнаяЧастьДок = ОбъектЗаписи.СписокЗапросов; 
//МассивПустыхСтрок = ТабличнаяЧастьДок.НайтиСтроки(СтруктураДляПоиска); 
//Для каждого Строка Из МассивПустыхСтрок Цикл 
//	ТабличнаяЧастьДок.Удалить(Строка); 
//КонецЦикла;

//СтруктураДляПоиска = Новый Структура("Очередь", 4); 
//ТабличнаяЧастьДок = ОбъектЗаписи.СписокЗапросов; 
//МассивПустыхСтрок = ТабличнаяЧастьДок.НайтиСтроки(СтруктураДляПоиска); 
//Для каждого Строка Из МассивПустыхСтрок Цикл 
//	ТабличнаяЧастьДок.Удалить(Строка); 
//КонецЦикла; 


////ОбъектЗаписи.СписокЗапросов.Удалить(237);
////ОбъектЗаписи.СписокЗапросов.Удалить(237);
////ОбъектЗаписи.СписокЗапросов.Удалить(237);
////ОбъектЗаписи.СписокЗапросов.Удалить(237);
//ОбъектЗаписи.Записать(РежимЗаписиДокумента.Запись);

//возврат;
	Если Не Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом 
		И Не Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие
		И Не Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Помощник реализован только для операций: преобразования в лом/комплектация изделий/разукомплектация изделий");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Если Не ДанныеЗаполненыКорректно() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИнтеграцияГИИСДМДК.ПолучитьСертификатыОрганизации(Объект.Организация, ЭтотОбъект);

	НастройкиПоОрганизации = РегистрыСведений.НастройкиОбменаГИИСДМДК.НастройкиПоОрганизации(Объект.Организация);
	
	ТаймаутМеждуПопытками = ?(НастройкиПоОрганизации.ТаймаутМеждуПопытками > 5, НастройкиПоОрганизации.ТаймаутМеждуПопытками, 5);
	КоличествоПопыток = ?(НастройкиПоОрганизации.КоличествоПопыток > 3, НастройкиПоОрганизации.КоличествоПопыток, 3);
	ПодписьНаСервере = НастройкиПоОрганизации.ПодписьНаСервере;
	ОтправкаНаСервере = НастройкиПоОрганизации.ОтправкаНаСервере;
	
	ДопустимоеКоличествоПартий = 55;
	
	Если Объект.СписокЗапросов.Количество() = 0 Тогда
		ЗаполнитьСпособОтправкиДанных();
		//ЗаполнитьСписокЗапросов();
	Иначе
		ОбновитьПромежуточныеКомплекты();
	КонецЕсли;
	Если Объект.ПараллельнаяОтправкаДанных = Истина Тогда
		ЗаполнитьСписокЗапросов();
	КонецЕсли;	
	
	ЗаполнитьСписокОпераций();
	                                 
	ЗаполнитьСтатусОпераций();
	
	СобственникИНН = Объект.Организация.ИНН;
	СобственникКПП = Объект.Организация.КПП;
	СобственникОГРН = Объект.Организация.ОГРН;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПромежуточныеКомплекты()
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИНПИзделия", "");
	СтрокиСМеталлом = Объект.Металл.НайтиСтроки(СтруктураПоиска);
	КоличествоСтрокМеталл = Объект.Металл.Количество() - СтрокиСМеталлом.Количество();
	Если ДопустимоеКоличествоПартий < Объект.Товары.Количество() + КоличествоСтрокМеталл 
		И Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
		НовСтр = Объект.ПромежуточныеКомплекты.Добавить();
		КоличествоВсего = 0;
		ВесВсего = 0;
		КоличествоСтрок = Объект.Товары.Количество();
		НужноЗаписать = Ложь;
		Для Каждого Стр Из Объект.Товары Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИНПИзделия", Стр.ИНП);
			ЕстьМеталл = Объект.Металл.НайтиСтроки(СтруктураПоиска);
			Если ЕстьМеталл.Количество() > 0 Тогда
				Если Стр.НомерСтрокиТаблЧасти <> 0 Тогда
					НужноЗаписать = Истина;
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("НомерСтроки", Стр.НомерСтрокиТаблЧасти);
					НужноУдалитьИзПромежуточныхКомплектов = Объект.ПромежуточныеКомплекты.НайтиСтроки(СтруктураПоиска);
					Если НужноУдалитьИзПромежуточныхКомплектов.Количество() > 0 Тогда
						Для Каждого НужноУдалитьИзПромежуточныхКомплектовСтрока Из НужноУдалитьИзПромежуточныхКомплектов Цикл
							Если НужноУдалитьИзПромежуточныхКомплектовСтрока.ИНП = Стр.ИНППреобразованияВЛом 
								Или НужноУдалитьИзПромежуточныхКомплектовСтрока.ИНП = Стр.ИНП Тогда 
								НужноУдалитьИзПромежуточныхКомплектовСтрока.Количество = НужноУдалитьИзПромежуточныхКомплектовСтрока.Количество - Стр.Количество;
								НужноУдалитьИзПромежуточныхКомплектовСтрока.Вес = НужноУдалитьИзПромежуточныхКомплектовСтрока.Вес - Стр.Вес;
								Если НужноУдалитьИзПромежуточныхКомплектовСтрока.Вес = 0 Тогда
									Объект.ПромежуточныеКомплекты.Удалить(НужноУдалитьИзПромежуточныхКомплектовСтрока);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;	
					КонецЕсли;
					Стр.НомерСтрокиТаблЧасти = 0;
				КонецЕсли;	
				Продолжить;
			КонецЕсли;
			Если Стр.НомерСтрокиТаблЧасти <> 0 Тогда
				Продолжить;
			КонецЕсли;	
			КоличествоВсего = КоличествоВсего + Стр.Количество;
			ВесВсего = ВесВсего + Стр.Вес;				
			Стр.НомерСтрокиТаблЧасти = НовСтр.НомерСтроки;
			Если Стр.НомерСтроки%ДопустимоеКоличествоПартий = 0 Тогда
				НовСтр.Количество = КоличествоВсего;
				НовСтр.Вес = ВесВсего;
				Если Стр.НомерСтроки <> КоличествоСтрок Тогда
					НовСтр = Объект.ПромежуточныеКомплекты.Добавить();
				КонецЕсли;
				КоличествоВсего = 0;
				ВесВсего = 0;
			КонецЕсли;
			НужноЗаписать = Истина;
		КонецЦикла;
		
		Если Стр.НомерСтроки%ДопустимоеКоличествоПартий <> 0 Тогда
			НовСтр.Количество = КоличествоВсего;
			НовСтр.Вес = ВесВсего;
		КонецЕсли;
		Если НовСтр.Вес = 0 Тогда
			Объект.ПромежуточныеКомплекты.Удалить(НовСтр);
		КонецЕсли;

		Если КоличествоСтрокМеталл > 0 Тогда
			
			НовСтр = Объект.ПромежуточныеКомплекты.Добавить();
			ВесВсего = 0;
			Для Каждого Стр Из Объект.Металл Цикл
				Если Стр.ИНПИзделия = "" Или Стр.НомерСтрокиТаблЧасти <> 0 Или Стр.Вес = 0 Тогда
					Продолжить;
				КонецЕсли;	
				ВесВсего = ВесВсего + Стр.Вес;				
				Стр.НомерСтрокиТаблЧасти = НовСтр.НомерСтроки;
				Если Стр.НомерСтроки%ДопустимоеКоличествоПартий = 0 Тогда
					НовСтр.Вес = ВесВсего;
					Если Стр.НомерСтроки <> КоличествоСтрок Тогда
						НовСтр = Объект.ПромежуточныеКомплекты.Добавить();
					КонецЕсли;
					КоличествоВсего = 0;
					ВесВсего = 0;
				КонецЕсли;
				НужноЗаписать = Истина;
			КонецЦикла;
			
			Если Стр.НомерСтроки%ДопустимоеКоличествоПартий <> 0 Тогда
				НовСтр.Количество = КоличествоВсего;
				НовСтр.Вес = ВесВсего;
			КонецЕсли;
			Если НовСтр.Вес = 0 Тогда
				Объект.ПромежуточныеКомплекты.Удалить(НовСтр);
			КонецЕсли;	
		КонецЕсли;
		
		Если НужноЗаписать Тогда
			ПараметрыЗаписи = Новый Структура;
    		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
			Записать(ПараметрыЗаписи);
		КонецЕсли;	
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпособОтправкиДанных()
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИмяМетода", "");
	ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
	Если ЕстьСтроки.Количество() = Объект.Товары.Количество()
		И Объект.ИмяМетода = "" Тогда
		Объект.ПараллельнаяОтправкаДанных = Истина;
		Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом 
			И Объект.Товары.Количество() > ДопустимоеКоличествоПартий Тогда
			НовСтр = Объект.ПромежуточныеКомплекты.Добавить();
			КоличествоВсего = 0;
			ВесВсего = 0;
			КоличествоСтрок = Объект.Товары.Количество();
			Для Каждого Стр Из Объект.Товары Цикл
				КоличествоВсего = КоличествоВсего + Стр.Количество;
				ВесВсего = ВесВсего + Стр.Вес;				
				Стр.НомерСтрокиТаблЧасти = НовСтр.НомерСтроки;
				Если Стр.НомерСтроки%ДопустимоеКоличествоПартий = 0 Тогда
					НовСтр.Количество = КоличествоВсего;
					НовСтр.Вес = ВесВсего;
					Если Стр.НомерСтроки <> КоличествоСтрок Тогда
						НовСтр = Объект.ПромежуточныеКомплекты.Добавить();
					КонецЕсли;
					КоличествоВсего = 0;
					ВесВсего = 0;
				КонецЕсли;
			КонецЦикла;	
			Если Стр.НомерСтроки%ДопустимоеКоличествоПартий <> 0 Тогда
				НовСтр.Количество = КоличествоВсего;
				НовСтр.Вес = ВесВсего;
			КонецЕсли;
		КонецЕсли;
		ПараметрыЗаписи = Новый Структура;
    	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОпераций()
	
	СписокОпераций.Очистить();
	Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИмяМетода", "");
		ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		Если ЕстьСтроки.Количество() = Объект.Товары.Количество()
			И Объект.ИмяМетода = "" И Объект.СписокЗапросов.Количество() = 0 Тогда
			Объект.ПараллельнаяОтправкаДанных = Истина;
		КонецЕсли;
		Если Объект.ПараллельнаяОтправкаДанных Тогда
			СписокОпераций.Добавить(1, "1. Проверить вид партии и собственника");
			СписокОпераций.Добавить(2, "2. Преобразование в металл");
			СписокОпераций.Добавить(3, "3. Получение информации о весе в хим.чистоте");
			Если (Объект.Товары.Количество() > ДопустимоеКоличествоПартий
				Или Объект.ПромежуточныеКомплекты.Количество() > 0) И Объект.ПараллельнаяОтправкаДанных Тогда
				СписокОпераций.Добавить(4, "4. Объединение в промежуточные партии лома");
				СписокОпераций.Добавить(5, "5. Получение информации по металлам");
				СписокОпераций.Добавить(6, "6. Объединение в одну партию лома");
				//СписокОпераций.Добавить(7, "7. Получение информации по камням");
			Иначе	
				СписокОпераций.Добавить(4, "4. Объединение в одну партию лома");
				//СписокОпераций.Добавить(5, "5. Получение информации по камням");
			КонецЕсли;
		Иначе
			СписокОпераций.Добавить(1, "1. Преобразование в металл");
			СписокОпераций.Добавить(2, "2. Получение информации о весе в хим.чистоте");
			СписокОпераций.Добавить(3, "3. Объединение в одну партию лома");
			//СписокОпераций.Добавить(4, "4. Получение информации по камням");
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
		СписокОпераций.Добавить(1, "1. Получение информации по весам");
		СписокОпераций.Добавить(2, "2. Получение УИН для комплекта");
		СписокОпераций.Добавить(3, "3. Создание комплекта");
		СписокОпераций.Добавить(4, "4. Получение информации по весу комплекта");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
		СписокОпераций.Добавить(1, "1. Разукомплектация");
	КонецЕсли;	
	
	СоздатьЭлементыНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыНаФорме()
	КоличествоЭлементовВСписке = СписокОпераций.Количество();
	Для Сч = 1 По КоличествоЭлементовВСписке Цикл
		ТекущийЭлементСписка = СписокОпераций.Получить(Сч-1);
		ГруппаОперация = ЭтаФорма.Элементы.Найти("ГруппаОперация"+Сч);
		Если ГруппаОперация = Неопределено Тогда
			ГруппаОперация = ЭтаФорма.Элементы.Вставить("ГруппаОперация"+Сч, Тип("ГруппаФормы"),,Элементы.ГруппаОшибки);
		КонецЕсли;
		ГруппаОперация.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОперация.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаОперация.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаОперация.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = ЭтаФорма.Элементы.Найти("ПолеГалка"+Сч);
		Если НовыйЭлемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ПолеГалка"+Сч, Тип("ДекорацияФормы"), ГруппаОперация);
		КонецЕсли;
		НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
		НовыйЭлемент.Ширина = 2;
		НовыйЭлемент.Высота = 1;
		
		НовыйЭлемент = ЭтаФорма.Элементы.Найти("Описание"+Сч);
		Если НовыйЭлемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Описание"+Сч, Тип("ДекорацияФормы"), ГруппаОперация);
		КонецЕсли;
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = ТекущийЭлементСписка.Представление;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.УстановитьДействие("Нажатие", "ОписаниеНажатие");
		
		НовыйЭлемент = ЭтаФорма.Элементы.Найти("ТекущееСостояние"+Сч);
		Если НовыйЭлемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ТекущееСостояние"+Сч, Тип("ДекорацияФормы"), ГруппаОперация);
		КонецЕсли;
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "";
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтатусОпераций()
	Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
		ЗаполнитьСтатусОперацийПреобразованиеВЛом();
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
		ЗаполнитьСтатусОперацийПреобразованиеВЛом();
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
		ЗаполнитьСтатусОперацийПреобразованиеВЛом();	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусОперацийПреобразованиеВЛом()
	
	Если Объект.ПараллельнаяОтправкаДанных Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВЫБОР
		                      |		КОГДА СписокЗапросов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
		                      |			ТОГДА 1
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК КоличествоУспех,
		                      |	1 КАК КоличествоВсего,
		                      |	ВЫБОР
		                      |		КОГДА СписокЗапросов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Ошибка)
		                      |			ТОГДА 1
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК КоличествоОшибка,
		                      |	ВЫБОР
		                      |		КОГДА СписокЗапросов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ОжиданиеОтвета)
		                      |			ТОГДА 1
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК КоличествоОжиданиеОтвета,
		                      |	СписокЗапросов.Очередь КАК Очередь
		                      |ПОМЕСТИТЬ СписокЗапросов
		                      |ИЗ
		                      |	&СписокЗапросов КАК СписокЗапросов
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	СУММА(СписокЗапросов.КоличествоУспех) КАК КоличествоУспех,
		                      |	СУММА(СписокЗапросов.КоличествоВсего) КАК КоличествоВсего,
		                      |	СУММА(СписокЗапросов.КоличествоОшибка) КАК КоличествоОшибка,
		                      |	СУММА(СписокЗапросов.КоличествоОжиданиеОтвета) КАК КоличествоОжиданиеОтвета,
		                      |	СписокЗапросов.Очередь КАК Очередь
		                      |ИЗ
		                      |	СписокЗапросов КАК СписокЗапросов
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	СписокЗапросов.Очередь
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Очередь");
		
		Запрос.УстановитьПараметр("СписокЗапросов", Объект.СписокЗапросов.Выгрузить());
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьСостояниеПараллельнаяОтправкаДанных(Выборка, Выборка.Очередь);			
		КонецЦикла;
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СписокЗапросов.ИНП КАК ИНП,
	                      |	СписокЗапросов.Статус КАК Статус,
	                      |	СписокЗапросов.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	СписокЗапросов.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	СписокЗапросов.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	                      |	СписокЗапросов.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                      |	СписокЗапросов.ИмяМетода КАК ИмяМетода
	                      |ПОМЕСТИТЬ СписокЗапросовПреобразование
	                      |ИЗ
	                      |	&СписокЗапросов КАК СписокЗапросов
	                      |ГДЕ
	                      |	(СписокЗапросов.ИмяМетода = """"
	                      |			ИЛИ СписокЗапросов.ИмяМетода = ""SendBatchConvert""
	                      |			ИЛИ СписокЗапросов.ИмяМетода = ""CheckBatchConvert"")
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПреобразование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоУспех,
	                      |	СУММА(1) КАК КоличествоВсего,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПреобразование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Ошибка)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоОшибка,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПреобразование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ОжиданиеОтвета)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоОжиданиеОтвета
	                      |ИЗ
	                      |	СписокЗапросовПреобразование КАК СписокЗапросовПреобразование
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокЗапросов.ИНП КАК ИНП,
	                      |	СписокЗапросов.Статус КАК Статус,
	                      |	СписокЗапросов.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	СписокЗапросов.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	СписокЗапросов.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	                      |	СписокЗапросов.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                      |	СписокЗапросов.ИмяМетода КАК ИмяМетода
	                      |ПОМЕСТИТЬ СписокЗапросовПолучениеХимЧистоты
	                      |ИЗ
	                      |	&СписокЗапросов КАК СписокЗапросов
	                      |ГДЕ
	                      |	(СписокЗапросов.ИмяМетода = ""SendGetBatch""
	                      |			ИЛИ СписокЗапросов.ИмяМетода = ""CheckGetBatch"")
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПолучениеХимЧистоты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоУспех,
	                      |	СУММА(1) КАК КоличествоВсего,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПолучениеХимЧистоты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Ошибка)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоОшибка,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПолучениеХимЧистоты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ОжиданиеОтвета)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоОжиданиеОтвета
	                      |ИЗ
	                      |	СписокЗапросовПолучениеХимЧистоты КАК СписокЗапросовПолучениеХимЧистоты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокЗапросов.ИНП КАК ИНП,
	                      |	СписокЗапросов.Статус КАК Статус,
	                      |	СписокЗапросов.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	СписокЗапросов.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	СписокЗапросов.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	                      |	СписокЗапросов.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                      |	СписокЗапросов.ИмяМетода КАК ИмяМетода
	                      |ПОМЕСТИТЬ СписокЗапросовОбъединение
	                      |ИЗ
	                      |	&СписокЗапросов КАК СписокЗапросов
	                      |ГДЕ
	                      |	СписокЗапросов.ИмяТабличнойЧасти = """"
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовОбъединение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоУспех,
	                      |	СУММА(1) КАК КоличествоВсего,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовОбъединение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Ошибка)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоОшибка,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовОбъединение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ОжиданиеОтвета)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоОжиданиеОтвета
	                      |ИЗ
	                      |	СписокЗапросовОбъединение КАК СписокЗапросовОбъединение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокЗапросов.ИНП КАК ИНП,
	                      |	СписокЗапросов.Статус КАК Статус,
	                      |	СписокЗапросов.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	СписокЗапросов.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	СписокЗапросов.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	                      |	СписокЗапросов.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                      |	СписокЗапросов.ИмяМетода КАК ИмяМетода
	                      |ПОМЕСТИТЬ СписокЗапросовПоКамням
	                      |ИЗ
	                      |	&СписокЗапросов КАК СписокЗапросов
	                      |ГДЕ
	                      |	СписокЗапросов.ИмяТабличнойЧасти = ""Камни""
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПоКамням.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоУспех,
	                      |	СУММА(1) КАК КоличествоВсего,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПоКамням.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Ошибка)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоОшибка,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА СписокЗапросовПоКамням.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ОжиданиеОтвета)
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоОжиданиеОтвета
	                      |ИЗ
	                      |	СписокЗапросовПоКамням КАК СписокЗапросовПоКамням" );
		Запрос.УстановитьПараметр("СписокЗапросов", Объект.СписокЗапросов.Выгрузить());
		Результат = Запрос.ВыполнитьПакет();
		
		ВыборкаОбъединение = Результат[5].Выбрать();
		Пока ВыборкаОбъединение.Следующий() Цикл
			ЗаполнитьСостояние(ВыборкаОбъединение, 3);			
		КонецЦикла;
		
		Если Элементы.ПолеГалка3.Картинка = БиблиотекаКартинок.СостоянияРасширенийПодключено
			Или Элементы.ПолеГалка3.Картинка = БиблиотекаКартинок.СинхронизацияДанныхВыполнение Тогда
			Элементы.ПолеГалка1.Картинка = БиблиотекаКартинок.СостоянияРасширенийПодключено;
			Элементы.ТекущееСостояние1.Заголовок = "Данные успешно отправлены";
		Иначе
			ВыборкаПреобразование = Результат[1].Выбрать();
			Пока ВыборкаПреобразование.Следующий() Цикл
				ЗаполнитьСостояние(ВыборкаПреобразование, 1);			
			КонецЦикла;
		КонецЕсли;
		Если Элементы.ПолеГалка3.Картинка = БиблиотекаКартинок.СостоянияРасширенийПодключено 
			Или Элементы.ПолеГалка3.Картинка = БиблиотекаКартинок.СинхронизацияДанныхВыполнение Тогда
			Элементы.ПолеГалка2.Картинка = БиблиотекаКартинок.СостоянияРасширенийПодключено;
			Элементы.ТекущееСостояние2.Заголовок = "Данные успешно отправлены";
		Иначе
			ВыборкаПолучениеХимЧистоты = Результат[3].Выбрать();
			Пока ВыборкаПолучениеХимЧистоты.Следующий() Цикл			
				ЗаполнитьСостояние(ВыборкаПолучениеХимЧистоты, 2);
			КонецЦикла;
		КонецЕсли;

		ВыборкаПолучениеКамней = Результат[7].Выбрать();
		Пока ВыборкаПолучениеКамней.Следующий() Цикл
			Если ВыборкаПолучениеКамней.КоличествоВсего = NULL Тогда
				Элементы.ПолеГалка4.Картинка = БиблиотекаКартинок.СостоянияРасширенийПодключено;
				Элементы.ТекущееСостояние4.Заголовок = "Не требуется";
			Иначе	
				ЗаполнитьСостояние(ВыборкаПолучениеКамней, 4);
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостояниеПараллельнаяОтправкаДанных(ВыборкаДанных, НомерОперации)
	Если ВыборкаДанных.КоличествоВсего = ВыборкаДанных.КоличествоУспех Тогда
		Элементы["ПолеГалка"+НомерОперации].Картинка = БиблиотекаКартинок.СостоянияРасширенийПодключено;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Данные успешно отправлены";
	ИначеЕсли ВыборкаДанных.КоличествоОшибка = 0
		И ВыборкаДанных.КоличествоУспех = 0 И ВыборкаДанных.КоличествоОжиданиеОтвета = 0 Тогда
		Элементы["ПолеГалка"+НомерОперации].Картинка = Новый Картинка;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Данные не отправлялись";
	ИначеЕсли ВыборкаДанных.КоличествоОжиданиеОтвета > 0 И ВыборкаДанных.КоличествоОшибка = 0 Тогда
		Элементы["ПолеГалка"+НомерОперации].Картинка = БиблиотекаКартинок.СинхронизацияДанныхВыполнение;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Ожидание ответа от ГИИС ДМДК";
	ИначеЕсли ВыборкаДанных.КоличествоОшибка > 0 Тогда
		Элементы["ПолеГалка"+НомерОперации].Картинка = БиблиотекаКартинок.Остановить;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Есть ошибки при отправке данных";
	Иначе
		Элементы["ПолеГалка"+НомерОперации].Картинка = БиблиотекаКартинок.СинхронизацияДанныхВыполнение;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Ожидание ответа от ГИИС ДМДК";
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостояние(ВыборкаДанных, НомерОперации)
	Если ВыборкаДанных.КоличествоВсего <> NULL И ВыборкаДанных.КоличествоВсего = ВыборкаДанных.КоличествоУспех Тогда
		Элементы["ПолеГалка"+НомерОперации].Картинка = БиблиотекаКартинок.СостоянияРасширенийПодключено;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Данные успешно отправлены";
	ИначеЕсли ВыборкаДанных.КоличествоВсего = NULL Или ВыборкаДанных.КоличествоОшибка = 0
		И ВыборкаДанных.КоличествоУспех = 0 И ВыборкаДанных.КоличествоОжиданиеОтвета = 0 Тогда
		Элементы["ПолеГалка"+НомерОперации].Картинка = Новый Картинка;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Данные не отправлялись";
	ИначеЕсли ВыборкаДанных.КоличествоВсего <> NULL 
		И ВыборкаДанных.КоличествоОжиданиеОтвета = ВыборкаДанных.КоличествоВсего Тогда
		Элементы["ПолеГалка"+НомерОперации].Картинка = БиблиотекаКартинок.СинхронизацияДанныхВыполнение;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Ожидание ответа от ГИИС ДМДК";
	Иначе
		Элементы["ПолеГалка"+НомерОперации].Картинка = БиблиотекаКартинок.Остановить;
		Элементы["ТекущееСостояние"+НомерОперации].Заголовок = "Есть ошибки при отправке данных";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗапросовПреобразованиеВЛом()
	
	Если Объект.ПараллельнаяОтправкаДанных Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	""Товары"" КАК ИмяТабличнойЧасти,
		                      |	КомплектацияТоваровТовары.НомерСтроки КАК НомерСтрокиТаблЧасти,
		                      |	КомплектацияТоваровТовары.ИНП КАК ИНП,
		                      |	""SendGetBatch"" КАК ИмяМетода,
		                      |	1 КАК Очередь,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
		                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
		                      |	КОНЕЦ КАК Статус,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
		                      |	КОНЕЦ КАК ОписаниеОшибки,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
		                      |	КОНЕЦ КАК ИдентификаторЗапроса
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
		                      |		ПО КомплектацияТоваровТовары.ИНП = КомплектацияТоваровСписокЗапросов.ИНП
		                      |			И (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendGetBatch"")
		                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 1)
		                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
		                      |ГДЕ
		                      |	КомплектацияТоваровТовары.Ссылка = &Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	КомплектацияТоваровТовары.НомерСтроки КАК НомерСтрокиТаблЧасти,
		                      |	КомплектацияТоваровТовары.ИНП КАК ИНП,
		                      |	""SendBatchConvert"" КАК ИмяМетода,
		                      |	2 КАК Очередь,
		                      |	""Товары"" КАК ИмяТабличнойЧасти,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
		                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
		                      |	КОНЕЦ КАК Статус,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
		                      |	КОНЕЦ КАК ОписаниеОшибки,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
		                      |	КОНЕЦ КАК ИдентификаторЗапроса
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
		                      |		ПО КомплектацияТоваровТовары.ИНП = КомплектацияТоваровСписокЗапросов.ИНП
		                      |			И (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendBatchConvert"")
		                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 2)
		                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
		                      |ГДЕ
		                      |	КомплектацияТоваровТовары.Ссылка = &Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	""Товары"" КАК ИмяТабличнойЧасти,
		                      |	КомплектацияТоваровТовары.НомерСтроки КАК НомерСтрокиТаблЧасти,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровТовары.ИНППреобразованияВЛом = """"
		                      |			ТОГДА КомплектацияТоваровТовары.ИНП
		                      |		ИНАЧЕ КомплектацияТоваровТовары.ИНППреобразованияВЛом
		                      |	КОНЕЦ КАК ИНП,
		                      |	""SendGetBatch"" КАК ИмяМетода,
		                      |	3 КАК Очередь,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
		                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
		                      |	КОНЕЦ КАК Статус,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
		                      |	КОНЕЦ КАК ОписаниеОшибки,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
		                      |	КОНЕЦ КАК ИдентификаторЗапроса
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
		                      |		ПО (КомплектацияТоваровТовары.ИНП = КомплектацияТоваровСписокЗапросов.ИНП
		                      |				ИЛИ КомплектацияТоваровТовары.ИНППреобразованияВЛом = КомплектацияТоваровСписокЗапросов.ИНП)
		                      |			И (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendGetBatch"")
		                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 3)
		                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
		                      |			И (КомплектацияТоваровСписокЗапросов.ИмяТабличнойЧасти = ""Товары"")
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.Металл КАК КомплектацияТоваровМеталл
		                      |		ПО КомплектацияТоваровТовары.ИНП = КомплектацияТоваровМеталл.ИНПИзделия
		                      |ГДЕ
		                      |	КомплектацияТоваровТовары.Ссылка = &Ссылка
		                      |	И КомплектацияТоваровМеталл.ИНПИзделия ЕСТЬ NULL
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	""Металл"",
		                      |	КомплектацияТоваровМеталл.НомерСтроки,
		                      |	КомплектацияТоваровМеталл.ИНП,
		                      |	""SendGetBatch"",
		                      |	3,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
		                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
		                      |	КОНЕЦ,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
		                      |	КОНЕЦ,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
		                      |	КОНЕЦ
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.Металл КАК КомплектацияТоваровМеталл
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
		                      |		ПО (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendGetBatch"")
		                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 3)
		                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
		                      |			И (КомплектацияТоваровСписокЗапросов.ИмяТабличнойЧасти = ""Металл"")
		                      |			И КомплектацияТоваровМеталл.ИНП = КомплектацияТоваровСписокЗапросов.ИНП
		                      |ГДЕ
		                      |	КомплектацияТоваровМеталл.Ссылка = &Ссылка
		                      |	И КомплектацияТоваровМеталл.ИНПИзделия <> """"
		                      |	И КомплектацияТоваровМеталл.ИНП <> """"
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	КомплектацияТоваровПромежуточныеКомплекты.ИНП КАК ИНП,
		                      |	""SendBatchUnion"" КАК ИмяМетода,
		                      |	КомплектацияТоваровПромежуточныеКомплекты.НомерСтроки КАК НомерСтрокиТаблЧасти,
		                      |	""ПромежуточныеКомплекты"" КАК ИмяТабличнойЧасти,
		                      |	4 КАК Очередь,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
		                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
		                      |	КОНЕЦ КАК Статус,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
		                      |	КОНЕЦ КАК ОписаниеОшибки,
		                      |	ВЫБОР
		                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
		                      |			ТОГДА """"
		                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
		                      |	КОНЕЦ КАК ИдентификаторЗапроса
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.ПромежуточныеКомплекты КАК КомплектацияТоваровПромежуточныеКомплекты
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
		                      |		ПО (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendBatchUnion"")
		                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 4)
		                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
		                      |			И КомплектацияТоваровПромежуточныеКомплекты.НомерСтроки = КомплектацияТоваровСписокЗапросов.НомерСтрокиТаблЧасти
		                      |ГДЕ
		                      |	КомплектацияТоваровПромежуточныеКомплекты.Ссылка = &Ссылка
		                      |	И &ЕстьПромежуточныеКомплекты = ИСТИНА
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	""ПромежуточныеКомплекты"" КАК ИмяТабличнойЧасти,
		                      |	КомплектацияТоваровПромежуточныеКомплекты.НомерСтроки КАК НомерСтрокиТаблЧасти,
		                      |	КомплектацияТоваровПромежуточныеКомплекты.ИНП КАК ИНП,
		                      |	""SendGetBatch"" КАК ИмяМетода,
		                      |	5 КАК Очередь,
		                      |	КомплектацияТоваровСписокЗапросов.Статус КАК Статус,
		                      |	КомплектацияТоваровСписокЗапросов.ОписаниеОшибки КАК ОписаниеОшибки,
		                      |	КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса КАК ИдентификаторЗапроса
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.ПромежуточныеКомплекты КАК КомплектацияТоваровПромежуточныеКомплекты
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
		                      |		ПО (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendGetBatch"")
		                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 5)
		                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
		                      |			И КомплектацияТоваровПромежуточныеКомплекты.НомерСтроки = КомплектацияТоваровСписокЗапросов.НомерСтрокиТаблЧасти
		                      |ГДЕ
		                      |	КомплектацияТоваровПромежуточныеКомплекты.Ссылка = &Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	КомплектацияТоваров.ИНП КАК ИНП,
		                      |	""SendBatchUnion"" КАК ИмяМетода,
		                      |	0 КАК НомерСтрокиТаблЧасти,
		                      |	"""" КАК ИмяТабличнойЧасти,
		                      |	ВЫБОР
		                      |		КОГДА &ЕстьПромежуточныеКомплекты
		                      |			ТОГДА 6
		                      |		ИНАЧЕ 4
		                      |	КОНЕЦ КАК Очередь,
		                      |	КомплектацияТоваровСписокЗапросов.Статус КАК Статус,
		                      |	КомплектацияТоваровСписокЗапросов.ОписаниеОшибки КАК ОписаниеОшибки,
		                      |	КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса КАК ИдентификаторЗапроса
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
		                      |		ПО КомплектацияТоваров.ИНП = КомплектацияТоваровСписокЗапросов.ИНП
		                      |			И (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendBatchUnion"")
		                      |			И (ВЫБОР
		                      |				КОГДА &ЕстьПромежуточныеКомплекты
		                      |					ТОГДА КомплектацияТоваровСписокЗапросов.Очередь = 6
		                      |				ИНАЧЕ КомплектацияТоваровСписокЗапросов.Очередь = 4
		                      |			КОНЕЦ)
		                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
		                      |ГДЕ
		                      |	КомплектацияТоваров.Ссылка = &Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	КомплектацияТоваровКамни.ИНП КАК ИНП,
		                      |	""Камни"" КАК ИмяТабличнойЧасти,
		                      |	КомплектацияТоваровКамни.НомерСтроки КАК НомерСтрокиТаблЧасти,
		                      |	ВЫБОР
		                      |		КОГДА &ЕстьПромежуточныеКомплекты
		                      |			ТОГДА 7
		                      |		ИНАЧЕ 5
		                      |	КОНЕЦ КАК Очередь,
		                      |	""SendGetBatch"" КАК ИмяМетода,
		                      |	КомплектацияТоваровСписокЗапросов.Статус КАК Статус,
		                      |	КомплектацияТоваровСписокЗапросов.ОписаниеОшибки КАК ОписаниеОшибки,
		                      |	КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса КАК ИдентификаторЗапроса
		                      |ИЗ
		                      |	Документ.ПреобразованиеВЛом.Камни КАК КомплектацияТоваровКамни
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПреобразованиеВЛом.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
		                      |		ПО КомплектацияТоваровКамни.ИНП = КомплектацияТоваровСписокЗапросов.ИНП
		                      |			И (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendGetBatch"")
		                      |			И (ВЫБОР
		                      |				КОГДА &ЕстьПромежуточныеКомплекты
		                      |					ТОГДА КомплектацияТоваровСписокЗапросов.Очередь = 7
		                      |				ИНАЧЕ КомплектацияТоваровСписокЗапросов.Очередь = 5
		                      |			КОНЕЦ)
		                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
		                      |ГДЕ
		                      |	КомплектацияТоваровКамни.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("ЕстьПромежуточныеКомплекты", Объект.ПромежуточныеКомплекты.Количество() > 0);
		Результат = Запрос.ВыполнитьПакет();	
		КоличествоПакетов = Результат.Количество();
		Объект.СписокЗапросов.Очистить();
		Для Сч = 1 По КоличествоПакетов Цикл
			ВыборкаДанных = Результат[Сч-1].Выбрать();
			Пока ВыборкаДанных.Следующий() Цикл
				НовыйЗапрос = Объект.СписокЗапросов.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЗапрос, ВыборкаДанных);	
				//НовыйЗапрос.Статус = ИнтеграцияГИИСДМДК.СтатусНеОтправлено();
				//НовыйЗапрос.ОписаниеОшибки = "";
				//НовыйЗапрос.ИдентификаторЗапроса = "";
			КонецЦикла;
		КонецЦикла;
	Иначе	
		Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	""Товары"" КАК ИмяТабличнойЧасти,
	                      |	КомплектацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	                      |	КомплектацияТоваровТовары.ИНП КАК ИНП,
	                      |	КомплектацияТоваровТовары.ИмяМетода КАК ИмяМетода,
	                      |	ВЫБОР
	                      |		КОГДА (КомплектацияТоваровТовары.ИмяМетода = ""SendGetBatch""
	                      |				ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""CheckGetBatch""
	                      |				ИЛИ КомплектацияТоваровТовары.ИмяМетода = """")
	                      |				И КомплектацияТоваровТовары.ИНППреобразованияВЛом = """"
	                      |			ТОГДА КомплектацияТоваровТовары.СтатусЗапроса
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                      |	КОНЕЦ КАК СтатусЗапроса,
	                      |	КомплектацияТоваровТовары.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	КомплектацияТоваровТовары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	1 КАК Очередь
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
	                      |ГДЕ
	                      |	КомплектацияТоваровТовары.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КомплектацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	                      |	КомплектацияТоваровТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	                      |	КомплектацияТоваровТовары.ИНП КАК ИНП,
	                      |	КомплектацияТоваровТовары.ВесВХимЧистоте КАК ВесВХимЧистоте,
	                      |	КомплектацияТоваровТовары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                      |	КомплектацияТоваровТовары.ВесВХимЧистотеГИИСДМДК КАК ВесВХимЧистотеГИИСДМДК,
	                      |	КомплектацияТоваровТовары.ИмяМетода КАК ИмяМетода,
	                      |	КомплектацияТоваровТовары.СтатусЗапроса КАК СтатусЗапроса,
	                      |	КомплектацияТоваровТовары.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	КомплектацияТоваровТовары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	2 КАК Очередь
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
	                      |ГДЕ
	                      |	КомплектацияТоваровТовары.Ссылка = &Ссылка
	                      |	И (КомплектацияТоваровТовары.ИмяМетода = """"
	                      |				И &ПараллельнаяОтправкаДанных = ЛОЖЬ
	                      |			ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""SendBatchConvert""
	                      |			ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""CheckBatchConvert""
	                      |			ИЛИ КомплектацияТоваровТовары.ИНППреобразованияВЛом <> """")
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	""Товары"" КАК ИмяТабличнойЧасти,
	                      |	КомплектацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	                      |	КомплектацияТоваровТовары.ИНП КАК ИНП,
	                      |	КомплектацияТоваровТовары.ИмяМетода КАК ИмяМетода,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровТовары.ИмяМетода = ""SendBatchUnion""
	                      |				ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""CheckBatchUnion""
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                      |		ИНАЧЕ КомплектацияТоваровТовары.СтатусЗапроса
	                      |	КОНЕЦ КАК СтатусЗапроса,
	                      |	КомплектацияТоваровТовары.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	КомплектацияТоваровТовары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	3 КАК Очередь
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
	                      |ГДЕ
	                      |	КомплектацияТоваровТовары.Ссылка = &Ссылка
	                      |	И (КомплектацияТоваровТовары.ИмяМетода = ""CheckGetBatch""
	                      |			ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""SendGetBatch""
	                      |			ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""SendBatchUnion""
	                      |			ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""CheckBatchUnion"")
	                      |	И КомплектацияТоваровТовары.ИНППреобразованияВЛом <> """"
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	""Металл"",
	                      |	КомплектацияТоваровМеталл.НомерСтроки,
	                      |	КомплектацияТоваровМеталл.ИНП,
	                      |	""SendGetBatch"",
	                      |	КомплектацияТоваровМеталл.СтатусЗапроса,
	                      |	КомплектацияТоваровМеталл.ОписаниеОшибки,
	                      |	КомплектацияТоваровМеталл.ИдентификаторЗапроса,
	                      |	3
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом.Металл КАК КомплектацияТоваровМеталл
	                      |ГДЕ
	                      |	КомплектацияТоваровМеталл.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КомплектацияТоваров.ИНП КАК ИНП,
	                      |	КомплектацияТоваров.ИмяМетода КАК ИмяМетода,
	                      |	КомплектацияТоваров.СтатусЗапроса КАК СтатусЗапроса,
	                      |	КомплектацияТоваров.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	КомплектацияТоваров.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	0 КАК НомерСтроки,
	                      |	"""" КАК ИмяТабличнойЧасти,
	                      |	4 КАК Очередь
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров
	                      |ГДЕ
	                      |	КомплектацияТоваров.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КомплектацияТоваровКамни.ИНП КАК ИНП,
	                      |	КомплектацияТоваровКамни.СтатусЗапроса КАК СтатусЗапроса,
	                      |	КомплектацияТоваровКамни.ОписаниеОшибки КАК ОписаниеОшибки,
	                      |	КомплектацияТоваровКамни.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                      |	""Камни"" КАК ИмяТабличнойЧасти,
	                      |	КомплектацияТоваровКамни.НомерСтроки КАК НомерСтроки,
	                      |	5 КАК Очередь
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом.Камни КАК КомплектацияТоваровКамни
	                      |ГДЕ
	                      |	КомплектацияТоваровКамни.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПараллельнаяОтправкаДанных", Объект.ПараллельнаяОтправкаДанных);
	
	Объект.СписокЗапросов.Очистить();
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаПолучениеВидПартииСобственник = Результат[0].Выбрать();
	Пока ВыборкаПолучениеВидПартииСобственник.Следующий() Цикл
		НовыйЗапрос = Объект.СписокЗапросов.Добавить();
		НовыйЗапрос.ИмяТабличнойЧасти = ВыборкаПолучениеВидПартииСобственник.ИмяТабличнойЧасти;
		НовыйЗапрос.НомерСтрокиТаблЧасти = ВыборкаПолучениеВидПартииСобственник.НомерСтроки;
		НовыйЗапрос.ИНП = ВыборкаПолучениеВидПартииСобственник.ИНП;
		Если ВыборкаПолучениеВидПартииСобственник.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			НовыйЗапрос.Статус = ИнтеграцияГИИСДМДК.СтатусУспех();
			НовыйЗапрос.ОписаниеОшибки = "";
			НовыйЗапрос.ИдентификаторЗапроса = "";	
		Иначе	
			НовыйЗапрос.Статус = ВыборкаПолучениеВидПартииСобственник.СтатусЗапроса;
			НовыйЗапрос.ОписаниеОшибки = ВыборкаПолучениеВидПартииСобственник.ОписаниеОшибки;
			НовыйЗапрос.ИдентификаторЗапроса = ВыборкаПолучениеВидПартииСобственник.ИдентификаторЗапроса;
		КонецЕсли;
		НовыйЗапрос.ИмяМетода = "SendGetBatch";
		НовыйЗапрос.Очередь = ВыборкаПолучениеВидПартииСобственник.Очередь;
	КонецЦикла;	
	
	ВыборкаПреобразованиеВлом = Результат[1].Выбрать();
	Пока ВыборкаПреобразованиеВлом.Следующий() Цикл
		НовыйЗапрос = Объект.СписокЗапросов.Добавить();
		НовыйЗапрос.ИмяТабличнойЧасти = "Товары";
		НовыйЗапрос.НомерСтрокиТаблЧасти = ВыборкаПреобразованиеВЛом.НомерСтроки;
		НовыйЗапрос.ИНП = ВыборкаПреобразованиеВЛом.ИНППреобразованияВЛом;
		Если ВыборкаПреобразованиеВлом.ИНППреобразованияВЛом <> "" Тогда
			НовыйЗапрос.Статус = ИнтеграцияГИИСДМДК.СтатусУспех();
			НовыйЗапрос.ОписаниеОшибки = "";
			НовыйЗапрос.ИдентификаторЗапроса = "";	
			НовыйЗапрос.ИмяМетода = "SendBatchConvert";
		Иначе	
			НовыйЗапрос.Статус = ВыборкаПреобразованиеВЛом.СтатусЗапроса;
			НовыйЗапрос.ОписаниеОшибки = ВыборкаПреобразованиеВЛом.ОписаниеОшибки;
			НовыйЗапрос.ИдентификаторЗапроса = ВыборкаПреобразованиеВЛом.ИдентификаторЗапроса;
			Если ВыборкаПреобразованиеВлом.ИмяМетода = "" Тогда
				НовыйЗапрос.ИмяМетода = "SendBatchConvert";
			Иначе	
				НовыйЗапрос.ИмяМетода = ВыборкаПреобразованиеВлом.ИмяМетода;
			КонецЕсли;	
		КонецЕсли;
		НовыйЗапрос.Очередь = ВыборкаПреобразованиеВлом.Очередь;
	КонецЦикла;	
	
	ВыборкаПолучениеВесаХимЧистоты = Результат[2].Выбрать();
	Пока ВыборкаПолучениеВесаХимЧистоты.Следующий() Цикл
		НовыйЗапрос = Объект.СписокЗапросов.Добавить();
		НовыйЗапрос.ИмяТабличнойЧасти = ВыборкаПолучениеВесаХимЧистоты.ИмяТабличнойЧасти;
		НовыйЗапрос.НомерСтрокиТаблЧасти = ВыборкаПолучениеВесаХимЧистоты.НомерСтроки;
		НовыйЗапрос.ИНП = ВыборкаПолучениеВесаХимЧистоты.ИНП;
		Если ВыборкаПолучениеВесаХимЧистоты.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			НовыйЗапрос.Статус = ИнтеграцияГИИСДМДК.СтатусУспех();
			НовыйЗапрос.ОписаниеОшибки = "";
			НовыйЗапрос.ИдентификаторЗапроса = "";	
		Иначе	
			НовыйЗапрос.Статус = ВыборкаПолучениеВесаХимЧистоты.СтатусЗапроса;
			НовыйЗапрос.ОписаниеОшибки = ВыборкаПолучениеВесаХимЧистоты.ОписаниеОшибки;
			НовыйЗапрос.ИдентификаторЗапроса = ВыборкаПолучениеВесаХимЧистоты.ИдентификаторЗапроса;
		КонецЕсли;
		НовыйЗапрос.ИмяМетода = "SendGetBatch";
		НовыйЗапрос.Очередь = ВыборкаПолучениеВесаХимЧистоты.Очередь;
	КонецЦикла;	
	
	ВыборкаОбъединениеВОднуПартию = Результат[3].Выбрать();
	Пока ВыборкаОбъединениеВОднуПартию.Следующий() Цикл
		НовыйЗапрос = Объект.СписокЗапросов.Добавить();
		НовыйЗапрос.ИмяТабличнойЧасти = ВыборкаОбъединениеВОднуПартию.ИмяТабличнойЧасти;
		НовыйЗапрос.НомерСтрокиТаблЧасти = ВыборкаОбъединениеВОднуПартию.НомерСтроки;
		НовыйЗапрос.ИНП = ВыборкаОбъединениеВОднуПартию.ИНП;
		Если ВыборкаОбъединениеВОднуПартию.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			НовыйЗапрос.Статус = ИнтеграцияГИИСДМДК.СтатусУспех();
			НовыйЗапрос.ОписаниеОшибки = "";
			НовыйЗапрос.ИдентификаторЗапроса = "";	
		Иначе	
			НовыйЗапрос.Статус = ВыборкаОбъединениеВОднуПартию.СтатусЗапроса;
			НовыйЗапрос.ОписаниеОшибки = ВыборкаОбъединениеВОднуПартию.ОписаниеОшибки;
			НовыйЗапрос.ИдентификаторЗапроса = ВыборкаОбъединениеВОднуПартию.ИдентификаторЗапроса;
		КонецЕсли;
		НовыйЗапрос.ИмяМетода = "SendBatchUnion";
		НовыйЗапрос.Очередь = ВыборкаОбъединениеВОднуПартию.Очередь;
	КонецЦикла;	
	
	ВыборкаПолучениеДанныхПоКамням = Результат[4].Выбрать();
	Пока ВыборкаПолучениеДанныхПоКамням.Следующий() Цикл
		НовыйЗапрос = Объект.СписокЗапросов.Добавить();
		НовыйЗапрос.ИмяТабличнойЧасти = ВыборкаПолучениеДанныхПоКамням.ИмяТабличнойЧасти;
		НовыйЗапрос.НомерСтрокиТаблЧасти = ВыборкаПолучениеДанныхПоКамням.НомерСтроки;
		НовыйЗапрос.ИНП = ВыборкаПолучениеДанныхПоКамням.ИНП;
		Если ВыборкаПолучениеДанныхПоКамням.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			НовыйЗапрос.Статус = ИнтеграцияГИИСДМДК.СтатусУспех();
			НовыйЗапрос.ОписаниеОшибки = "";
			НовыйЗапрос.ИдентификаторЗапроса = "";	
		Иначе	
			НовыйЗапрос.Статус = ВыборкаПолучениеДанныхПоКамням.СтатусЗапроса;
			НовыйЗапрос.ОписаниеОшибки = ВыборкаПолучениеДанныхПоКамням.ОписаниеОшибки;
			НовыйЗапрос.ИдентификаторЗапроса = ВыборкаПолучениеДанныхПоКамням.ИдентификаторЗапроса;
		КонецЕсли;
		НовыйЗапрос.ИмяМетода = "SendGetBatch";
		НовыйЗапрос.Очередь = ВыборкаПолучениеДанныхПоКамням.Очередь;
	КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗапросовКомплектацияИзделий()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КомплектацияТоваровТовары.НомерСтроки КАК НомерСтрокиТаблЧасти,
	                      |	КомплектацияТоваровТовары.ИНП КАК ИНП,
	                      |	""SendGetBatch"" КАК ИмяМетода,
	                      |	1 КАК Очередь,
	                      |	""Товары"" КАК ИмяТабличнойЧасти,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
	                      |	КОНЕЦ КАК Статус,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
	                      |	КОНЕЦ КАК ОписаниеОшибки,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
	                      |	КОНЕЦ КАК ИдентификаторЗапроса
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом.Товары КАК КомплектацияТоваровТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомплектацияТоваров.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
	                      |		ПО КомплектацияТоваровТовары.ИНП = КомплектацияТоваровСписокЗапросов.ИНП
	                      |			И (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendGetBatch"")
	                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 1)
	                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
	                      |ГДЕ
	                      |	КомплектацияТоваровТовары.Ссылка = &Ссылка
	                      |	И (КомплектацияТоваровТовары.ИмяМетода = """"
	                      |			ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""SendGetBatch""
	                      |			ИЛИ КомплектацияТоваровТовары.ИмяМетода = ""CheckGetBatch"")
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	""SendReserveBatchUic"" КАК ИмяМетода,
	                      |	2 КАК Очередь,
	                      |	0 КАК НомерСтрокиТаблЧасти,
	                      |	"""" КАК ИНП,
	                      |	"""" КАК ИмяТабличнойЧасти,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
	                      |	КОНЕЦ КАК Статус,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
	                      |	КОНЕЦ КАК ОписаниеОшибки,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
	                      |	КОНЕЦ КАК ИдентификаторЗапроса
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомплектацияТоваров.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
	                      |		ПО (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendReserveBatchUic"")
	                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 2)
	                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
	                      |ГДЕ
	                      |	КомплектацияТоваров.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КомплектацияТоваров.ИНП КАК ИНП,
	                      |	""SendBatch"" КАК ИмяМетода,
	                      |	0 КАК НомерСтрокиТаблЧасти,
	                      |	"""" КАК ИмяТабличнойЧасти,
	                      |	3 КАК Очередь,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
	                      |	КОНЕЦ КАК Статус,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
	                      |	КОНЕЦ КАК ОписаниеОшибки,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
	                      |	КОНЕЦ КАК ИдентификаторЗапроса
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомплектацияТоваров.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
	                      |		ПО (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendBatch"")
	                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 3)
	                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
	                      |ГДЕ
	                      |	КомплектацияТоваров.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КомплектацияТоваров.ИНП КАК ИНП,
	                      |	""SendGetBatch"" КАК ИмяМетода,
	                      |	4 КАК Очередь,
	                      |	0 КАК НомерСтрокиТаблЧасти,
	                      |	"""" КАК ИмяТабличнойЧасти,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
	                      |	КОНЕЦ КАК Статус,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
	                      |	КОНЕЦ КАК ОписаниеОшибки,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
	                      |	КОНЕЦ КАК ИдентификаторЗапроса
	                      |ИЗ
	                      |	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомплектацияТоваров.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
	                      |		ПО (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendGetBatch"")
	                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 4)
	                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
	                      |ГДЕ
	                      |	КомплектацияТоваров.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Объект.СписокЗапросов.Очистить();
	
	Результат = Запрос.ВыполнитьПакет();	
	КоличествоПакетов = Результат.Количество();
	Для Сч = 1 По КоличествоПакетов Цикл
		ВыборкаДанных = Результат[Сч-1].Выбрать();
		Пока ВыборкаДанных.Следующий() Цикл
			НовыйЗапрос = Объект.СписокЗапросов.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЗапрос, ВыборкаДанных);	
			//НовыйЗапрос.Статус = ИнтеграцияГИИСДМДК.СтатусНеОтправлено();
			//НовыйЗапрос.ОписаниеОшибки = "";
			//НовыйЗапрос.ИдентификаторЗапроса = "";
		КонецЦикла;
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗапросовРазукомплектацияИзделий()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	0 КАК НомерСтрокиТаблЧасти,
	                      |	КомплектацияТоваров.ИНП КАК ИНП,
	                      |	""SendBatchCompleteset"" КАК ИмяМетода,
	                      |	1 КАК Очередь,
	                      |	"""" КАК ИмяТабличнойЧасти,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.Статус ЕСТЬ NULL
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.Статус
	                      |	КОНЕЦ КАК Статус,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ОписаниеОшибки ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ОписаниеОшибки
	                      |	КОНЕЦ КАК ОписаниеОшибки,
	                      |	ВЫБОР
	                      |		КОГДА КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса ЕСТЬ NULL
	                      |			ТОГДА """"
	                      |		ИНАЧЕ КомплектацияТоваровСписокЗапросов.ИдентификаторЗапроса
	                      |	КОНЕЦ КАК ИдентификаторЗапроса
	                      |ИЗ
	                      |	Документ.КомплектацияТоваров КАК КомплектацияТоваров
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомплектацияТоваров.СписокЗапросов КАК КомплектацияТоваровСписокЗапросов
	                      |		ПО (КомплектацияТоваровСписокЗапросов.ИмяМетода = ""SendBatchCompleteset"")
	                      |			И (КомплектацияТоваровСписокЗапросов.Очередь = 1)
	                      |			И (КомплектацияТоваровСписокЗапросов.Ссылка = &Ссылка)
	                      |ГДЕ
	                      |	КомплектацияТоваров.Ссылка = &Ссылка
	                      |	И (КомплектацияТоваров.ИмяМетода = """"
	                      |			ИЛИ КомплектацияТоваров.ИмяМетода = ""SendBatchCompleteset""
	                      |			ИЛИ КомплектацияТоваров.ИмяМетода = ""CheckBatchCompleteset"")");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Объект.СписокЗапросов.Очистить();
	
	Результат = Запрос.ВыполнитьПакет();	
	КоличествоПакетов = Результат.Количество();
	Для Сч = 1 По КоличествоПакетов Цикл
		ВыборкаДанных = Результат[Сч-1].Выбрать();
		Пока ВыборкаДанных.Следующий() Цикл
			НовыйЗапрос = Объект.СписокЗапросов.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЗапрос, ВыборкаДанных);	
			//НовыйЗапрос.Статус = ИнтеграцияГИИСДМДК.СтатусНеОтправлено();
			//НовыйЗапрос.ОписаниеОшибки = "";
			//НовыйЗапрос.ИдентификаторЗапроса = "";
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗапросов()
	Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
		ЗаполнитьСписокЗапросовПреобразованиеВЛом();
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда
		ЗаполнитьСписокЗапросовКомплектацияИзделий();
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
		ЗаполнитьСписокЗапросовРазукомплектацияИзделий();	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСписокЗапросов(Команда)
	
	Если ИдетОтправкаДанных Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокЗапросов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибки(НомерОперации)
	СтруктураПоиска = Новый Структура;
	НомерТекущейОперации = Число(Прав(НомерОперации,1));
	//Если НомерТекущейОперации = 1 Тогда
	//	СтруктураПоиска.Вставить("ИмяМетода", "SendBatchConvert");
	//КонецЕсли;
	СтруктураПоиска.Вставить("Очередь", НомерТекущейОперации);
	СтруктураПоиска.Вставить("Статус", ИнтеграцияГИИСДМДККлиент.СтатусОшибка());
	ЕстьСтроки = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
	СписокЗапросов.Очистить();
	Элементы.ГруппаОшибки.Видимость = истина;
	Для Каждого Стр Из ЕстьСтроки Цикл
		НоваяСтрока = СписокЗапросов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;	 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗапросы(НомерОперации)
	СтруктураПоиска = Новый Структура;
	НомерТекущейОперации = Число(Прав(НомерОперации,1));
	СтруктураПоиска.Вставить("Очередь", НомерТекущейОперации);
	ЕстьСтроки = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
	СписокИдентификаторовЗапросов = Новый Массив;
	Для Каждого Стр Из ЕстьСтроки Цикл
		Если Стр.ИдентификаторЗапроса <> "" Тогда
			СписокИдентификаторовЗапросов.Добавить(Стр.ИдентификаторЗапроса);
		КонецЕсли;	
	КонецЦикла;
	Если СписокИдентификаторовЗапросов.Количество()>0 Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("ИдентификаторГИИС", СписокИдентификаторовЗапросов);
		ОткрытьФорму("РегистрСведений.ЖурналЗапросовГИИСДМДК.Форма.ФормаСписка", ПараметрыОткрытияФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не найдены запросы для отображения");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроизводительЗаполненКорректно()
	НетОшибок = Истина;
	
	КоличествоСобственныхМеталлов = 0;
	КоличествоНеСобственныхМеталлов = 0;
	КоличествоМеталловНеизвестныхПроизводителей = 0;
	КоличествоВсехМеталлов = Объект.Товары.Количество();
	Для Каждого Стр Из Объект.Товары Цикл
		Если Стр.ПроизводительИНН = "" И Стр.ПроизводительКПП = "" И Стр.ПроизводительОГРН = "" Тогда
			КоличествоМеталловНеизвестныхПроизводителей = КоличествоМеталловНеизвестныхПроизводителей + 1;
		ИначеЕсли Стр.ПроизводительИНН <> СобственникИНН 
			И Стр.ПроизводительКПП <> СобственникКПП 
			И Стр.ПроизводительОГРН <> СобственникОГРН Тогда
			КоличествоНеСобственныхМеталлов = КоличествоНеСобственныхМеталлов + 1;
		Иначе	
			КоличествоСобственныхМеталлов = КоличествоСобственныхМеталлов + 1;
		КонецЕсли;	
	КонецЦикла;
	
	Если КоличествоВсехМеталлов = КоличествоСобственныхМеталлов Тогда
		Возврат НетОшибок;
	ИначеЕсли КоличествоСобственныхМеталлов = 0 Тогда
		Возврат НетОшибок;
	Иначе
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нельзя объединять металлы собственные и сторонних производителей");
		НетОшибок = Ложь;
	КонецЕсли;	
	Возврат НетОшибок;
КонецФункции

&НаСервере
Функция ДанныеЗаполненыКорректно()
	НетОшибок = Истина;	
	//Если Не ЗначениеЗаполнено(Объект.Комплект) Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен комплект");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.СерияНоменклатурыКомплекта) Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена серия комплекта");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.Комплект.ОКПД2) Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОКПД2 для комплекта");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.Комплект.ВидПартииМеталла) И Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вид партии металла для комплекта");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.ИНП) И Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнено ИНП для комплекта");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	//Если Объект.ВесКомплекта = 0 Тогда
	//	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес комплекта");
	//	НетОшибок = Ложь;	
	//КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена табличная часть ""Товары""");
		НетОшибок = Ложь;	
	КонецЕсли;
	
	Для Каждого Стр Из Объект.Товары Цикл
		Если Не ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена номенклатура");
			НетОшибок = Ложь;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Стр.СерияНоменклатуры) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена серия");
			НетОшибок = Ложь;
		ИначеЕсли ПустаяСтрока(Стр.СерияНоменклатуры.УИН)
			и (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом")
				или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни")
				или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом")) Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен УИН в серии");
			НетОшибок = Ложь;	
		КонецЕсли;
		Если Стр.Вес = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен вес");
			НетОшибок = Ложь;	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат НетОшибок;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьИнформациюОКомплектации(ВыбСертификат, Пакеты, НомерПакета = 1, НомерОперации, ПереходитьКСледующейОперации)
	ДанныеРегистрации = Пакеты.Получить(НомерПакета);
	
	Если ДанныеРегистрации = Неопределено Тогда
		
		Если Объект.ПараллельнаяОтправкаДанных Тогда
			Для Каждого ТекПакет Из Пакеты Цикл
				Если ТекПакет.Значение.СтатусЗапроса <> ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусУспех() Тогда
					ПереходитьКСледующейОперации = Ложь;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		Элементы.ГруппаТекущийПроцесс.Видимость = Ложь;
		ИдетОтправкаДанных = Ложь;
		
		Если ПереходитьКСледующейОперации Тогда
			ОтправитьДанныеПоОперации("Описание" + (НомерОперации + 1), ПереходитьКСледующейОперации);
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	Если ДанныеРегистрации.Свойство("ИдентификаторЗапроса") = Истина Тогда
		ДанныеОЗапросе = Новый Структура;
		ДанныеОЗапросе.Вставить("messageId", ДанныеРегистрации.ИдентификаторЗапроса);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("НомераСтрок", ДанныеРегистрации);
		ДополнительныеПараметры.Вставить("Пакеты", Пакеты);
		ДополнительныеПараметры.Вставить("НомерПакета", НомерПакета);
		ДополнительныеПараметры.Вставить("НомерОперации", НомерОперации);
		Если ДанныеРегистрации.Свойство("НомераСтрокНеОтправлено") Тогда
			ДополнительныеПараметры.Вставить("НомераСтрокНеОтправлено", ДанныеРегистрации.НомераСтрокНеОтправлено);
		КонецЕсли;
		ДополнительныеПараметры.Вставить("ПереходитьКСледующейОперации", ПереходитьКСледующейОперации);
		ДополнительныеПараметры.Вставить("Сертификат", ВыбСертификат);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаКомплектацийВГИИСЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыВыполнения = ИнтеграцияГИИСДМДККлиент.ИнициализироватьПараметрыВыполнения();
		ПараметрыВыполнения.ИмяМетода = ДанныеРегистрации.ИмяМетода;
		ПараметрыВыполнения.ТребуетсяПодпись = Истина;
		ПараметрыВыполнения.Сертификат = ВыбСертификат;
		ПараметрыВыполнения.МетодПодписи = "БСП";
		ПараметрыВыполнения.ПолучатьРезультат = Не Объект.ПараллельнаяОтправкаДанных;
		ПараметрыВыполнения.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		ПараметрыВыполнения.КоличествоПопыток = КоличествоПопыток;
		ПараметрыВыполнения.ПодписьНаСервере = ПодписьНаСервере;
		ПараметрыВыполнения.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.Организация = Объект.Организация;
		
		НастройкиПоОрганизации.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		НастройкиПоОрганизации.КоличествоПопыток = КоличествоПопыток;
		НастройкиПоОрганизации.ПодписьНаСервере = ПодписьНаСервере;
		НастройкиПоОрганизации.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.НастройкиОбмена = НастройкиПоОрганизации;
		
		ИнтеграцияГИИСДМДККлиент.ВыполнитьМетодСервиса(ДанныеОЗапросе, ПараметрыВыполнения, ЭтотОбъект, ОписаниеОповещения);
		
	Иначе
		Если ДанныеРегистрации.Свойство("Спецификации") И Не ЗначениеЗаполнено(ДанныеРегистрации.Спецификации) Тогда
			Элементы.ГруппаТекущийПроцесс.Видимость = Ложь;
			ИдетОтправкаДанных = Ложь;
			Возврат;
		КонецЕсли;
		Если ДанныеРегистрации.Свойство("УИН") И Не ЗначениеЗаполнено(ДанныеРегистрации.УИН) Тогда
			Элементы.ГруппаТекущийПроцесс.Видимость = Ложь;
			ИдетОтправкаДанных = Ложь;
			Возврат;
		КонецЕсли;
			
		ДанныеДляОтправки = Новый Структура();
		Если ДанныеРегистрации.ИмяМетода = "SendBatch" Тогда
			ДанныеДляОтправки.Вставить("ТаблицаПартий", ДанныеРегистрации.ТаблицаПартий);
		ИначеЕсли ДанныеРегистрации.Свойство("Спецификации") Тогда
			Спецификации = Новый Массив;
			Спецификации.Добавить(ДанныеРегистрации.Спецификации);
			ДанныеДляОтправки.Вставить("Спецификации", Спецификации);
		ИначеЕсли ДанныеРегистрации.Свойство("Партии") Тогда
			ДанныеДляОтправки.Вставить("Партии", ДанныеРегистрации.Партии);
		ИначеЕсли ДанныеРегистрации.ИмяМетода = "SendReserveBatchUic" Тогда
			ДанныеДляОтправки.Вставить("КоличествоУИН", ДанныеРегистрации.КоличествоУИН);
		Иначе
			ДанныеДляОтправки.Вставить("УИН", ДанныеРегистрации.УИН);
			Если ДанныеРегистрации.Свойство("ТипИерархии") Тогда
				ДанныеДляОтправки.Вставить("ТипИерархии", ДанныеРегистрации.ТипИерархии);
			КонецЕсли;
			Если ДанныеРегистрации.Свойство("page") Тогда
				ДанныеДляОтправки.Вставить("page", ДанныеРегистрации.page);
			КонецЕсли;
			Если ДанныеРегистрации.Свойство("size") Тогда
				ДанныеДляОтправки.Вставить("size", ДанныеРегистрации.size);
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("НомераСтрок", ДанныеРегистрации.НомераСтрокНеОтправлено);
		ДополнительныеПараметры.Вставить("Пакеты", Пакеты);
		ДополнительныеПараметры.Вставить("НомерПакета", НомерПакета);
		ДополнительныеПараметры.Вставить("НомерОперации", НомерОперации);
		ДополнительныеПараметры.Вставить("ПереходитьКСледующейОперации", ПереходитьКСледующейОперации);
		ДополнительныеПараметры.Вставить("Сертификат", ВыбСертификат);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаКомплектацийВГИИСЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыВыполнения = ИнтеграцияГИИСДМДККлиент.ИнициализироватьПараметрыВыполнения();
		ПараметрыВыполнения.ИмяМетода = ДанныеРегистрации.ИмяМетода;
		ПараметрыВыполнения.ТребуетсяПодпись = Истина;
		ПараметрыВыполнения.Сертификат = ВыбСертификат;
		ПараметрыВыполнения.МетодПодписи = "БСП";
		ПараметрыВыполнения.ПолучатьРезультат = Не Объект.ПараллельнаяОтправкаДанных;
		ПараметрыВыполнения.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		ПараметрыВыполнения.КоличествоПопыток = КоличествоПопыток;
		ПараметрыВыполнения.ПодписьНаСервере = ПодписьНаСервере;
		ПараметрыВыполнения.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.Организация = Объект.Организация;
		
		НастройкиПоОрганизации.ТаймаутМеждуПопытками = ТаймаутМеждуПопытками;
		НастройкиПоОрганизации.КоличествоПопыток = КоличествоПопыток;
		НастройкиПоОрганизации.ПодписьНаСервере = ПодписьНаСервере;
		НастройкиПоОрганизации.ОтправкаНаСервере = ОтправкаНаСервере;
		ПараметрыВыполнения.НастройкиОбмена = НастройкиПоОрганизации;
		
		ИнтеграцияГИИСДМДККлиент.ВыполнитьМетодСервиса(ДанныеДляОтправки, ПараметрыВыполнения, ЭтотОбъект, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИНППреобразованияВЛом(ТекСтрТовары, ТекУИН, НомерСтроки, ДополнительныеПараметры)
	
	//ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
	//ТекСтрТовары.ИНППреобразованияВЛом = "";
	//ТекСтрТовары.ОписаниеОшибки = "";
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИНП", ТекУИН);
	ЕстьСтроки = Объект.Металл.НайтиСтроки(СтруктураОтбора);
	Если ЕстьСтроки.Количество() = 0 Тогда
		ТекСтрМеталл = Объект.Металл.Добавить();
		ТекСтрМеталл.ИНП = ТекУИН;
		ТекСтрМеталл.ИНПИзделия = ТекСтрТовары.ИНП;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСобственникаИВидПартии(ТекУИН, ТекСтрТовары)
	
	Если ТекУИН.Собственник.ИНН <> СобственникИНН 
		Или ТекУИН.Собственник.КПП <> СобственникКПП 
		Или ТекУИН.Собственник.ОГРН <> СобственникОГРН Тогда
		ТекСтрТовары.СтатусЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОшибка();
		ТекСтрТовары.ОписаниеОшибки = "Не верно указан собственник партии: ИНН " + ТекУИН.Собственник.ИНН
			+ " КПП " + ТекУИН.Собственник.КПП+ " ОГРН " + ТекУИН.Собственник.ОГРН;
	//ИначеЕсли ТекУИН.ВидПартии = "COMPLETE_SET" Тогда//<> "JEWERLY" Тогда
	//	ТекСтрТовары.СтатусЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОшибка();
	//	ТекСтрТовары.ОписаниеОшибки = "Не верно указан вид партии: " + ТекУИН.ВидПартии + ". Преобразовать можно только JEWERLY";
		
	КонецЕсли;
	ТекСтрТовары.ПроизводительИНН = ТекУИН.Производитель.ИНН;
	ТекСтрТовары.ПроизводительКПП = ТекУИН.Производитель.КПП;
	ТекСтрТовары.ПроизводительОГРН = ТекУИН.Производитель.ОГРН;
	
	Возврат ТекСтрТовары.СтатусЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОшибка();
	
КонецФункции

&НаСервере
Функция ЗаписатьНовыйСтатусНаСервереДляПреобразования(ТекУИН, НовыйСтатус, ИдентификаторЗапроса, ОбработанныйПакет, ДополнительныеПараметры)
	Если НовыйСтатус = "Успех" Тогда
		ТекСтрТовары = Объект.Товары[Число(ТекУИН.НомерСтроки) - 1];
	Иначе 
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
		ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
		Если ЕстьСтроки.Количество() > 0 Тогда
			ТекСтрТовары = ЕстьСтроки[0];
		КонецЕсли;	
	КонецЕсли;
	
	Если НовыйСтатус = "Успех" Тогда
		Если ТипЗнч(ТекУИН.УИН) = Тип("Массив") Тогда
			Если ТекУИН.УИН.Количество() > 1 Тогда
				Для Каждого ТекУИНИзМассива Из ТекУИН.УИН Цикл
					ЗаполнитьИНППреобразованияВЛом(ТекСтрТовары, ТекУИНИзМассива, ТекУИН.НомерСтроки, ДополнительныеПараметры);	
				КонецЦикла;	
				ИНППреобразованияВЛом = ТекУИН.УИН;
			Иначе
				ИНППреобразованияВЛом = ТекУИН.УИН[0];
				ТекСтрТовары.ИНППреобразованияВЛом = ИНППреобразованияВЛом;
			КонецЕсли;	
		Иначе
			ИНППреобразованияВЛом = ТекУИН.УИН;
			ТекСтрТовары.ИНППреобразованияВЛом = ИНППреобразованияВЛом;
		КонецЕсли;	
		ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
		ТекСтрТовары.ОписаниеОшибки = "";
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИНП", ТекСтрТовары.ИНП);
		СтруктураПоиска.Вставить("Очередь", 3);
		ЕстьСтроки = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
		Если ЕстьСтроки.Количество() > 0 Тогда
			Если ТипЗнч(ИНППреобразованияВЛом) = Тип("Массив") Тогда
				ПервыйПроход = Истина;
				Для Каждого ИНППреобразованияВЛомЭлемент Из ИНППреобразованияВЛом Цикл
					Если ПервыйПроход Тогда
						ЕстьСтроки[0].ИНП = ИНППреобразованияВЛомЭлемент;
						ЕстьСтроки[0].ИмяТабличнойЧасти = "Металл";
						ПервыйПроход = Ложь;
					Иначе
						НовыйЗапрос = Объект.СписокЗапросов.Добавить();
						НовыйЗапрос.ИНП = ИНППреобразованияВЛомЭлемент;
						НовыйЗапрос.Очередь = 3;
						НовыйЗапрос.ИмяТабличнойЧасти = "Металл";
						НовыйЗапрос.ИмяМетода = "SendGetBatch";
					КонецЕсли;
				КонецЦикла;	
			Иначе	
				ЕстьСтроки[0].ИНП = ИНППреобразованияВЛом;
			КонецЕсли;
		КонецЕсли;	
		
		НомерСледующегоПакета = ДополнительныеПараметры.НомерПакета + 1;
		Если ТекУИН.Свойство("Камни") Тогда
			Для Каждого КаменьУИН Из ТекУИН.Камни.УИН Цикл
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ИНП", КаменьУИН);
				ЕстьКамни = Объект.Камни.НайтиСтроки(СтруктураПоиска);
				Если ЕстьКамни.Количество() = 0 Тогда
					НовСтрКамень = Объект.Камни.Добавить();	
					НовСтрКамень.ИНП = КаменьУИН;
				КонецЕсли;
			КонецЦикла;
			Если Объект.Камни.Количество() > 0 Тогда
				Элементы.ГруппаОперация4.Видимость = Истина;
			КонецЕсли;
			ВсегоПакетов = ДополнительныеПараметры.Пакеты.Количество();
			Если ДополнительныеПараметры.Пакеты.Получить(ВсегоПакетов) <> Неопределено Тогда
				ВсегоПакетов = ВсегоПакетов + 1;						
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли НовыйСтатус = "Ошибка" Тогда
		ТекСтрТовары.ИдентификаторЗапроса = ИдентификаторЗапроса;
		ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
		ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
		ЕстьОшибки = Истина;	
	КонецЕсли;
	ТекСтрТовары.ИмяМетода = ОбработанныйПакет.ИмяМетода;
		
	Возврат ТекСтрТовары;
	
КонецФункции

&НаСервере
Функция ОбработатьПолучениеИнформацииОКамнях(ТекУИН, НовыйСтатус, ИдентификаторЗапроса, ОбработанныйПакет, ДополнительныеПараметры)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
	ЕстьСтроки = Объект.Камни.НайтиСтроки(СтруктураОтбора);
	Если ЕстьСтроки.Количество() > 0 Тогда
		ТекСтрТовары = ЕстьСтроки[0];
	КонецЕсли;
	Если НовыйСтатус = "Успех" Тогда
		ДанныеРазбораКода = ИнтеграцияГИИСДМДКЮТДСервер.РазобратьКлассификационныйКодПартииКамней(ТекУИН.ДанныеОКамне.КлассификационныйКод);
		Если ДанныеРазбораКода <> Неопределено
			И ТипЗнч(ДанныеРазбораКода) = Тип("Структура") Тогда
			
			Если ДанныеРазбораКода.Свойство("ВидКамня") Тогда
				
				ТекСтрТовары.Камень = ДанныеРазбораКода.ВидКамня;
				
			КонецЕсли;
			
			Если ДанныеРазбораКода.Свойство("ГруппаКодированияГИИСДМДК") Тогда
				
				ТекСтрТовары.ГруппаКодированияГИИСДМДК = ДанныеРазбораКода.ГруппаКодированияГИИСДМДК;
				
			КонецЕсли;
			
			Если ДанныеРазбораКода.Свойство("ХарактеристикиГИИСДМДК") Тогда
				
				Для Каждого ТекХарактеристика Из ДанныеРазбораКода.ХарактеристикиГИИСДМДК Цикл
					Если ТекХарактеристика.ИмяЭлементаКодирования = "ТипКамня" Тогда
						ТекСтрТовары.ТипКамняГИИСДМДК = ТекХарактеристика.ЗначениеКлассификатораГИИСДМДК;
					ИначеЕсли ТекХарактеристика.ИмяЭлементаКодирования = "ФормаОгранки" Тогда
						ТекСтрТовары.ФормаОгранкиГИИСДМДК = ТекХарактеристика.ЗначениеКлассификатораГИИСДМДК;
						ТекСтрТовары.ФормаОгранки = ТекХарактеристика.ЗначениеДанных;
					ИначеЕсли ТекХарактеристика.ИмяЭлементаКодирования = "ГруппаЧистоты" Тогда
						ТекСтрТовары.ГруппаЧистотыГИИСДМДК = ТекХарактеристика.ЗначениеКлассификатораГИИСДМДК;
						ТекСтрТовары.ГруппаЧистоты = ТекХарактеристика.ЗначениеДанных;
					ИначеЕсли ТекХарактеристика.ИмяЭлементаКодирования = "ГруппаЦвета" Тогда
						ТекСтрТовары.ГруппаЦветаГИИСДМДК = ТекХарактеристика.ЗначениеКлассификатораГИИСДМДК;
						ТекСтрТовары.ГруппаЦвета = ТекХарактеристика.ЗначениеДанных;	
					КонецЕсли;	
				КонецЦикла;	
				
			КонецЕсли;
		КонецЕсли;
		ТекСтрТовары.Количество = ТекУИН.Количество;
		ТекСтрТовары.Вес = ТекУИН.Вес*5/ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса();
		ТекСтрТовары.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех();
	Иначе
		ТекСтрТовары.ИдентификаторЗапроса = ИдентификаторЗапроса;
		ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
		ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат ТекСтрТовары;
	
КонецФункции

&НаСервере
Функция ОбработатьПолучениеИнформацииОМеталлеИТоварах(ТекУИН, НовыйСтатус, ИдентификаторЗапроса, ОбработанныйПакет, ДополнительныеПараметры)
	
	СтруктураОтбора = Новый Структура;
	Если ОбработанныйПакет.ИмяТабЧасти	= "Металл" 
		Или ОбработанныйПакет.ИмяТабЧасти = "ПромежуточныеКомплекты" Тогда
		СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
	ИначеЕсли ОбработанныйПакет.ИмяТабЧасти = "Товары" Тогда
		СтруктураОтбора.Вставить("ИНППреобразованияВЛом", ТекУИН.УИН);
	КонецЕсли;
	Если ОбработанныйПакет.ИмяТабЧасти <> "" Тогда	
		ЕстьСтроки = Объект[ОбработанныйПакет.ИмяТабЧасти].НайтиСтроки(СтруктураОтбора);
		Если ЕстьСтроки.Количество() > 0 Тогда
			ТекСтрТовары = ЕстьСтроки[0];
		ИначеЕсли ОбработанныйПакет.ИмяТабЧасти = "Товары" Тогда
			СтруктураОтбора.Вставить("ИНП", ТекУИН.УИН);
			СтруктураОтбора.Удалить("ИНППреобразованияВЛом");	
			
			ЕстьСтроки = Объект[ОбработанныйПакет.ИмяТабЧасти].НайтиСтроки(СтруктураОтбора);
			Если ЕстьСтроки.Количество() > 0 Тогда
				ТекСтрТовары = ЕстьСтроки[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НовыйСтатус = "Успех" Тогда
		ЕстьОшибки = Ложь;
		Если ОбработанныйПакет.ИмяТабЧасти = "" Тогда
			ТекВесВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
			Если ТекВесВХимЧистоте > 0 Тогда
				Объект.ВесКомплектаВХимЧистоте = ТекВесВХимЧистоте;
			КонецЕсли;
		ИначеЕсли ОбработанныйПакет.ИмяТабЧасти = "Товары" И ДополнительныеПараметры.НомерОперации = 1 Тогда
			ЕстьОшибки = ПроверитьСобственникаИВидПартии(ТекУИН, ТекСтрТовары);
		ИначеЕсли ОбработанныйПакет.ИмяТабЧасти = "Товары" И ДополнительныеПараметры.НомерОперации = 3 Тогда
			ТекВесВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
			Если ТекВесВХимЧистоте > 0 Тогда	
				ТекСтрТовары.ВесВХимЧистотеГИИСДМДК = ТекВесВХимЧистоте;
			КонецЕсли;	
			//доп.проба
			Если ТипЗнч(ТекУИН.ДанныеОМеталле.ОписаниеМеталла) = Тип("Массив") 
				И ТекУИН.ДанныеОМеталле.ОписаниеМеталла.Количество() > 1  Тогда
				ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
				Для Каждого ТекущаяСтрокаДанныхОМеталле Из ТекУИН.ДанныеОМеталле.ОписаниеМеталла Цикл
					Если ТекущаяСтрокаДанныхОМеталле.Металл <> ТекУИН.ДанныеОМеталле.Металл
						Или ТекущаяСтрокаДанныхОМеталле.Проба <> ТекУИН.ДанныеОМеталле.Проба Тогда
						НовСтр = Объект.Металл.Добавить();
						НовСтр.ТипМеталла = ИнтеграцияГИИСДМДКЮТДСервер.ТипМеталлаКонфигурации(ТекущаяСтрокаДанныхОМеталле.Металл);
						Проба = ОписаниеТипаЧисло.ПривестиЗначение(ТекущаяСтрокаДанныхОМеталле.Проба);
						НовСтр.Проба = Проба / ИнтеграцияГИИСДМДК.КоэффициентПробы();
						НовСтр.Вес = ТекущаяСтрокаДанныхОМеталле.Вес/ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса();
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;	
		ИначеЕсли ОбработанныйПакет.ИмяТабЧасти = "Металл" И ДополнительныеПараметры.НомерОперации = 3 Тогда
			ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
			Проба = ОписаниеТипаЧисло.ПривестиЗначение(ТекУИН.ДанныеОМеталле.Проба);
			Если Проба = 0 И ТекУИН.ДанныеОМеталле.ОписаниеМеталла.Количество() > 0 Тогда
				Проба = ОписаниеТипаЧисло.ПривестиЗначение(ТекУИН.ДанныеОМеталле.ОписаниеМеталла[0].Проба);	
			КонецЕсли;	
			ТекСтрТовары.ТипМеталла = ИнтеграцияГИИСДМДКЮТДСервер.ТипМеталлаКонфигурации(ТекУИН.ДанныеОМеталле.Металл);
			ТекСтрТовары.Проба = Проба / ИнтеграцияГИИСДМДК.КоэффициентПробы();
			ТекСтрТовары.Вес = ТекУИН.Вес/ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса();
			ТекВесВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
			Если ТекВесВХимЧистоте > 0 Тогда	
				ТекСтрТовары.ВесВЧистоте = ТекВесВХимЧистоте;
			КонецЕсли;
			//доп.проба
			Если ТипЗнч(ТекУИН.ДанныеОМеталле.ОписаниеМеталла) = Тип("Массив") 
				И ТекУИН.ДанныеОМеталле.ОписаниеМеталла.Количество() > 1  Тогда
				ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
				Для Каждого ТекущаяСтрокаДанныхОМеталле Из ТекУИН.ДанныеОМеталле.ОписаниеМеталла Цикл
					Если ТекущаяСтрокаДанныхОМеталле.Металл <> ТекУИН.ДанныеОМеталле.Металл
						Или ТекущаяСтрокаДанныхОМеталле.Проба <> ТекУИН.ДанныеОМеталле.Проба Тогда
						НовСтр = Объект.Металл.Добавить();
						НовСтр.ТипМеталла = ИнтеграцияГИИСДМДКЮТДСервер.ТипМеталлаКонфигурации(ТекущаяСтрокаДанныхОМеталле.Металл);
						Проба = ОписаниеТипаЧисло.ПривестиЗначение(ТекущаяСтрокаДанныхОМеталле.Проба);
						НовСтр.Проба = Проба / ИнтеграцияГИИСДМДК.КоэффициентПробы();
						НовСтр.Вес = ТекущаяСтрокаДанныхОМеталле.Вес/ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса();
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;		
		Иначе
			ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
			Проба = ОписаниеТипаЧисло.ПривестиЗначение(ТекУИН.ДанныеОМеталле.Проба);
			ТекСтрТовары.ТипМеталла = ИнтеграцияГИИСДМДКЮТДСервер.ТипМеталлаКонфигурации(ТекУИН.ДанныеОМеталле.Металл);
			ТекСтрТовары.Проба = Проба / ИнтеграцияГИИСДМДК.КоэффициентПробы();
			ТекСтрТовары.Вес = ТекУИН.Вес/ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса();
			ТекВесВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
			Если ТекВесВХимЧистоте > 0 Тогда
				Если ОбработанныйПакет.ИмяТабЧасти = "ПромежуточныеКомплекты" Тогда
					ТекСтрТовары.ВесВХимЧистоте = ТекВесВХимЧистоте;
				Иначе	
					ТекСтрТовары.ВесВЧистоте = ТекВесВХимЧистоте;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ОбработанныйПакет.ИмяТабЧасти <> "" И ЕстьОшибки = Ложь Тогда
			ТекСтрТовары.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех();
		КонецЕсли;
	Иначе
		Если ОбработанныйПакет.ИмяТабЧасти = "" Тогда
			Объект.ИдентификаторЗапроса = ИдентификаторЗапроса;
			Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
			Объект.ОписаниеОшибки = ТекУИН.Ошибка;
			ЕстьОшибки = Истина;
		Иначе	
			ТекСтрТовары.ИдентификаторЗапроса = ИдентификаторЗапроса;
			ТекСтрТовары.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
			ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекСтрТовары;
	
КонецФункции

&НаСервере
Функция ЗаписатьНовыйСтатусНаСервереДляПолученияИнформацииОПартии(ТекУИН, НовыйСтатус, ИдентификаторЗапроса, ОбработанныйПакет, ДополнительныеПараметры)
	Если ТекУИН.Свойство("ДанныеОКамне") И ОбработанныйПакет.ИмяТабЧасти = "Камни" Тогда
		
		ТекСтрТовары = ОбработатьПолучениеИнформацииОКамнях(ТекУИН, НовыйСтатус, ИдентификаторЗапроса, ОбработанныйПакет, ДополнительныеПараметры);
				
	Иначе
		
		ТекСтрТовары = ОбработатьПолучениеИнформацииОМеталлеИТоварах(ТекУИН, НовыйСтатус, ИдентификаторЗапроса, ОбработанныйПакет, ДополнительныеПараметры);
		
	КонецЕсли;	
	
	Возврат ТекСтрТовары;
	
КонецФункции

&НаСервере
Функция ЗаписатьНовыйСтатусНаСервере(Данные, НовыйСтатус, ДополнительныеПараметры, ИдентификаторЗапроса)
		
	ЕстьОшибки = Ложь;
	
	Если Данные.Количество() = 0 Тогда
		Возврат ЕстьОшибки;	
	КонецЕсли;
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Если Данные.Свойство("Ошибка") и Данные.Ошибка = ""	Тогда
			Возврат ЕстьОшибки;
		ИначеЕсли Данные.Свойство("Ошибка") и Данные.Ошибка <> ""	Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	ОбработанныйПакет = ДополнительныеПараметры.Пакеты.Получить(ДополнительныеПараметры.НомерПакета);
	Если НовыйСтатус = "Ошибка" Тогда
		ОбработанныйПакет.СтатусЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОшибка();
	Иначе	
		ОбработанныйПакет.СтатусЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусУспех();
	КонецЕсли;
	ИмяМетода = ОбработанныйПакет.ИмяМетода;
	Для Каждого ТекУИН Из Данные Цикл
		Если НовыйСтатус = "Ошибка" 
			И ((ТекУИН.Свойство("Ошибка") и ТекУИН.Ошибка = "")
			Или (ТекУИН.Свойство("Значение") и ТекУИН.Значение = "")) Тогда
			Продолжить;
		КонецЕсли;	
		Если ОбработанныйПакет.ИмяМетода = "SendBatchConvert" 
			Или ОбработанныйПакет.ИмяМетода = "CheckBatchConvert" Тогда
			
			ТекСтрТовары = ЗаписатьНовыйСтатусНаСервереДляПреобразования(ТекУИН, НовыйСтатус, ИдентификаторЗапроса, ОбработанныйПакет, ДополнительныеПараметры);	
			
		ИначеЕсли (ОбработанныйПакет.ИмяМетода = "SendGetBatch"
			Или ОбработанныйПакет.ИмяМетода = "CheckGetBatch") И ОбработанныйПакет.Свойство("ИмяТабЧасти") Тогда
			Если ОбработанныйПакет.ИмяТабЧасти = "" Тогда
				ТекВесВХимЧистоте = ИнтеграцияГИИСДМДКЮТДКлиентСервер.ПолучитьВесИзВходящихДанных(ТекУИН);
				Если ТекВесВХимЧистоте > 0 Тогда	
					Объект.ВесКомплектаВХимЧистоте = ТекВесВХимЧистоте;
				КонецЕсли;
				Если НовыйСтатус = "Успех" Тогда
					Объект.ОписаниеОшибки = "";
				ИначеЕсли НовыйСтатус = "Ошибка" Тогда
					Объект.ОписаниеОшибки = ТекУИН.Ошибка;
					ЕстьОшибки = Истина;
				КонецЕсли;
				Объект.ИдентификаторЗапроса = ИдентификаторЗапроса;
				Объект.СтатусЗапроса = ОбработанныйПакет.СтатусЗапроса;
			Иначе	
				ТекСтрТовары = ЗаписатьНовыйСтатусНаСервереДляПолученияИнформацииОПартии(ТекУИН, НовыйСтатус, ИдентификаторЗапроса, ОбработанныйПакет, ДополнительныеПараметры);
			КонецЕсли;
			
		ИначеЕсли ОбработанныйПакет.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатРезервированияДиапазонаУИН() Тогда
			Если НовыйСтатус = "Успех" Тогда
				Объект.ОписаниеОшибки = "";
				Объект.ИНПЗарезирвированное = ТекУИН;
			ИначеЕсли НовыйСтатус = "Ошибка" Тогда
				Объект.ОписаниеОшибки = ТекУИН.Ошибка;
				ЕстьОшибки = Истина;
			КонецЕсли;
			Объект.ИдентификаторЗапроса = ИдентификаторЗапроса;
			Объект.СтатусЗапроса = ОбработанныйПакет.СтатусЗапроса;
			Объект.ИмяМетода = ОбработанныйПакет.ИмяМетода;
	
		ИначеЕсли ИдентификаторЗапроса = Объект.ИдентификаторЗапроса Тогда
			Если НовыйСтатус = "Успех" Тогда
				Объект.ОписаниеОшибки = "";
				Объект.ИНП = ТекУИН.УИН;
				//СерияОбъект = Объект.СерияНоменклатурыКомплекта.ПолучитьОбъект();
				//СерияОбъект.УИН = Объект.ИНП;
				//СерияОбъект.Записать();
			ИначеЕсли НовыйСтатус = "Ошибка" Тогда
				Объект.ОписаниеОшибки = ТекУИН.Ошибка;
				ЕстьОшибки = Истина;
			КонецЕсли;
			Объект.ИдентификаторЗапроса = ИдентификаторЗапроса;
			Объект.СтатусЗапроса = ОбработанныйПакет.СтатусЗапроса;
			Объект.ИмяМетода = ОбработанныйПакет.ИмяМетода;
		ИначеЕсли ОбработанныйПакет.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатОтправкиПартийНаРегистрацию() Тогда
			Если НовыйСтатус = "Успех" Тогда
				Объект.ОписаниеОшибки = "";
				Объект.ИНП = ТекУИН.УИН;				
			ИначеЕсли НовыйСтатус = "Ошибка" Тогда
				Объект.ОписаниеОшибки = ТекУИН.Ошибка;
				ЕстьОшибки = Истина;
			КонецЕсли;
			Объект.ИдентификаторЗапроса = ИдентификаторЗапроса;
			Объект.СтатусЗапроса = ОбработанныйПакет.СтатусЗапроса;
			Объект.ИмяМетода = ОбработанныйПакет.ИмяМетода;
		ИначеЕсли ОбработанныйПакет.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатОтправкаКомплектацийНаРегистрацию()
			И ОбработанныйПакет.ИмяТабЧасти = "" Тогда
			Если НовыйСтатус = "Успех" Тогда
				Объект.ОписаниеОшибки = "";
				Объект.ИНП = ТекУИН.УИН;
			ИначеЕсли НовыйСтатус = "Ошибка" Тогда
				Объект.ОписаниеОшибки = ТекУИН.Ошибка;
				ЕстьОшибки = Истина;
			КонецЕсли;
			Объект.ИдентификаторЗапроса = ИдентификаторЗапроса;
			Объект.СтатусЗапроса = ОбработанныйПакет.СтатусЗапроса;
			Объект.ИмяМетода = ОбработанныйПакет.ИмяМетода;
		ИначеЕсли ОбработанныйПакет.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатОтправкаКомплектацийНаРегистрацию() Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
			ЕстьСтроки = Объект[ОбработанныйПакет.ИмяТабЧасти].НайтиСтроки(СтруктураОтбора);
			Если ЕстьСтроки.Количество() > 0 Тогда
				ТекСтрТовары = ЕстьСтроки[0];
			Иначе
				Если ТипЗнч(ОбработанныйПакет.НомераСтрокНеОтправлено) = Тип("Массив") Тогда
					НомерСтроки = ОбработанныйПакет.НомераСтрокНеОтправлено[0];
					ТекСтрТовары = Объект[ОбработанныйПакет.ИмяТабЧасти][НомерСтроки - 1];
				Иначе
					НомерСтроки = ОбработанныйПакет.НомераСтрокНеОтправлено;
					ТекСтрТовары = Объект[ОбработанныйПакет.ИмяТабЧасти][НомерСтроки - 1];
				КонецЕсли;	
				
			КонецЕсли;	
			Если НовыйСтатус = "Успех" Тогда
				ТекСтрТовары.ОписаниеОшибки = "";
				ТекСтрТовары.ИНП = ТекУИН.УИН;
				Если ОбработанныйПакет.ИмяТабЧасти = "Товары" Тогда
					СерияОбъект = ТекСтрТовары.СерияНоменклатуры.ПолучитьОбъект();
					СерияОбъект.УИН = ТекСтрТовары.ИНП;
					СерияОбъект.Записать();
				КонецЕсли;
			ИначеЕсли НовыйСтатус = "Ошибка" Тогда
				ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
				ЕстьОшибки = Истина;
			КонецЕсли;
			ТекСтрТовары.ИдентификаторЗапроса = ИдентификаторЗапроса;
			ТекСтрТовары.СтатусЗапроса = ОбработанныйПакет.СтатусЗапроса;
			Если ОбработанныйПакет.ИмяТабЧасти <> "ПромежуточныеКомплекты" Тогда
				ТекСтрТовары.ИмяМетода = ОбработанныйПакет.ИмяМетода;
			КонецЕсли;
		Иначе	
			Если ОбработанныйПакет.ИмяТабЧасти <> "" Тогда
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
				ЕстьСтроки = Объект[ОбработанныйПакет.ИмяТабЧасти].НайтиСтроки(СтруктураОтбора);
				Если ЕстьСтроки.Количество() > 0 Тогда
					ТекСтрТовары = ЕстьСтроки[0];
					Если НовыйСтатус = "Успех" Тогда	
						ТекСтрТовары.ИНП = ТекУИН.УИН;
						СерияОбъект = ТекСтрТовары.СерияНоменклатуры.ПолучитьОбъект();
						СерияОбъект.УИН = ТекСтрТовары.ИНП;
						СерияОбъект.Записать();
						ТекСтрТовары.ОписаниеОшибки = "";
					ИначеЕсли НовыйСтатус = "Ошибка" Тогда
						ТекСтрТовары.ОписаниеОшибки = ТекУИН.Ошибка;
						ЕстьОшибки = Истина;
					КонецЕсли;
					ТекСтрТовары.ИдентификаторЗапроса = ИдентификаторЗапроса;
					ТекСтрТовары.СтатусЗапроса = ОбработанныйПакет.СтатусЗапроса;
					ТекСтрТовары.ИмяМетода = ОбработанныйПакет.ИмяМетода;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		СтруктураПоискаЗапросов = Новый Структура;
		СтруктураПоискаЗапросов.Вставить("ИмяТабличнойЧасти", ОбработанныйПакет.ИмяТабЧасти);
		ИмяМетодаЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияЗапроса(ОбработанныйПакет.ИмяМетода);
		СтруктураПоискаЗапросов.Вставить("ИмяМетода", ?(ИмяМетодаЗапроса = "", ОбработанныйПакет.ИмяМетода, ИмяМетодаЗапроса));
		СтруктураПоискаЗапросов.Вставить("Очередь", ДополнительныеПараметры.НомерОперации);
		НужнаДопПроверка = Ложь;
		Если ОбработанныйПакет.Свойство("НомераСтрокНеОтправлено") Тогда
			Если ТипЗнч(ОбработанныйПакет.НомераСтрокНеОтправлено) = Тип("Массив") Тогда
				Если  ОбработанныйПакет.НомераСтрокНеОтправлено.Количество() > 1 Тогда
					НужнаДопПроверка = Истина;
				Иначе
					СтруктураПоискаЗапросов.Вставить("НомерСтрокиТаблЧасти", ОбработанныйПакет.НомераСтрокНеОтправлено[0]);
				КонецЕсли;
			Иначе	
				СтруктураПоискаЗапросов.Вставить("НомерСтрокиТаблЧасти", ОбработанныйПакет.НомераСтрокНеОтправлено);
			КонецЕсли;
		Иначе
			СтруктураПоискаЗапросов.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
		КонецЕсли;
		
		ЕстьЗапросыДляОбновления = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоискаЗапросов);
		Если ЕстьЗапросыДляОбновления.Количество() > 0 Тогда
			Для Каждого ТекущийЗапрос Из ЕстьЗапросыДляОбновления Цикл
				Если НужнаДопПроверка = Истина 
					И ОбработанныйПакет.НомераСтрокНеОтправлено.Найти(ТекущийЗапрос.НомерСтрокиТаблЧасти) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если ОбработанныйПакет.ИмяТабЧасти = "" Тогда
					Если НовыйСтатус = "Успех" И ОбработанныйПакет.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатОтправкаКомплектацийНаРегистрацию() Тогда
						ТекущийЗапрос.ИНП = ТекУИН.УИН;
					КонецЕсли;	
					ТекущийЗапрос.Статус = Объект.СтатусЗапроса;
					ТекущийЗапрос.ОписаниеОшибки = Объект.ОписаниеОшибки;
					ТекущийЗапрос.ИдентификаторЗапроса = Объект.ИдентификаторЗапроса;	
				Иначе	
					Если ТекСтрТовары = Неопределено Тогда
						Если НовыйСтатус = "Успех" Тогда
							Если ОбработанныйПакет.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатОтправкаКомплектацийНаРегистрацию() Тогда
								ТекущийЗапрос.ИНП = ТекУИН.УИН;
							КонецЕсли;
							ТекущийЗапрос.Статус = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
							ТекущийЗапрос.ОписаниеОшибки = "";
							ТекущийЗапрос.ИдентификаторЗапроса = ИдентификаторЗапроса;
						Иначе
							ТекущийЗапрос.Статус = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Ошибка");
							ТекущийЗапрос.ОписаниеОшибки = ТекУИН.Ошибка;
							ТекущийЗапрос.ИдентификаторЗапроса = ИдентификаторЗапроса;
						КонецЕсли;
					Иначе
						Если НовыйСтатус = "Успех" И ОбработанныйПакет.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаРезультатОтправкаКомплектацийНаРегистрацию() Тогда
							ТекущийЗапрос.ИНП = ТекУИН.УИН;
						КонецЕсли;
						Если (ОбработанныйПакет.ИмяМетода = "SendBatchConvert" 
							Или ОбработанныйПакет.ИмяМетода = "CheckBatchConvert")
							И ТекущийЗапрос.НомерСтрокиТаблЧасти <> ТекСтрТовары.НомерСтроки Тогда
							Продолжить;
						КонецЕсли;
						ТекущийЗапрос.Статус = ТекСтрТовары.СтатусЗапроса;
						ТекущийЗапрос.ОписаниеОшибки = ТекСтрТовары.ОписаниеОшибки;
						ТекущийЗапрос.ИдентификаторЗапроса = ИдентификаторЗапроса;
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
			
	Если ЕстьОшибки = Ложь Тогда
		Если ОбработанныйПакет.ИмяТабЧасти <> "" Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("СтатусЗапроса", ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех"));
			Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие
				Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни
				Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияЛом
				Или Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
				СтруктураОтбора.Вставить("ИмяМетода", "SendBatchUnion");
			КонецЕСли;	
			ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);	
			Если ЕстьСтроки.Количество() = Объект.Товары.Количество() Тогда	
				Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех");
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(ПараметрыЗаписи);

	ЗаполнитьСтатусОпераций();
	
	Возврат ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьНовыйСтатус(Данные, НовыйСтатус, ДополнительныеПараметры, messageId)
	ЕстьОшибки = ЗаписатьНовыйСтатусНаСервере(Данные, НовыйСтатус, ДополнительныеПараметры, messageId);
	Если ЕстьОшибки Тогда
		//УстановитьВидимостьПредупреждения(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоОжидающимОтветаВСтроке(НомерСтроки, messageId, ТекПакет, ТекНомерОперации)
	
	ИмяМетода = ТекПакет.ИмяМетода;
	СтруктураОтбора = Новый Структура;
	Если ТипЗнч(НомерСтроки) = Тип("Структура") и НомерСтроки.Свойство("ИдентификаторЗапроса") 
		И ЗначениеЗаполнено(НомерСтроки.ИдентификаторЗапроса) Тогда
		СтруктураОтбора.Вставить("ИдентификаторЗапроса", НомерСтроки.ИдентификаторЗапроса);
	Иначе	
		СтруктураОтбора.Вставить("НомерСтроки", НомерСтроки);
	КонецЕсли;
	
	Если ТекПакет.Свойство("ИмяТабЧасти") И ТекПакет.ИмяТабЧасти = "ПромежуточныеКомплекты" Тогда
		ЕстьСтроки = Объект[ТекПакет.ИмяТабЧасти].НайтиСтроки(СтруктураОтбора);
	Иначе	
		ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
	КонецЕсли;
	
	Если ЕстьСтроки.Количество() = 0 И ТекПакет.Свойство("НомераСтрокНеОтправлено") Тогда
		Если ТипЗнч(ТекПакет.НомераСтрокНеОтправлено) = Тип("Массив") Тогда
			Для Каждого ТекНомерСтроки Из ТекПакет.НомераСтрокНеОтправлено Цикл
				Если ТекПакет.Свойство("ИмяТабЧасти") И ТекПакет.ИмяТабЧасти <> "" Тогда
					ТекСтр = Объект[ТекПакет.ИмяТабЧасти][ТекНомерСтроки-1];
					ТекСтр.ИдентификаторЗапроса = messageId;
					ТекСтр.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета();
					ТекСтр.ОписаниеОшибки = "";
				КонецЕсли;	
			КонецЦикла;
		Иначе
			Если ТекПакет.Свойство("ИмяТабЧасти") И ТекПакет.ИмяТабЧасти <> "" Тогда
				ТекСтр = Объект[ТекПакет.ИмяТабЧасти][ТекПакет.НомераСтрокНеОтправлено-1];
				ТекСтр.ИдентификаторЗапроса = messageId;
				ТекСтр.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета();
				ТекСтр.ОписаниеОшибки = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если ЕстьСтроки.Количество() > 0 Тогда
		Для Каждого ТекСтр Из ЕстьСтроки Цикл
			ТекСтр.ИдентификаторЗапроса = messageId;
			ТекСтр.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета();
			ТекСтр.ОписаниеОшибки = "";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоОжидающимОтвета(НомерСтроки, messageId, ДополнительныеПараметры)
	
	ТекПакет = ДополнительныеПараметры.Пакеты[ДополнительныеПараметры.НомерПакета];
	Если ТекПакет.Свойство("СтатусЗапроса") Тогда
		ТекПакет.СтатусЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета();
	КонецЕсли;	
	ИмяМетода = ТекПакет.ИмяМетода;
	ТекНомерОперации = ДополнительныеПараметры.НомерОперации;
	
	ИмяМетодаРезультат = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияРезультата(ИмяМетода);
	ИмяМетода = ?(ИмяМетодаРезультат = "", ИмяМетода, ИмяМетодаРезультат);
	Если НомерСтроки = 0 
		Или (ТипЗнч(НомерСтроки) = Тип("Массив") И НомерСтроки.Количество() = 1 И НомерСтроки[0] = 0) 
		Или ТекПакет.ИмяТабЧасти = "" Тогда
		Объект.ИдентификаторЗапроса = messageId;
		Объект.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета();
		Объект.ОписаниеОшибки = "";
		Объект.ИмяМетода = ИмяМетода;
		СтруктураПоискаЗапросов = Новый Структура;
		СтруктураПоискаЗапросов.Вставить("НомерСтрокиТаблЧасти", 0);
		СтруктураПоискаЗапросов.Вставить("ИмяТабличнойЧасти", "");
		СтруктураПоискаЗапросов.Вставить("Очередь", ТекНомерОперации);
		МетодЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияЗапроса(ИмяМетода);
		Если МетодЗапроса = "" Тогда
			СтруктураПоискаЗапросов.Вставить("ИмяМетода", ИмяМетода);
		Иначе
			СтруктураПоискаЗапросов.Вставить("ИмяМетода", МетодЗапроса);
		КонецЕсли;
		ЕстьЗапросыДляОбновления = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоискаЗапросов);
		Для Каждого ТекущийЗапрос Из ЕстьЗапросыДляОбновления Цикл
			ТекущийЗапрос.Статус = Объект.СтатусЗапроса;
			ТекущийЗапрос.ОписаниеОшибки = Объект.ОписаниеОшибки;
			ТекущийЗапрос.ИдентификаторЗапроса = messageId;	
		КонецЦикла;
	Иначе	
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИдентификаторЗапроса", messageId);
		Если (ТекПакет.ИмяМетода = "SendGetBatch"
			Или ТекПакет.ИмяМетода = "CheckGetBatch") И ТекПакет.Свойство("ИмяТабЧасти") Тогда
			ЕстьСтроки = Объект[ТекПакет.ИмяТабЧасти].НайтиСтроки(СтруктураОтбора);
		Иначе	
			ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
		КонецЕсли;
		Если ЕстьСтроки.Количество() = 0 Тогда
			
			Если ТипЗнч(НомерСтроки) = Тип("Массив") Тогда
				Для Каждого ТекСтр Из НомерСтроки Цикл
					ЗаполнитьИнформациюПоОжидающимОтветаВСтроке(ТекСтр, messageId, ТекПакет, ТекНомерОперации);	
				КонецЦикла;	
			Иначе
				ЗаполнитьИнформациюПоОжидающимОтветаВСтроке(НомерСтроки, messageId, ТекПакет, ТекНомерОперации);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПоискаЗапросов = Новый Структура;
	СтруктураПоискаЗапросов.Вставить("ИмяТабличнойЧасти", ТекПакет.ИмяТабЧасти);
	ИмяМетодаЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияЗапроса(ТекПакет.ИмяМетода);
	СтруктураПоискаЗапросов.Вставить("ИмяМетода", ?(ИмяМетодаЗапроса = "", ТекПакет.ИмяМетода, ИмяМетодаЗапроса));
	СтруктураПоискаЗапросов.Вставить("Очередь", ДополнительныеПараметры.НомерОперации);
	НужнаДопПроверка = Ложь;
	Если ТекПакет.Свойство("НомераСтрокНеОтправлено") Тогда
		Если ТипЗнч(ТекПакет.НомераСтрокНеОтправлено) = Тип("Массив") Тогда
			Если  ТекПакет.НомераСтрокНеОтправлено.Количество() > 1 Тогда
				НужнаДопПроверка = Истина;
			Иначе
				СтруктураПоискаЗапросов.Вставить("НомерСтрокиТаблЧасти", ТекПакет.НомераСтрокНеОтправлено[0]);
			КонецЕсли;
		Иначе	
			СтруктураПоискаЗапросов.Вставить("НомерСтрокиТаблЧасти", ТекПакет.НомераСтрокНеОтправлено);
		КонецЕсли;
	Иначе
		СтруктураПоискаЗапросов.Вставить("ИдентификаторЗапроса", messageId);
	КонецЕсли;
	
	ЕстьЗапросыДляОбновления = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоискаЗапросов);
	Если ЕстьЗапросыДляОбновления.Количество() > 0 Тогда
		Для Каждого ТекущийЗапрос Из ЕстьЗапросыДляОбновления Цикл
			Если НужнаДопПроверка = Истина 
				И ТекПакет.НомераСтрокНеОтправлено.Найти(ТекущийЗапрос.НомерСтрокиТаблЧасти) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТекущийЗапрос.Статус = ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.ОжиданиеОтвета");
			ТекущийЗапрос.ОписаниеОшибки = "";
			ТекущийЗапрос.ИдентификаторЗапроса = messageId;	
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(ПараметрыЗаписи);
		
	ЗаполнитьСтатусОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПриПараллельнойОтправке(Результат, ДополнительныеПараметры)
	
	ОбработанныйПакет = ДополнительныеПараметры.Пакеты.Получить(ДополнительныеПараметры.НомерПакета);
	ИмяМетодаПолучениеРезультата = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияРезультата(ОбработанныйПакет.ИмяМетода);
	Если ИмяМетодаПолучениеРезультата = "" 
		И Результат.Успех = Истина Тогда
		
		ЗаписатьНовыйСтатус(Результат.Данные.Данные, "Успех", ДополнительныеПараметры, Результат.messageId);
		ЗаписатьНовыйСтатус(Результат.Данные.Ошибки, "Ошибка", ДополнительныеПараметры, Результат.messageId);
		
	ИначеЕсли ИмяМетодаПолучениеРезультата <> "" 
		И Результат.Успех = Истина Тогда
		
		КоличествоПакетов = ДополнительныеПараметры.Пакеты.Количество() + 1;
		
		Если Результат.Свойство("Данные") И ЗначениеЗаполнено(Результат.Данные.messageId) Тогда
			ИдентификаторЗапроса = Результат.Данные.messageId;
		ИначеЕсли ЗначениеЗаполнено(Результат.messageId) Тогда
			ИдентификаторЗапроса = Результат.messageId;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
			ДанныеНовогоПакета = Новый Структура;
			ДанныеНовогоПакета.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
			ДанныеНовогоПакета.Вставить("ИмяМетода", ИмяМетодаПолучениеРезультата);
			ДанныеНовогоПакета.Вставить("ИмяТабЧасти", ОбработанныйПакет.ИмяТабЧасти);
			ДанныеНовогоПакета.Вставить("НомераСтрокНеОтправлено", ОбработанныйПакет.НомераСтрокНеОтправлено);
			Если ОбработанныйПакет.свойство("УИН") Тогда
				ДанныеНовогоПакета.Вставить("УИН", ОбработанныйПакет.УИН);
			КонецЕсли;	
			ДанныеНовогоПакета.Вставить("СтатусЗапроса", Неопределено);
			ДополнительныеПараметры.Пакеты.Вставить(КоличествоПакетов, ДанныеНовогоПакета);
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИмяТабличнойЧасти", ОбработанныйПакет.ИмяТабЧасти);
			СтруктураПоиска.Вставить("Очередь", ДополнительныеПараметры.НомерОперации);
			СтруктураПоиска.Вставить("ИмяМетода", ОбработанныйПакет.ИмяМетода);
			НужнаДопПроверка = Ложь;
			Если ТипЗнч(ОбработанныйПакет.НомераСтрокНеОтправлено) = Тип("Массив") Тогда 
				Если ОбработанныйПакет.НомераСтрокНеОтправлено.Количество() > 1 Тогда
					НужнаДопПроверка = Истина;
				Иначе
				    СтруктураПоиска.Вставить("НомерСтрокиТаблЧасти", ОбработанныйПакет.НомераСтрокНеОтправлено[0]);
				КонецЕсли;
			Иначе	
				СтруктураПоиска.Вставить("НомерСтрокиТаблЧасти", ОбработанныйПакет.НомераСтрокНеОтправлено);
			КонецЕсли;
			ЕстьСтроки = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
			Для Каждого Стр Из ЕстьСтроки Цикл
				Если НужнаДопПроверка И ОбработанныйПакет.НомераСтрокНеОтправлено.Найти(Стр.НомерСтрокиТаблЧасти) = Неопределено Тогда
					Продолжить;
				Иначе	
					Стр.Статус = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета();
					Стр.ИдентификаторЗапроса = ИдентификаторЗапроса;
				КонецЕсли;
			КонецЦикла;
			
			СтруктураПоиска.Удалить("ИмяТабличнойЧасти");
			СтруктураПоиска.Удалить("Очередь");
			Если ОбработанныйПакет.ИмяТабЧасти = "ПромежуточныеКомплекты" Тогда
				СтруктураПоиска.Удалить("ИмяМетода");
				СтруктураПоиска.Вставить("НомерСтроки", СтруктураПоиска.НомерСтрокиТаблЧасти);
				СтруктураПоиска.Удалить("НомерСтрокиТаблЧасти");
			ИначеЕсли ОбработанныйПакет.ИмяТабЧасти = "Камни" Тогда
				СтруктураПоиска.Удалить("ИмяМетода");
				СтруктураПоиска.Вставить("НомерСтроки", СтруктураПоиска.НомерСтрокиТаблЧасти);
				СтруктураПоиска.Удалить("НомерСтрокиТаблЧасти");	
			КонецЕсли;
			Если ОбработанныйПакет.ИмяТабЧасти <> "" Тогда
				ЕстьСтрокиТабЧасти = Объект[ОбработанныйПакет.ИмяТабЧасти].НайтиСтроки(СтруктураПоиска);
				Для Каждого Стр Из ЕстьСтрокиТабЧасти Цикл
					Если НужнаДопПроверка И ОбработанныйПакет.НомераСтрокНеОтправлено.Найти(Стр.НомерСтрокиТаблЧасти) = Неопределено Тогда
						Продолжить;
					Иначе	
						Стр.СтатусЗапроса = ИнтеграцияГИИСДМДККлиент.СтатусОжиданиеОтвета();
						Стр.ИдентификаторЗапроса = ИдентификаторЗапроса;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		
			ОбработанныйПакет.СтатусЗапроса = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусУспех();
		КонецЕсли;
		
	ИначеЕсли Результат.Успех = Ложь Тогда
		
		Если ЗначениеЗаполнено(Результат.messageId) Тогда
			ЗаполнитьИнформациюПоОжидающимОтвета(ДополнительныеПараметры.НомераСтрок, Результат.messageId, ДополнительныеПараметры);
		КонецЕсли;
			
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(ПараметрыЗаписи);				
				
	Если ДополнительныеПараметры.Свойство("НомерПакета") И Результат.Успех = Истина 
		И (Результат.Данные.Свойство("Данные") И Результат.Данные.Данные.Количество() > 0 Или Результат.Данные.Свойство("Данные") = Ложь) Тогда
			
		ОтправитьИнформациюОКомплектации(ДополнительныеПараметры.Сертификат, ДополнительныеПараметры.Пакеты,
				ДополнительныеПараметры.НомерПакета + 1, ДополнительныеПараметры.НомерОперации, ДополнительныеПараметры.ПереходитьКСледующейОперации);
						
	Иначе
		
		Элементы.ГруппаТекущийПроцесс.Видимость = Ложь;
		ИдетОтправкаДанных = Ложь;
			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПриПоследовательнойОтправке(Результат, ДополнительныеПараметры)
	Если Результат.Успех = Истина Тогда
		
		ЗаписатьНовыйСтатус(Результат.Данные.Данные, "Успех", ДополнительныеПараметры, Результат.messageId);
		ЗаписатьНовыйСтатус(Результат.Данные.Ошибки, "Ошибка", ДополнительныеПараметры, Результат.messageId);
		
	ИначеЕсли Результат.Успех = Ложь Тогда
		
		//УстановитьВидимостьПредупреждения(Истина);
		
		Если ЗначениеЗаполнено(Результат.messageId) Тогда
			ЗаполнитьИнформациюПоОжидающимОтвета(ДополнительныеПараметры.НомераСтрок, Результат.messageId, ДополнительныеПараметры);
		КонецЕсли;
			
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	Записать(ПараметрыЗаписи);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("СтатусЗапроса", ПредопределенноеЗначение("Перечисление.СтатусОтветаГИИСДМДК.Успех"));
	ЕстьСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);				
				
	Если ДополнительныеПараметры.Свойство("НомерПакета") И Результат.Успех = Истина И Результат.Данные.Данные.Количество() > 0 Тогда
			
		ОтправитьИнформациюОКомплектации(ДополнительныеПараметры.Сертификат, ДополнительныеПараметры.Пакеты,
				ДополнительныеПараметры.НомерПакета + 1, ДополнительныеПараметры.НомерОперации, ДополнительныеПараметры.ПереходитьКСледующейОперации);
				
		
	Иначе
		
		Элементы.ГруппаТекущийПроцесс.Видимость = Ложь;
		ИдетОтправкаДанных = Ложь;
		
		ПараметрыЗаписи = Новый Структура;
    	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаКомплектацийВГИИСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Объект.ПараллельнаяОтправкаДанных Тогда
		ОбработкаОтветаПриПараллельнойОтправке(Результат, ДополнительныеПараметры);
	Иначе
		ОбработкаОтветаПриПоследовательнойОтправке(Результат, ДополнительныеПараметры);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДокументаСОперациейКомплектацияИзделий(ДанныеШапкиДокументов, ДанныеПоТоварам,
		ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту)
	
	МассивТоваров = Новый Массив;
	
	ДанныеШапкиДокументов.Следующий();
	
	ТаблицаДополнительныхПроб = Новый ТаблицаЗначений;
	ТаблицаДополнительныхПроб.Колонки.Добавить("Металл");
	ТаблицаДополнительныхПроб.Колонки.Добавить("ВесМеталлаВЧистоте");
	
	Спецификация = Новый Структура;		
	Спецификация.Вставить("Номер", ДанныеШапкиДокументов.Номер);
	Спецификация.Вставить("Дата", ДанныеШапкиДокументов.Дата);
	
	ПараметрыНаименования = Новый Структура;
	ПараметрыНаименования.Вставить("НаименованиеГИИИСДМДК", ДанныеШапкиДокументов.ТипИзделияНаименованиеГИИСДМДК);
	ПараметрыНаименования.Вставить("Наименование", ДанныеШапкиДокументов.ТипИзделияНаименование);
	ПараметрыНаименования.Вставить("Металл", ДанныеШапкиДокументов.Металл);
	ПараметрыНаименования.Вставить("ПробаЧисло", ДанныеШапкиДокументов.Проба);
	ПараметрыНаименования.Вставить("МножественноеЧисло", ДанныеШапкиДокументов.ТипИзделияВоМножественномЧисле);
	ПараметрыНаименования.Вставить("Род", ДанныеШапкиДокументов.ТипИзделияРодНаименования);
	ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", ДанныеШапкиДокументов.НаименованиеСерии);
	ПараметрыНаименования.Вставить("ШтрихкодПоставщика", ДанныеШапкиДокументов.НомерПаспорта);
	ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
	ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
	
	Наименования = ИнтеграцияГИИСДМДКЮТДСервер.НаименованиеЮвелирногоИзделия(ПараметрыНаименования);
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("НомерСтроки", 0);
	СтруктураСтроки.Вставить("УИН", ДанныеШапкиДокументов.УИН);
	СтруктураСтроки.Вставить("Наименование", Наименования);	
	СтруктураСтроки.Вставить("ТипПартии", ДанныеШапкиДокументов.ТипПартии);
	СтруктураСтроки.Вставить("ВидПартии", ДанныеШапкиДокументов.ВидПартии);
	СтруктураСтроки.Вставить("ЭтапОбработки", ДанныеШапкиДокументов.ЭтапОбработки);
	СтруктураСтроки.Вставить("СтадияОбработки", ДанныеШапкиДокументов.СтадияОбработки);
	СтруктураСтроки.Вставить("ОКПД2", ДанныеШапкиДокументов.ОКПД2);
	
	СтруктураОрганизации = Новый Структура;
	Если ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураОрганизации.Вставить("ТипКонтрагента", "legal");
		Если ДанныеШапкиДокументов.ОрганизацияКПП = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен КПП организации ");
		КонецЕсли;	
		Если ДанныеШапкиДокументов.ОрганизацияОГРН = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОГРН организации");
		КонецЕсли;
	ИначеЕсли ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		СтруктураОрганизации.Вставить("ТипКонтрагента", "physical");
		Если ДанныеШапкиДокументов.ОрганизацияОГРН = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОГРН организации");
		КонецЕсли;
	КонецЕсли;
	СтруктураОрганизации.Вставить("ИНН", ДанныеШапкиДокументов.ОрганизацияИНН);
	Если ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураОрганизации.Вставить("КПП", ДанныеШапкиДокументов.ОрганизацияКПП);
	Иначе
		СтруктураОрганизации.Вставить("КПП", "");
	КонецЕсли;	
	СтруктураОрганизации.Вставить("ОГРН", ДанныеШапкиДокументов.ОрганизацияОГРН);
	СтруктураСтроки.Вставить("Собственник", СтруктураОрганизации);
	
	СтруктураСтроки.Вставить("Вес", ДанныеШапкиДокументов.Вес * ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса());
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", ДанныеШапкиДокументов.ЕдиницаИзмерения);	
	
	СтруктураСтроки.Вставить("Количество", ДанныеШапкиДокументов.Количество);
			
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", "GRM");
	
	СтруктураПартии = Новый Структура;
	СтруктураПартии.Вставить("Код", ДанныеШапкиДокументов.НаименованиеСерии);
	СтруктураПартии.Вставить("Наименование", Наименования);
	СтруктураСтроки.Вставить("СведенияОКомплекте",  СтруктураПартии);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СсылкаНаДокумент", ДанныеШапкиДокументов.Ссылка);
	ЕстьСтрокиДокумента = ДанныеПоТоварам.НайтиСтроки(СтруктураПоиска);
	МассивРодительскихПартий = Новый Массив;
	Для Каждого Стр Из ЕстьСтрокиДокумента Цикл
		СтруктураПартии = Новый Структура;	
		СтруктураПартии.Вставить("НомерСтроки", Стр.НомерСтроки);
		СтруктураПартии.Вставить("ИНП", Стр.ИНП);
		СтруктураПартии.Вставить("Количество", Стр.Количество);
		МассивРодительскихПартий.Добавить(СтруктураПартии);	
		Если Стр.ИНП = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен УИН в строке " + Стр.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	СтруктураСтроки.Вставить("РодительскиеПартии", МассивРодительскихПартий);
	
	МассивТоваров.Добавить(СтруктураСтроки);
	
	Спецификация.Вставить("МассивТоваров", МассивТоваров);

	Возврат Спецификация;

КонецФункции	
	
&НаСервере
Функция ПодготовитьДанныеДокументаСОперациейКомплектации(ДанныеШапкиДокументов, ДанныеПоТоварам, ДанныеПоДопПробе,
		ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту)
	
	МассивТоваров = Новый Массив;
	ДанныеШапкиДокументов.Следующий();
	ТаблицаДополнительныхПроб = Новый ТаблицаЗначений;
	ТаблицаДополнительныхПроб.Колонки.Добавить("Металл");
	ТаблицаДополнительныхПроб.Колонки.Добавить("ВесМеталлаВЧистоте");
	ТаблицаДополнительныхПроб.Колонки.Добавить("Проба");
	
	Спецификация = Новый Структура;		
	Спецификация.Вставить("Номер", ДанныеШапкиДокументов.Номер);
	Спецификация.Вставить("Дата", ДанныеШапкиДокументов.Дата);
	
	ПараметрыНаименования = Новый Структура;
	ПараметрыНаименования.Вставить("ВидНоменклатуры", ДанныеШапкиДокументов.ВидНоменклатуры);
	ПараметрыНаименования.Вставить("Камень", ДанныеШапкиДокументов.Камень);
	ПараметрыНаименования.Вставить("Наименование", ДанныеШапкиДокументов.Наименование);
	ПараметрыНаименования.Вставить("НаименованиеПолное", ДанныеШапкиДокументов.НаименованиеПолное);
	ПараметрыНаименования.Вставить("НаименованиеГИИСДМДК", ДанныеШапкиДокументов.НаименованиеГИИСДМДК);
	ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", ДанныеШапкиДокументов.НаименованиеСерии);
	ПараметрыНаименования.Вставить("ШтрихкодПоставщика", ДанныеШапкиДокументов.НомерПаспорта);
	ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
	ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
	
	Наименования = ИнтеграцияГИИСДМДКЮТДСервер.НаименованияМатериала(ПараметрыНаименования);
	
	Если Не ЗначениеЗаполнено(Наименования.Наименование) Тогда
		Наименования.Наименование = "Преобразование в лом " + ДанныеШапкиДокументов.Номер;
	КонецЕсли; 
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("НомерСтроки", 0);
	СтруктураСтроки.Вставить("Наименование", Наименования.Наименование);	
	СтруктураСтроки.Вставить("ТипПартии", ДанныеШапкиДокументов.ТипПартии);
	СтруктураСтроки.Вставить("ВидПартии", ДанныеШапкиДокументов.ВидПартии);
	СтруктураСтроки.Вставить("ЭтапОбработки", ДанныеШапкиДокументов.ЭтапОбработки);
	СтруктураСтроки.Вставить("СтадияОбработки", ДанныеШапкиДокументов.СтадияОбработки);
	СтруктураСтроки.Вставить("ОКПД2", ДанныеШапкиДокументов.ОКПД2);
	
	СтруктураОрганизации = Новый Структура;
	Если ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураОрганизации.Вставить("ТипКонтрагента", "legal");
		Если ДанныеШапкиДокументов.ОрганизацияКПП = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен КПП организации ");
		КонецЕсли;	
		Если ДанныеШапкиДокументов.ОрганизацияОГРН = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОГРН организации");
		КонецЕсли;
	ИначеЕсли ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		СтруктураОрганизации.Вставить("ТипКонтрагента", "physical");
		Если ДанныеШапкиДокументов.ОрганизацияОГРН = "" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОГРН организации");
		КонецЕсли;
	КонецЕсли;
	СтруктураОрганизации.Вставить("ИНН", ДанныеШапкиДокументов.ОрганизацияИНН);
	Если ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураОрганизации.Вставить("КПП", ДанныеШапкиДокументов.ОрганизацияКПП);
	Иначе
		СтруктураОрганизации.Вставить("КПП", "");
	КонецЕсли;	
	СтруктураОрганизации.Вставить("ОГРН", ДанныеШапкиДокументов.ОрганизацияОГРН);
	СтруктураСтроки.Вставить("Собственник", СтруктураОрганизации);
	
	СтруктураСтроки.Вставить("Вес", ДанныеШапкиДокументов.Вес * ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса());
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", ДанныеШапкиДокументов.ЕдиницаИзмерения);	
	
	СтруктураСтроки.Вставить("Количество", 1);
				
	СтруктураПартии = Новый Структура;
	СтруктураПартии.Вставить("ВидОсновногоМеталла", ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(ДанныеШапкиДокументов.Металл));
	Если СтруктураПартии.ВидОсновногоМеталла = "No" Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не определен вид металла для серии " + ДанныеШапкиДокументов.НаименованиеСерии);
	КонецЕсли;
	СтруктураПартии.Вставить("Металл", СтруктураПартии.ВидОсновногоМеталла);
	СтруктураПартии.Вставить("Проба", ДанныеШапкиДокументов.Проба*100);
	Если СтруктураПартии.Проба = 0 Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена проба для серии " + ДанныеШапкиДокументов.НаименованиеСерии);
	КонецЕсли;
	
	СтруктураПартии.Вставить("ПробаПодтвержденная", СтруктураПартии.Проба);
	МассивСплавов = Новый Массив;
	СтруктураМеталла = Новый Структура;
	СтруктураМеталла.Вставить("Металл", СтруктураПартии.ВидОсновногоМеталла);
	СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", ДанныеШапкиДокументов.ВесМеталлаВЧистоте * ИнтеграцияГИИСДМДК.КоэффициентВеса());
	СтруктураМеталла.Вставить("Проба", ДанныеШапкиДокументов.Проба*100);
	СтруктураМеталла.Вставить("ПробаПодтвержденная", ДанныеШапкиДокументов.Проба*100);
	МассивСплавов.Добавить(СтруктураМеталла);
	
	ТаблицаДополнительныхПроб.Очистить();
	Для Каждого СтрДопМатериал Из ДанныеПоДопПробе Цикл
		Если Не ЗначениеЗаполнено(СтрДопМатериал.МатериалМеталл) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрДопМатериал.Вес = 0 
			или СтрДопМатериал.МатериалМеталл.НеДрагоценныйМеталл  Тогда
			Продолжить;
		КонецЕсли;	
		Если СтрДопМатериал.МатериалМеталл.ПробаЧистоты = 0 Тогда
			ТекВесМеталлаВЧистоте = 0;
		Иначе	
			ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
			* СтрДопМатериал.МатериалПроба/СтрДопМатериал.МатериалМеталл.ПробаЧистоты, 3);
		КонецЕсли;
		Если ТекВесМеталлаВЧистоте = 0 Тогда
			Продолжить;
		КонецЕсли;	
		МеталлДопПробы = ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(СтрДопМатериал.МатериалМеталл);
		Если СтруктураМеталла.Металл = МеталлДопПробы И СтрДопМатериал.МатериалПроба*100 = СтруктураПартии.Проба Тогда
			Продолжить;	
		ИначеЕсли СтруктураМеталла.Металл = МеталлДопПробы Тогда
			СтруктураМеталла.ВесМеталлаВЧистоте = СтруктураМеталла.ВесМеталлаВЧистоте + ТекВесМеталлаВЧистоте*100000;
		Иначе	
			СтруктураДопМеталла = ТаблицаДополнительныхПроб.Добавить();
			СтруктураДопМеталла.Металл = МеталлДопПробы;				
			СтруктураДопМеталла.ВесМеталлаВЧистоте = ТекВесМеталлаВЧистоте*100000;
			СтруктураДопМеталла.Проба = СтрДопМатериал.МатериалПроба;
		КонецЕсли;
	КонецЦикла;	
	Если ТаблицаДополнительныхПроб.Количество() > 0 Тогда
		ТаблицаДополнительныхПроб.Свернуть("Металл,Проба", "ВесМеталлаВЧистоте");
		Для Каждого СтрокаДопПробы Из ТаблицаДополнительныхПроб Цикл
			СтруктураДопМеталла = Новый Структура;
			СтруктураДопМеталла.Вставить("Металл", СтрокаДопПробы.Металл);				
			СтруктураДопМеталла.Вставить("ВесМеталлаВЧистоте",  СтрокаДопПробы.ВесМеталлаВЧистоте);
			СтруктураДопМеталла.Вставить("Проба", СтрокаДопПробы.Проба*100);
			СтруктураДопМеталла.Вставить("ПробаПодтвержденная", СтрокаДопПробы.Проба*100);
			МассивСплавов.Добавить(СтруктураДопМеталла);	
		КонецЦикла;	
	КонецЕсли;
	
	СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);
	СтруктураСтроки.Вставить("СведенияОМеталле",  СтруктураПартии);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СсылкаНаДокумент", ДанныеШапкиДокументов.Ссылка);
	ЕстьСтрокиДокумента = ДанныеПоТоварам.НайтиСтроки(СтруктураПоиска);
	МассивРодительскихПартий = Новый Массив;
	Для Каждого Стр Из ЕстьСтрокиДокумента Цикл
		СтруктураПартии = Новый Структура;	
		СтруктураПартии.Вставить("НомерСтроки", Стр.НомерСтроки);
		СтруктураПартии.Вставить("УИН", Стр.ИНППреобразованияВЛом);
		СтруктураПартии.Вставить("Количество", Стр.Количество);
		ТекВес = Стр.Вес;
		ТекВесВЧистоте = Стр.ВесМеталлаВЧистоте;
		
		СтруктураПартии.Вставить("Вес", ТекВес * ИнтеграцияГИИСДМДК.КоэффициентВеса());
		МассивСплавов = Новый Массив;
		СтруктураМеталла = Новый Структура;
		СтруктураМеталла.Вставить("Металл", ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(Стр.Металл));
		//ВесМеталлаВЧистоте = ?(ТекВесВЧистоте = 0, Окр(ТекВес * Стр.Проба / 999.9, 3), ТекВесВЧистоте);
		СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", ТекВесВЧистоте * ИнтеграцияГИИСДМДК.КоэффициентВеса());
		СтруктураМеталла.Вставить("Проба",  Стр.Проба*100);
		СтруктураМеталла.Вставить("ПробаПодтвержденная",  Стр.Проба*100);
		МассивСплавов.Добавить(СтруктураМеталла);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НомерСтроки", Стр.НомерСтроки);
		ЕстьСтрокиСХарактеристикой = ДанныеПоДопПробе.НайтиСтроки(СтруктураПоиска);
		ТаблицаДополнительныхПроб.Очистить();
		Для Каждого СтрДопМатериал Из ЕстьСтрокиСХарактеристикой Цикл
			Если Не ЗначениеЗаполнено(СтрДопМатериал.МатериалМеталл) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрДопМатериал.Вес = 0 
				или СтрДопМатериал.МатериалМеталл.НеДрагоценныйМеталл  Тогда
				Продолжить;
			КонецЕсли;	
			Если СтрДопМатериал.МатериалМеталл.ПробаЧистоты = 0 Тогда
				ТекВесМеталлаВЧистоте = 0;
			Иначе	
				ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
				* СтрДопМатериал.МатериалПроба/СтрДопМатериал.МатериалМеталл.ПробаЧистоты, 3);
			КонецЕсли;
			Если ТекВесМеталлаВЧистоте = 0 Тогда
				Продолжить;
			КонецЕсли;	
			МеталлДопПробы = ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(СтрДопМатериал.МатериалМеталл);
			Если СтруктураМеталла.Металл = МеталлДопПробы Тогда
				СтруктураМеталла.ВесМеталлаВЧистоте = СтруктураМеталла.ВесМеталлаВЧистоте;// + ТекВесМеталлаВЧистоте*100000;
			Иначе	
				СтруктураДопМеталла = ТаблицаДополнительныхПроб.Добавить();
				СтруктураДопМеталла.Металл = МеталлДопПробы;				
				СтруктураДопМеталла.ВесМеталлаВЧистоте = ТекВесМеталлаВЧистоте*100000;
				СтруктураДопМеталла.Проба = СтрДопМатериал.МатериалПроба;
			КонецЕсли;
		КонецЦикла;	
		Если ТаблицаДополнительныхПроб.Количество() > 0 Тогда
			ТаблицаДополнительныхПроб.Свернуть("Металл,Проба", "ВесМеталлаВЧистоте");
			Для Каждого СтрокаДопПробы Из ТаблицаДополнительныхПроб Цикл
				СтруктураДопМеталла = Новый Структура;
				СтруктураДопМеталла.Вставить("Металл", СтрокаДопПробы.Металл);				
				СтруктураДопМеталла.Вставить("ВесМеталлаВЧистоте",  СтрокаДопПробы.ВесМеталлаВЧистоте);
				СтруктураДопМеталла.Вставить("Проба",  СтрокаДопПробы.Проба*100);
				СтруктураДопМеталла.Вставить("ПробаПодтвержденная",  СтрокаДопПробы.Проба*100);
				МассивСплавов.Добавить(СтруктураДопМеталла);	
			КонецЦикла;	
		КонецЕсли;
		
		СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);

		МассивРодительскихПартий.Добавить(СтруктураПартии);				   
	КонецЦикла;
	СтруктураСтроки.Вставить("МассивРодительскихПартий", МассивРодительскихПартий);
	
	МассивТоваров.Добавить(СтруктураСтроки);
	
	Спецификация.Вставить("МассивТоваров", МассивТоваров);

	Возврат Спецификация;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеДокументаСОперациейКомплектацииПараллельно(ДанныеДляПодготовки)
		
	НомерПакета = ДанныеДляПодготовки.НомерПакета;
	Пакеты = ДанныеДляПодготовки.Пакеты;
	ПоискТоваровПоВнутреннемуШК = ДанныеДляПодготовки.ПоискТоваровПоВнутреннемуШК;
	ПоискТоваровПоПаспорту = ДанныеДляПодготовки.ПоискТоваровПоПаспорту;
	ДанныеШапкиДокументов = ДанныеДляПодготовки.ДанныеШапкиДокументов;
	ДанныеПоТоварам = ДанныеДляПодготовки.ДанныеПоТоварам;
	ДанныеПоДопПробе = ДанныеДляПодготовки.ДанныеПоДопМатериалам;
	ДанныеПоПромежуточнымКомплектам = ДанныеДляПодготовки.ДанныеПоПромежуточнымКомплектам;
	
	ДанныеШапкиДокументов.Следующий();
	
	МассивТоваров = Новый Массив;
	
	ТаблицаДополнительныхПроб = Новый ТаблицаЗначений;
	ТаблицаДополнительныхПроб.Колонки.Добавить("Металл");
	ТаблицаДополнительныхПроб.Колонки.Добавить("ВесМеталлаВЧистоте");
	ТаблицаДополнительныхПроб.Колонки.Добавить("Проба");
	
	ТаблицаДополнительныхПробНаИзделие = Новый ТаблицаЗначений;
	ТаблицаДополнительныхПробНаИзделие.Колонки.Добавить("Металл");
	ТаблицаДополнительныхПробНаИзделие.Колонки.Добавить("ВесМеталлаВЧистоте");
	ТаблицаДополнительныхПробНаИзделие.Колонки.Добавить("Проба");
	
	Спецификация = Новый Структура;		
	Спецификация.Вставить("Номер", ДанныеШапкиДокументов.Номер);
	Спецификация.Вставить("Дата", ДанныеШапкиДокументов.Дата);
	
	ПараметрыНаименования = Новый Структура;
	ПараметрыНаименования.Вставить("ВидНоменклатуры", ДанныеШапкиДокументов.ВидНоменклатуры);
	ПараметрыНаименования.Вставить("Камень", ДанныеШапкиДокументов.Камень);
	ПараметрыНаименования.Вставить("Наименование", ДанныеШапкиДокументов.Наименование);
	ПараметрыНаименования.Вставить("НаименованиеПолное", ДанныеШапкиДокументов.НаименованиеПолное);
	ПараметрыНаименования.Вставить("НаименованиеГИИСДМДК", ДанныеШапкиДокументов.НаименованиеГИИСДМДК);
	ПараметрыНаименования.Вставить("ВнутреннийШтрихкод", ДанныеШапкиДокументов.НаименованиеСерии);
	ПараметрыНаименования.Вставить("ШтрихкодПоставщика", ДанныеШапкиДокументов.НомерПаспорта);
	ПараметрыНаименования.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
	ПараметрыНаименования.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
	
	Наименования = ИнтеграцияГИИСДМДКЮТДСервер.НаименованияМатериала(ПараметрыНаименования);
	
	СчПартий = 0;
	Для Каждого ТекКомплект Из ДанныеПоПромежуточнымКомплектам Цикл
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("НомерСтроки", ТекКомплект.НомерСтроки);
		СтруктураСтроки.Вставить("Наименование", Наименования.Наименование + " " + ТекКомплект.НомерСтроки);	
		СтруктураСтроки.Вставить("ТипПартии", ДанныеШапкиДокументов.ТипПартии);
		СтруктураСтроки.Вставить("ВидПартии", ДанныеШапкиДокументов.ВидПартии);
		СтруктураСтроки.Вставить("ЭтапОбработки", ДанныеШапкиДокументов.ЭтапОбработки);
		СтруктураСтроки.Вставить("СтадияОбработки", ДанныеШапкиДокументов.СтадияОбработки);
		СтруктураСтроки.Вставить("ОКПД2", ДанныеШапкиДокументов.ОКПД2);
		
		СтруктураОрганизации = Новый Структура;
		Если ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураОрганизации.Вставить("ТипКонтрагента", "legal");
			Если ДанныеШапкиДокументов.ОрганизацияКПП = "" Тогда
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен КПП организации ");
			КонецЕсли;	
			Если ДанныеШапкиДокументов.ОрганизацияОГРН = "" Тогда
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОГРН организации");
			КонецЕсли;
		ИначеЕсли ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураОрганизации.Вставить("ТипКонтрагента", "physical");
			Если ДанныеШапкиДокументов.ОрганизацияОГРН = "" Тогда
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнен ОГРН организации");
			КонецЕсли;
		КонецЕсли;
		СтруктураОрганизации.Вставить("ИНН", ДанныеШапкиДокументов.ОрганизацияИНН);
		Если ДанныеШапкиДокументов.ОрганизацияЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			СтруктураОрганизации.Вставить("КПП", ДанныеШапкиДокументов.ОрганизацияКПП);
		Иначе
			СтруктураОрганизации.Вставить("КПП", "");
		КонецЕсли;	
		СтруктураОрганизации.Вставить("ОГРН", ДанныеШапкиДокументов.ОрганизацияОГРН);
		СтруктураСтроки.Вставить("Собственник", СтруктураОрганизации);
		
		СтруктураСтроки.Вставить("Вес", ТекКомплект.Вес * ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.КоэффициентВеса());
		СтруктураСтроки.Вставить("ЕдиницаИзмерения", ДанныеШапкиДокументов.ЕдиницаИзмерения);	
		
		СтруктураСтроки.Вставить("Количество", 0);
		
		СтруктураПартии = Новый Структура;
		СтруктураПартии.Вставить("ВидОсновногоМеталла", ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(ДанныеШапкиДокументов.Металл));
		Если СтруктураПартии.ВидОсновногоМеталла = "No" Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не определен вид металла для серии " + ДанныеШапкиДокументов.НаименованиеСерии);
		КонецЕсли;
		СтруктураПартии.Вставить("Металл", СтруктураПартии.ВидОсновногоМеталла);
		СтруктураПартии.Вставить("Проба", ДанныеШапкиДокументов.Проба*100);
		Если СтруктураПартии.Проба = 0 Тогда
			ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не заполнена проба для серии " + ДанныеШапкиДокументов.НаименованиеСерии);
		КонецЕсли;
		
		СтруктураПартии.Вставить("ПробаПодтвержденная", СтруктураПартии.Проба);
		МассивСплавов = Новый Массив;
		СтруктураМеталла = Новый Структура;
		СтруктураМеталла.Вставить("Металл", СтруктураПартии.ВидОсновногоМеталла);
		СтруктураМеталла.Вставить("ВесМеталлаВЧистоте", ТекКомплект.ВесВХимЧистоте * ИнтеграцияГИИСДМДК.КоэффициентВеса());

		МассивСплавов.Добавить(СтруктураМеталла);
		
		ТаблицаДополнительныхПробНаИзделие.Очистить();
		
		МассивСтрок = Новый Массив;
		МассивРодительскихПартий = Новый Массив;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НомерСтрокиТаблЧасти", ТекКомплект.НомерСтроки);
		ЕстьСтрокиДокумента = ДанныеПоТоварам.НайтиСтроки(СтруктураПоиска);
		ВесМеталлаВЧистоте = 0;
		Для Каждого СтрТовары Из ЕстьСтрокиДокумента Цикл
			
			МассивСтрок.Добавить(СтрТовары.НомерСтроки);
			
			ВесВЧистотеДопМеталл = 0;
			ТаблицаДополнительныхПроб.Очистить();
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("НомерСтроки", СтрТовары.НомерСтроки);
			ЕстьСтрокиДанныеПоДопПробе = ДанныеПоДопПробе.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрДопМатериал Из ЕстьСтрокиДанныеПоДопПробе Цикл
				Если Не ЗначениеЗаполнено(СтрДопМатериал.МатериалМеталл) Тогда
					Продолжить;
				КонецЕсли;
				Если СтрДопМатериал.Вес = 0 
					или СтрДопМатериал.МатериалМеталл.НеДрагоценныйМеталл  Тогда
					Продолжить;
				КонецЕсли;	
				Если СтрДопМатериал.МатериалМеталл.ПробаЧистоты = 0 Тогда
					ТекВесМеталлаВЧистоте = 0;
				Иначе	
					ТекВесМеталлаВЧистоте = Окр(СтрДопМатериал.Вес 
					* СтрДопМатериал.МатериалПроба/СтрДопМатериал.МатериалМеталл.ПробаЧистоты, 3);
				КонецЕсли;
				Если ТекВесМеталлаВЧистоте = 0 Тогда
					Продолжить;
				КонецЕсли;	
				МеталлДопПробы = ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(СтрДопМатериал.МатериалМеталл);
				Если СтруктураМеталла.Металл = МеталлДопПробы И СтрДопМатериал.МатериалПроба*100 = СтруктураПартии.Проба Тогда
					Продолжить;	
				ИначеЕсли СтруктураМеталла.Металл = МеталлДопПробы И СтруктураМеталла.Проба = СтрДопМатериал.МатериалПроба*100 Тогда
					СтруктураМеталла.ВесМеталлаВЧистоте = СтруктураМеталла.ВесМеталлаВЧистоте + ТекВесМеталлаВЧистоте*100000;
					ВесВЧистотеДопМеталл = ВесВЧистотеДопМеталл + ТекВесМеталлаВЧистоте;
				Иначе	
					СтруктураДопМеталла = ТаблицаДополнительныхПроб.Добавить();
					СтруктураДопМеталла.Металл = МеталлДопПробы;				
					СтруктураДопМеталла.ВесМеталлаВЧистоте = ТекВесМеталлаВЧистоте*100000;
					СтруктураДопМеталла.Проба = СтрДопМатериал.МатериалПроба;
					
					СтруктураДопМеталла = ТаблицаДополнительныхПробНаИзделие.Добавить();
					СтруктураДопМеталла.Металл = МеталлДопПробы;				
					СтруктураДопМеталла.ВесМеталлаВЧистоте = ТекВесМеталлаВЧистоте*100000;
					СтруктураДопМеталла.Проба = СтрДопМатериал.МатериалПроба;
				КонецЕсли;
			КонецЦикла;
			
			СтруктураПартииОбщ = Новый Структура;	
			СтруктураПартииОбщ.Вставить("НомерСтроки", СтрТовары.НомерСтроки);
			СтруктураПартииОбщ.Вставить("УИН", СтрТовары.ИНППреобразованияВЛом);
			СтруктураПартииОбщ.Вставить("Количество", СтрТовары.Количество);
			ТекВес = СтрТовары.Вес;
			ТекВесВЧистоте = СтрТовары.ВесМеталлаВЧистоте;
			
			СтруктураПартииОбщ.Вставить("Вес", ТекВес * ИнтеграцияГИИСДМДК.КоэффициентВеса());
			СтруктураМеталлаРодителя = Новый Структура;
			СтруктураМеталлаРодителя.Вставить("Металл", ИнтеграцияГИИСДМДКЮТДСервер.ПолучитьМеталлПартии(СтрТовары.Металл));
			СтруктураМеталлаРодителя.Вставить("ВесМеталлаВЧистоте", (ТекВесВЧистоте + ВесВЧистотеДопМеталл) * ИнтеграцияГИИСДМДК.КоэффициентВеса());
			СтруктураМеталлаРодителя.Вставить("Проба", СтрТовары.Проба*100);
			СтруктураМеталлаРодителя.Вставить("ПробаПодтвержденная", СтрТовары.Проба*100);
			
			СтруктураМеталла.Вставить("Проба", СтрТовары.Проба*100);
			СтруктураМеталла.Вставить("ПробаПодтвержденная", СтрТовары.Проба*100);
			
			ВесМеталлаВЧистоте = ВесМеталлаВЧистоте + ТекВесВЧистоте;
			МассивСплавовОбщ = Новый Массив;
			МассивСплавовОбщ.Добавить(СтруктураМеталлаРодителя);
				
			Если ТаблицаДополнительныхПроб.Количество() > 0 Тогда
				ТаблицаДополнительныхПроб.Свернуть("Металл,Проба", "ВесМеталлаВЧистоте");
				Для Каждого СтрокаДопПробы Из ТаблицаДополнительныхПроб Цикл
					СтруктураДопМеталла = Новый Структура;
					СтруктураДопМеталла.Вставить("Металл", СтрокаДопПробы.Металл);				
					СтруктураДопМеталла.Вставить("ВесМеталлаВЧистоте",  СтрокаДопПробы.ВесМеталлаВЧистоте);
					СтруктураДопМеталла.Вставить("Проба", СтрокаДопПробы.Проба*100);
					СтруктураДопМеталла.Вставить("ПробаПодтвержденная", СтрокаДопПробы.Проба*100);
					МассивСплавовОбщ.Добавить(СтруктураДопМеталла);	
				КонецЦикла;	
			КонецЕсли;
			
			СтруктураПартииОбщ.Вставить("СведенияОСплаве", МассивСплавовОбщ);
			
			МассивРодительскихПартий.Добавить(СтруктураПартииОбщ);
			
		КонецЦикла;
		Если ТаблицаДополнительныхПробНаИзделие.Количество() > 0 Тогда
			ТаблицаДополнительныхПробНаИзделие.Свернуть("Металл,Проба", "ВесМеталлаВЧистоте");
			Для Каждого СтрокаДопПробы Из ТаблицаДополнительныхПробНаИзделие Цикл
				СтруктураДопМеталла = Новый Структура;
				СтруктураДопМеталла.Вставить("Металл", СтрокаДопПробы.Металл);				
				СтруктураДопМеталла.Вставить("ВесМеталлаВЧистоте",  СтрокаДопПробы.ВесМеталлаВЧистоте);
				СтруктураДопМеталла.Вставить("Проба", СтрокаДопПробы.Проба*100);
				СтруктураДопМеталла.Вставить("ПробаПодтвержденная", СтрокаДопПробы.Проба*100);
				МассивСплавов.Добавить(СтруктураДопМеталла);	
			КонецЦикла;	
		КонецЕсли;
		
		Если СтрТовары <> Неопределено И МассивСплавов[0].ВесМеталлаВЧистоте = 0 Тогда
			МассивСплавов[0].ВесМеталлаВЧистоте = ВесМеталлаВЧистоте;
			
			СтрокаПромежуточныеКомплекты = Объект.ПромежуточныеКомплекты[ТекКомплект.НомерСтроки - 1];
			СтрокаПромежуточныеКомплекты.ВесВХимЧистоте = ВесМеталлаВЧистоте;
			СтрокаПромежуточныеКомплекты.ТипМеталла = СтрТовары.Металл;
		КонецЕсли;
		
		СтруктураПартии.Вставить("СведенияОСплаве", МассивСплавов);
		СтруктураСтроки.Вставить("СведенияОМеталле",  СтруктураПартии);
		
		СтруктураСтроки.Вставить("МассивРодительскихПартий", МассивРодительскихПартий);
		
		МассивТоваров.Добавить(СтруктураСтроки);
		
		Спецификация.Вставить("МассивТоваров", МассивТоваров);
		Результат = Новый Структура();
		Результат.Вставить("Спецификации", Спецификация);
		Результат.Вставить("НомераСтрокНеОтправлено", ТекКомплект.НомерСтроки);			
		Результат.Вставить("НомераСтрокДляЗаполнения", МассивСтрок);
		Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектацийНаРегистрацию());
		Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
		Результат.Вставить("ИмяТабЧасти", "ПромежуточныеКомплекты");
		НомерПакета = НомерПакета + 1;
		Пакеты.Вставить(НомерПакета, Результат);
	КонецЦикла;

	Возврат Пакеты;
	
КонецФункции
	
&НаСервере
Функция ПолучитьДанныеКомплектацииДляОбъединенияИзделий()
	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	КомплектацияТоваров.Комплект КАК Номенклатура,
	                       |	КомплектацияТоваров.Комплект.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	КомплектацияТоваров.Комплект.Камень КАК Камень,
	                       |	КомплектацияТоваров.Комплект.Наименование КАК Наименование,
	                       |	КомплектацияТоваров.Комплект.НаименованиеПолное КАК НаименованиеПолное,
	                       |	КомплектацияТоваров.Комплект.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.Наименование КАК НаименованиеСерии,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.НомерПаспорта КАК НомерПаспорта,
	                       |	КомплектацияТоваров.Номер КАК Номер,
	                       |	""COMPLETE_SET"" КАК ТипПартии,
	                       |	""COMPLETE_SET"" КАК ВидПартии,
	                       |	""DOMESTIC_TURNOVER"" КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	КомплектацияТоваров.Комплект.ОКПД2.Код КАК ОКПД2,
	                       |	КомплектацияТоваров.КоличествоКомплекта КАК Количество,
	                       |	КомплектацияТоваров.ВесКомплекта КАК Вес,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ЛОЖЬ КАК ЭтоКамни,
	                       |	КомплектацияТоваров.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваров.Комплект.Проба.Металл КАК Металл,
	                       |	КомплектацияТоваров.Комплект.Проба.Проба КАК Проба,
	                       |	КомплектацияТоваров.Дата КАК Дата,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	КомплектацияТоваров.ВидОперации КАК ВидОперации,
	                       |	КомплектацияТоваров.ИНПЗарезирвированное КАК УИН,
	                       |	КомплектацияТоваров.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваров.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК > 0
	                       |			ТОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК
	                       |		ИНАЧЕ КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	КомплектацияТоваров.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	КомплектацияТоваров.Организация.ИНН КАК ОрганизацияИНН,
	                       |	КомплектацияТоваров.Организация.КПП КАК ОрганизацияКПП,
	                       |	КомплектацияТоваров.Организация.ОГРН КАК ОрганизацияОГРН,
	                       |	КомплектацияТоваров.ИмяМетода КАК ИмяМетода
	                       |ПОМЕСТИТЬ ШапкаДокумента
	                       |ИЗ
	                       |	Документ.КомплектацияТоваров КАК КомплектацияТоваров
	                       |ГДЕ
	                       |	КомплектацияТоваров.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                       |	ВЫРАЗИТЬ(Товары.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	ВЫРАЗИТЬ(&Ссылка КАК Документ.КомплектацияТоваров) КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесВХимЧистоте,
	                       |	Товары.ИНП КАК ИНП,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	ВЫРАЗИТЬ(Товары.ХарактеристикаНоменклатуры КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
	                       |	Товары.ВесВХимЧистотеГИИСДМДК КАК ВесВХимЧистотеГИИСДМДК
	                       |ПОМЕСТИТЬ Товары
	                       |ИЗ
	                       |	&Товары КАК Товары
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	Товары.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	Товары.СерияНоменклатуры.УИН КАК УИН,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ Товары.Номенклатура.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	Товары.Номенклатура.Проба.Проба КАК Проба,
	                       |	Товары.Номенклатура.Проба.Металл КАК Металл,
	                       |	Товары.Номенклатура КАК Номенклатура,
	                       |	Товары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	Товары.Номенклатура.Камень КАК Камень,
	                       |	Товары.Номенклатура.Наименование КАК Наименование,
	                       |	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	                       |	Товары.Номенклатура.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	Товары.СерияНоменклатуры.Наименование КАК НаименованиеСерии,
	                       |	Товары.СерияНоменклатуры.НомерПаспорта КАК НомерПаспорта,
	                       |	Товары.СсылкаНаДокумент.Номер КАК Номер,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ИНП = """"
	                       |			ТОГДА Товары.СерияНоменклатуры.УИН
	                       |		ИНАЧЕ Товары.ИНП
	                       |	КОНЕЦ КАК ИНП,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	Товары.СерияНоменклатуры КАК СерияНоменклатуры
	                       |ПОМЕСТИТЬ СтрокиДокумента
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ШапкаДокумента.Номенклатура КАК Номенклатура,
	                       |	ШапкаДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	ШапкаДокумента.Камень КАК Камень,
	                       |	ШапкаДокумента.Наименование КАК Наименование,
	                       |	ШапкаДокумента.НаименованиеПолное КАК НаименованиеПолное,
	                       |	ШапкаДокумента.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	ШапкаДокумента.НаименованиеСерии КАК НаименованиеСерии,
	                       |	ШапкаДокумента.НомерПаспорта КАК НомерПаспорта,
	                       |	ШапкаДокумента.Номер КАК Номер,
	                       |	ШапкаДокумента.ТипПартии КАК ТипПартии,
	                       |	ШапкаДокумента.ВидПартии КАК ВидПартии,
	                       |	ШапкаДокумента.ЭтапОбработки КАК ЭтапОбработки,
	                       |	ШапкаДокумента.СтадияОбработки КАК СтадияОбработки,
	                       |	ШапкаДокумента.ОКПД2 КАК ОКПД2,
	                       |	ШапкаДокумента.Количество КАК Количество,
	                       |	ШапкаДокумента.Вес КАК Вес,
	                       |	ШапкаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ШапкаДокумента.ЭтоКамни КАК ЭтоКамни,
	                       |	ШапкаДокумента.Ссылка КАК Ссылка,
	                       |	ШапкаДокумента.Металл КАК Металл,
	                       |	ШапкаДокумента.Проба КАК Проба,
	                       |	ШапкаДокумента.Дата КАК Дата,
	                       |	ШапкаДокумента.УчетВКаратах КАК УчетВКаратах,
	                       |	ШапкаДокумента.ВидОперации КАК ВидОперации,
	                       |	ШапкаДокумента.УИН КАК УИН,
	                       |	ШапкаДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	ШапкаДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ШапкаДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	ШапкаДокумента.ОрганизацияЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	ШапкаДокумента.ОрганизацияИНН КАК ОрганизацияИНН,
	                       |	ШапкаДокумента.ОрганизацияКПП КАК ОрганизацияКПП,
	                       |	ШапкаДокумента.ОрганизацияОГРН КАК ОрганизацияОГРН,
	                       |	ШапкаДокумента.ИмяМетода КАК ИмяМетода,
	                       |	ШапкаДокумента.Номенклатура.ТипИзделия.НаименованиеГИИСДМДК КАК ТипИзделияНаименованиеГИИСДМДК,
	                       |	ШапкаДокумента.Номенклатура.ТипИзделия.Наименование КАК ТипИзделияНаименование,
	                       |	ШапкаДокумента.Номенклатура.ТипИзделия.НаименованиеГИИСДМДКВоМножественномЧисле КАК ТипИзделияВоМножественномЧисле,
	                       |	ШапкаДокумента.Номенклатура.ТипИзделия.РодНаименованияГИИСДМДК КАК ТипИзделияРодНаименования
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНП КАК ИНП,
	                       |	СтрокиДокумента.Количество КАК Количество,
	                       |	СтрокиДокумента.Вес КАК Вес,
	                       |	СтрокиДокумента.Металл КАК Металл,
	                       |	СтрокиДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	СтрокиДокумента.СсылкаНаДокумент КАК СсылкаНаДокумент
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	СтрокиДокумента.ИНП <> """"");
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеКомплектацииДляОбъединенияПартийИзделий()
	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	КомплектацияТоваров.Комплект КАК Номенклатура,
	                       |	КомплектацияТоваров.Комплект.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	КомплектацияТоваров.Комплект.Камень КАК Камень,
	                       |	КомплектацияТоваров.Комплект.Наименование КАК Наименование,
	                       |	КомплектацияТоваров.Комплект.НаименованиеПолное КАК НаименованиеПолное,
	                       |	КомплектацияТоваров.Комплект.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.Наименование КАК НаименованиеСерии,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.НомерПаспорта КАК НомерПаспорта,
	                       |	КомплектацияТоваров.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	КомплектацияТоваров.Комплект.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.Количество
	                       |		ИНАЧЕ КомплектацияТоваров.КоличествоКомплекта
	                       |	КОНЕЦ КАК Количество,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.Вес
	                       |		ИНАЧЕ КомплектацияТоваров.ВесКомплекта
	                       |	КОНЕЦ КАК Вес,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	КомплектацияТоваров.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваров.Комплект.Проба.Металл КАК Металл,
	                       |	КомплектацияТоваров.Комплект.Проба.Проба КАК Проба,
	                       |	КомплектацияТоваров.Дата КАК Дата,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	КомплектацияТоваров.ВидОперации КАК ВидОперации,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.УИН КАК УИН,
	                       |	КомплектацияТоваров.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваров.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		КОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК > 0
	                       |			ТОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК
	                       |		ИНАЧЕ КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	КомплектацияТоваров.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	КомплектацияТоваров.Организация.ИНН КАК ОрганизацияИНН,
	                       |	КомплектацияТоваров.Организация.КПП КАК ОрганизацияКПП,
	                       |	КомплектацияТоваров.Организация.ОГРН КАК ОрганизацияОГРН,
	                       |	КомплектацияТоваров.ИмяМетода КАК ИмяМетода
	                       |ПОМЕСТИТЬ ШапкаДокумента
	                       |ИЗ
	                       |	Документ.КомплектацияТоваров КАК КомплектацияТоваров
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО КомплектацияТоваров.Ссылка = ПартииТоваровНаСкладах.Регистратор
	                       |			И КомплектацияТоваров.СерияНоменклатурыКомплекта = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И (КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом))
	                       |ГДЕ
	                       |	КомплектацияТоваров.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                       |	ВЫРАЗИТЬ(Товары.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	ВЫРАЗИТЬ(&Ссылка КАК Документ.КомплектацияТоваров) КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесВХимЧистоте,
	                       |	Товары.ИНП КАК ИНП,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	ВЫРАЗИТЬ(Товары.ХарактеристикаНоменклатуры КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
	                       |	Товары.ВесВХимЧистотеГИИСДМДК КАК ВесВХимЧистотеГИИСДМДК
	                       |ПОМЕСТИТЬ Товары
	                       |ИЗ
	                       |	&Товары КАК Товары
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	Товары.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |			ТОГДА Товары.ИНППреобразованияВЛом
	                       |		ИНАЧЕ Товары.СерияНоменклатуры.УИН
	                       |	КОНЕЦ КАК УИН,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ Товары.Номенклатура.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	Товары.Номенклатура.Проба.Проба КАК Проба,
	                       |	Товары.Номенклатура.Проба.Металл КАК Металл,
	                       |	Товары.Номенклатура КАК Номенклатура,
	                       |	Товары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	Товары.Номенклатура.Камень КАК Камень,
	                       |	Товары.Номенклатура.Наименование КАК Наименование,
	                       |	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	                       |	Товары.Номенклатура.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	Товары.СерияНоменклатуры.Наименование КАК НаименованиеСерии,
	                       |	Товары.СерияНоменклатуры.НомерПаспорта КАК НомерПаспорта,
	                       |	Товары.СсылкаНаДокумент.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""PRODUCT""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""JEWERLY""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""BUYING_UP""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	Товары.Номенклатура.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	Товары.СсылкаНаДокумент.Дата КАК Дата,
	                       |	Товары.СсылкаНаДокумент.ВидОперации КАК ВидОперации,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		КОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте > 0
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ИНП = """"
	                       |			ТОГДА Товары.СерияНоменклатуры.УИН
	                       |		ИНАЧЕ Товары.ИНП
	                       |	КОНЕЦ КАК ИНП,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	Товары.СсылкаНаДокумент.Организация.ЮрФизЛицо КАК СсылкаНаДокументОрганизацияЮрФизЛицо,
	                       |	Товары.СсылкаНаДокумент.Организация.ИНН КАК СсылкаНаДокументОрганизацияИНН,
	                       |	Товары.СсылкаНаДокумент.Организация.КПП КАК СсылкаНаДокументОрганизацияКПП,
	                       |	Товары.СсылкаНаДокумент.Организация.ОГРН КАК СсылкаНаДокументОрганизацияОГРН,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ИНП = """"
	                       |			ТОГДА Товары.СерияНоменклатуры.УИН
	                       |		ИНАЧЕ Товары.ИНП
	                       |	КОНЕЦ КАК ИНППреобразованияВЛом,
	                       |	Товары.СерияНоменклатуры КАК СерияНоменклатуры
	                       |ПОМЕСТИТЬ СтрокиДокумента
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО Товары.СсылкаНаДокумент = ПартииТоваровНаСкладах.Регистратор
	                       |			И Товары.Номенклатура = ПартииТоваровНаСкладах.Номенклатура
	                       |			И Товары.СерияНоменклатуры = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И Товары.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ШапкаДокумента.Номенклатура КАК Номенклатура,
	                       |	ШапкаДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	ШапкаДокумента.Камень КАК Камень,
	                       |	ШапкаДокумента.Наименование КАК Наименование,
	                       |	ШапкаДокумента.НаименованиеПолное КАК НаименованиеПолное,
	                       |	ШапкаДокумента.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	ШапкаДокумента.НаименованиеСерии КАК НаименованиеСерии,
	                       |	ШапкаДокумента.НомерПаспорта КАК НомерПаспорта,
	                       |	ШапкаДокумента.Номер КАК Номер,
	                       |	ШапкаДокумента.ТипПартии КАК ТипПартии,
	                       |	ШапкаДокумента.ВидПартии КАК ВидПартии,
	                       |	ШапкаДокумента.ЭтапОбработки КАК ЭтапОбработки,
	                       |	ШапкаДокумента.СтадияОбработки КАК СтадияОбработки,
	                       |	ШапкаДокумента.ОКПД2 КАК ОКПД2,
	                       |	ШапкаДокумента.Количество КАК Количество,
	                       |	ШапкаДокумента.Вес КАК Вес,
	                       |	ШапкаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ШапкаДокумента.ЭтоКамни КАК ЭтоКамни,
	                       |	ШапкаДокумента.Ссылка КАК Ссылка,
	                       |	ШапкаДокумента.Металл КАК Металл,
	                       |	ШапкаДокумента.Проба КАК Проба,
	                       |	ШапкаДокумента.Дата КАК Дата,
	                       |	ШапкаДокумента.УчетВКаратах КАК УчетВКаратах,
	                       |	ШапкаДокумента.ВидОперации КАК ВидОперации,
	                       |	ШапкаДокумента.УИН КАК УИН,
	                       |	ШапкаДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	ШапкаДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ШапкаДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	ШапкаДокумента.ОрганизацияЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	ШапкаДокумента.ОрганизацияИНН КАК ОрганизацияИНН,
	                       |	ШапкаДокумента.ОрганизацияКПП КАК ОрганизацияКПП,
	                       |	ШапкаДокумента.ОрганизацияОГРН КАК ОрганизацияОГРН,
	                       |	ШапкаДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	СтрокиДокумента.Количество КАК Количество,
	                       |	СтрокиДокумента.Вес КАК Вес,
	                       |	СтрокиДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	СтрокиДокумента.Металл КАК Металл,
	                       |	СтрокиДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	СтрокиДокумента.СсылкаНаДокумент КАК СсылкаНаДокумент
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал КАК Материал,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Вес КАК Вес,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл КАК МатериалМеталл,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба КАК МатериалПроба
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеМатериалы КАК ХарактеристикиНоменклатурыДополнительныеМатериалы
	                       |		ПО Товары.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатурыДополнительныеМатериалы.Ссылка");
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса;
КонецФункции

&НаСервере
Функция ПолучитьДанныеКомплектацииДляОбъединенияПартий(ПараллельнаяОтправкаДанных = Ложь)
	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	КомплектацияТоваров.Комплект КАК Номенклатура,
	                       |	КомплектацияТоваров.Комплект.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	КомплектацияТоваров.Комплект.Камень КАК Камень,
	                       |	КомплектацияТоваров.Комплект.Наименование КАК Наименование,
	                       |	КомплектацияТоваров.Комплект.НаименованиеПолное КАК НаименованиеПолное,
	                       |	КомплектацияТоваров.Комплект.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.Наименование КАК НаименованиеСерии,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.НомерПаспорта КАК НомерПаспорта,
	                       |	КомплектацияТоваров.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	КомплектацияТоваров.Комплект.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.Количество
	                       |		ИНАЧЕ КомплектацияТоваров.КоличествоКомплекта
	                       |	КОНЕЦ КАК Количество,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.Вес
	                       |		ИНАЧЕ КомплектацияТоваров.ВесКомплекта
	                       |	КОНЕЦ КАК Вес,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	КомплектацияТоваров.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваров.Комплект.Проба.Металл КАК Металл,
	                       |	КомплектацияТоваров.Комплект.Проба.Проба КАК Проба,
	                       |	КомплектацияТоваров.Дата КАК Дата,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	КомплектацияТоваров.ВидОперации КАК ВидОперации,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.УИН КАК УИН,
	                       |	КомплектацияТоваров.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваров.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		КОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК > 0
	                       |			ТОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК
	                       |		ИНАЧЕ КомплектацияТоваров.ВесКомплектаВХимЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	КомплектацияТоваров.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	КомплектацияТоваров.Организация.ИНН КАК ОрганизацияИНН,
	                       |	КомплектацияТоваров.Организация.КПП КАК ОрганизацияКПП,
	                       |	КомплектацияТоваров.Организация.ОГРН КАК ОрганизацияОГРН,
	                       |	КомплектацияТоваров.ИмяМетода КАК ИмяМетода
	                       |ПОМЕСТИТЬ ШапкаДокумента
	                       |ИЗ
	                       |	Документ.ПреобразованиеВЛом КАК КомплектацияТоваров
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО КомплектацияТоваров.Ссылка = ПартииТоваровНаСкладах.Регистратор
	                       |			И КомплектацияТоваров.СерияНоменклатурыКомплекта = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И (КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом))
	                       |ГДЕ
	                       |	КомплектацияТоваров.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                       |	ВЫРАЗИТЬ(Товары.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	ВЫРАЗИТЬ(&Ссылка КАК Документ.ПреобразованиеВЛом) КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесВХимЧистоте,
	                       |	Товары.ИНП КАК ИНП,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	ВЫРАЗИТЬ(Товары.ХарактеристикаНоменклатуры КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
	                       |	Товары.ВесВХимЧистотеГИИСДМДК КАК ВесВХимЧистотеГИИСДМДК
	                       |ПОМЕСТИТЬ Товары
	                       |ИЗ
	                       |	&Товары КАК Товары
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	КомплектацияТоваровМеталл.ИНП КАК ИНП,
	                       |	КомплектацияТоваровМеталл.ТипМеталла КАК ТипМеталла,
	                       |	КомплектацияТоваровМеталл.Вес КАК Вес,
	                       |	КомплектацияТоваровМеталл.ВесВЧистоте КАК ВесВЧистоте,
	                       |	КомплектацияТоваровМеталл.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваровМеталл.НомерСтроки КАК НомерСтроки,
	                       |	КомплектацияТоваровМеталл.Проба КАК Проба,
	                       |	КомплектацияТоваровМеталл.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	КомплектацияТоваровМеталл.ОписаниеОшибки КАК ОписаниеОшибки,
	                       |	КомплектацияТоваровМеталл.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваровМеталл.ИНПИзделия КАК ИНПИзделия
	                       |ПОМЕСТИТЬ Металлы
	                       |ИЗ
	                       |	Документ.ПреобразованиеВЛом.Металл КАК КомплектацияТоваровМеталл
	                       |ГДЕ
	                       |	КомплектацияТоваровМеталл.Ссылка = &Ссылка
	                       |	И КомплектацияТоваровМеталл.ИНПИзделия <> """"
	                       |	И КомплектацияТоваровМеталл.ИНП <> """"
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	Товары.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |			ТОГДА Товары.ИНППреобразованияВЛом
	                       |		ИНАЧЕ Товары.СерияНоменклатуры.УИН
	                       |	КОНЕЦ КАК УИН,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ Товары.Номенклатура.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	Товары.Номенклатура.Проба.Проба КАК Проба,
	                       |	Товары.Номенклатура.Проба.Металл КАК Металл,
	                       |	Товары.Номенклатура КАК Номенклатура,
	                       |	Товары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	Товары.Номенклатура.Камень КАК Камень,
	                       |	Товары.Номенклатура.Наименование КАК Наименование,
	                       |	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	                       |	Товары.Номенклатура.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	Товары.СерияНоменклатуры.Наименование КАК НаименованиеСерии,
	                       |	Товары.СерияНоменклатуры.НомерПаспорта КАК НомерПаспорта,
	                       |	Товары.СсылкаНаДокумент.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""PRODUCT""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""JEWERLY""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""BUYING_UP""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	Товары.Номенклатура.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	Товары.СсылкаНаДокумент.Дата КАК Дата,
	                       |	Товары.СсылкаНаДокумент.ВидОперации КАК ВидОперации,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		КОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте > 0
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ИНП = """"
	                       |			ТОГДА Товары.СерияНоменклатуры.УИН
	                       |		ИНАЧЕ Товары.ИНП
	                       |	КОНЕЦ КАК ИНП,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	Товары.СсылкаНаДокумент.Организация.ЮрФизЛицо КАК СсылкаНаДокументОрганизацияЮрФизЛицо,
	                       |	Товары.СсылкаНаДокумент.Организация.ИНН КАК СсылкаНаДокументОрганизацияИНН,
	                       |	Товары.СсылкаНаДокумент.Организация.КПП КАК СсылкаНаДокументОрганизацияКПП,
	                       |	Товары.СсылкаНаДокумент.Организация.ОГРН КАК СсылкаНаДокументОрганизацияОГРН,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.СерияНоменклатуры КАК СерияНоменклатуры
	                       |ПОМЕСТИТЬ СтрокиДокумента
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО Товары.СсылкаНаДокумент = ПартииТоваровНаСкладах.Регистратор
	                       |			И Товары.Номенклатура = ПартииТоваровНаСкладах.Номенклатура
	                       |			И Товары.СерияНоменклатуры = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И Товары.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ШапкаДокумента.Номенклатура КАК Номенклатура,
	                       |	ШапкаДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	ШапкаДокумента.Камень КАК Камень,
	                       |	ШапкаДокумента.Наименование КАК Наименование,
	                       |	ШапкаДокумента.НаименованиеПолное КАК НаименованиеПолное,
	                       |	ШапкаДокумента.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	ШапкаДокумента.НаименованиеСерии КАК НаименованиеСерии,
	                       |	ШапкаДокумента.НомерПаспорта КАК НомерПаспорта,
	                       |	ШапкаДокумента.Номер КАК Номер,
	                       |	ШапкаДокумента.ТипПартии КАК ТипПартии,
	                       |	ШапкаДокумента.ВидПартии КАК ВидПартии,
	                       |	ШапкаДокумента.ЭтапОбработки КАК ЭтапОбработки,
	                       |	ШапкаДокумента.СтадияОбработки КАК СтадияОбработки,
	                       |	ШапкаДокумента.ОКПД2 КАК ОКПД2,
	                       |	ШапкаДокумента.Количество КАК Количество,
	                       |	ШапкаДокумента.Вес КАК Вес,
	                       |	ШапкаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ШапкаДокумента.ЭтоКамни КАК ЭтоКамни,
	                       |	ШапкаДокумента.Ссылка КАК Ссылка,
	                       |	ШапкаДокумента.Металл КАК Металл,
	                       |	ШапкаДокумента.Проба КАК Проба,
	                       |	ШапкаДокумента.Дата КАК Дата,
	                       |	ШапкаДокумента.УчетВКаратах КАК УчетВКаратах,
	                       |	ШапкаДокумента.ВидОперации КАК ВидОперации,
	                       |	ШапкаДокумента.УИН КАК УИН,
	                       |	ШапкаДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	ШапкаДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ШапкаДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	ШапкаДокумента.ОрганизацияЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	ШапкаДокумента.ОрганизацияИНН КАК ОрганизацияИНН,
	                       |	ШапкаДокумента.ОрганизацияКПП КАК ОрганизацияКПП,
	                       |	ШапкаДокумента.ОрганизацияОГРН КАК ОрганизацияОГРН,
	                       |	ШапкаДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	СтрокиДокумента.Количество КАК Количество,
	                       |	СтрокиДокумента.Вес КАК Вес,
	                       |	СтрокиДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	СтрокиДокумента.Металл КАК Металл,
	                       |	СтрокиДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	СтрокиДокумента.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	СтрокиДокумента.Проба КАК Проба
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	СтрокиДокумента.ИНППреобразованияВЛом <> """"
	                       |	И &ПараллельнаяОтправкаДанных = ЛОЖЬ
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	КомплектацияТоваровПромежуточныеКомплекты.НомерСтроки,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ИНП,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.Количество,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.Вес,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ВесВХимЧистоте,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ТипМеталла,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.СтатусЗапроса,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ИдентификаторЗапроса,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.Ссылка,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.Проба
	                       |ИЗ
	                       |	Документ.ПреобразованиеВЛом.ПромежуточныеКомплекты КАК КомплектацияТоваровПромежуточныеКомплекты
	                       |ГДЕ
	                       |	КомплектацияТоваровПромежуточныеКомплекты.Ссылка = &Ссылка
	                       |	И &ПараллельнаяОтправкаДанных = ИСТИНА
	                       |	И КомплектацияТоваровПромежуточныеКомплекты.ИНП <> """"
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	Металлы.НомерСтроки,
	                       |	Металлы.ИНП,
	                       |	0,
	                       |	Металлы.Вес,
	                       |	Металлы.ВесВЧистоте,
	                       |	Металлы.ТипМеталла,
	                       |	Металлы.СтатусЗапроса,
	                       |	Металлы.ИдентификаторЗапроса,
	                       |	Металлы.Ссылка,
	                       |	Металлы.Проба
	                       |ИЗ
	                       |	Металлы КАК Металлы
	                       |ГДЕ
	                       |	&ПараллельнаяОтправкаДанных = ЛОЖЬ
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал КАК Материал,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Вес КАК Вес,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл КАК МатериалМеталл,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба КАК МатериалПроба
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеМатериалы КАК ХарактеристикиНоменклатурыДополнительныеМатериалы
	                       |		ПО Товары.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатурыДополнительныеМатериалы.Ссылка");
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПараллельнаяОтправкаДанных", ПараллельнаяОтправкаДанных);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеКомплектацииДляОбъединенияПартийПараллельно(НомерСтрокиТаблЧасти)
	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	КомплектацияТоваров.Комплект КАК Номенклатура,
	                       |	КомплектацияТоваров.Комплект.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	КомплектацияТоваров.Комплект.Камень КАК Камень,
	                       |	КомплектацияТоваров.Комплект.Наименование КАК Наименование,
	                       |	КомплектацияТоваров.Комплект.НаименованиеПолное КАК НаименованиеПолное,
	                       |	КомплектацияТоваров.Комплект.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.Наименование КАК НаименованиеСерии,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.НомерПаспорта КАК НомерПаспорта,
	                       |	КомплектацияТоваров.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	КомплектацияТоваров.Комплект.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.Количество
	                       |		ИНАЧЕ КомплектацияТоваров.КоличествоКомплекта
	                       |	КОНЕЦ КАК Количество,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.Вес
	                       |		ИНАЧЕ КомплектацияТоваров.ВесКомплекта
	                       |	КОНЕЦ КАК Вес,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	КомплектацияТоваров.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваров.Комплект.Проба.Металл КАК Металл,
	                       |	КомплектацияТоваров.Комплект.Проба.Проба КАК Проба,
	                       |	КомплектацияТоваров.Дата КАК Дата,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	КомплектацияТоваров.ВидОперации КАК ВидОперации,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.УИН КАК УИН,
	                       |	КомплектацияТоваров.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваров.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		КОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК > 0
	                       |			ТОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК
	                       |		ИНАЧЕ КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	КомплектацияТоваров.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	КомплектацияТоваров.Организация.ИНН КАК ОрганизацияИНН,
	                       |	КомплектацияТоваров.Организация.КПП КАК ОрганизацияКПП,
	                       |	КомплектацияТоваров.Организация.ОГРН КАК ОрганизацияОГРН,
	                       |	КомплектацияТоваров.ИмяМетода КАК ИмяМетода
	                       |ПОМЕСТИТЬ ШапкаДокумента
	                       |ИЗ
	                       |	Документ.КомплектацияТоваров КАК КомплектацияТоваров
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО КомплектацияТоваров.Ссылка = ПартииТоваровНаСкладах.Регистратор
	                       |			И КомплектацияТоваров.СерияНоменклатурыКомплекта = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И (КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом))
	                       |ГДЕ
	                       |	КомплектацияТоваров.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                       |	ВЫРАЗИТЬ(Товары.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	ВЫРАЗИТЬ(&Ссылка КАК Документ.КомплектацияТоваров) КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесВХимЧистоте,
	                       |	Товары.ИНП КАК ИНП,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	ВЫРАЗИТЬ(Товары.ХарактеристикаНоменклатуры КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
	                       |	Товары.ВесВХимЧистотеГИИСДМДК КАК ВесВХимЧистотеГИИСДМДК,
	                       |	Товары.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти
	                       |ПОМЕСТИТЬ Товары
	                       |ИЗ
	                       |	&Товары КАК Товары
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	КомплектацияТоваровМеталл.НомерСтроки КАК НомерСтроки,
	                       |	КомплектацияТоваровМеталл.ИНП КАК ИНП,
	                       |	0 КАК Количество,
	                       |	КомплектацияТоваровМеталл.Вес КАК Вес,
	                       |	КомплектацияТоваровМеталл.ВесВЧистоте КАК ВесВЧистоте,
	                       |	КомплектацияТоваровМеталл.ТипМеталла КАК ТипМеталла,
	                       |	КомплектацияТоваровМеталл.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваровМеталл.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	КомплектацияТоваровМеталл.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваровМеталл.Проба КАК Проба,
	                       |	КомплектацияТоваровМеталл.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти
	                       |ПОМЕСТИТЬ Металлы
	                       |ИЗ
	                       |	Документ.КомплектацияТоваров.Металл КАК КомплектацияТоваровМеталл
	                       |ГДЕ
	                       |	КомплектацияТоваровМеталл.Ссылка = &Ссылка
	                       |	И КомплектацияТоваровМеталл.ИНПИзделия <> """"
	                       |	И КомплектацияТоваровМеталл.ИНП <> """"
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	Товары.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |			ТОГДА Товары.ИНППреобразованияВЛом
	                       |		ИНАЧЕ Товары.СерияНоменклатуры.УИН
	                       |	КОНЕЦ КАК УИН,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ Товары.Номенклатура.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	Товары.Номенклатура.Проба.Проба КАК Проба,
	                       |	Товары.Номенклатура.Проба.Металл КАК Металл,
	                       |	Товары.Номенклатура КАК Номенклатура,
	                       |	Товары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	Товары.Номенклатура.Камень КАК Камень,
	                       |	Товары.Номенклатура.Наименование КАК Наименование,
	                       |	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	                       |	Товары.Номенклатура.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	Товары.СерияНоменклатуры.Наименование КАК НаименованиеСерии,
	                       |	Товары.СерияНоменклатуры.НомерПаспорта КАК НомерПаспорта,
	                       |	Товары.СсылкаНаДокумент.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""PRODUCT""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""JEWERLY""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""BUYING_UP""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	Товары.Номенклатура.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	Товары.СсылкаНаДокумент.Дата КАК Дата,
	                       |	Товары.СсылкаНаДокумент.ВидОперации КАК ВидОперации,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		КОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте > 0
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ИНП = """"
	                       |			ТОГДА Товары.СерияНоменклатуры.УИН
	                       |		ИНАЧЕ Товары.ИНП
	                       |	КОНЕЦ КАК ИНП,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	Товары.СсылкаНаДокумент.Организация.ЮрФизЛицо КАК СсылкаНаДокументОрганизацияЮрФизЛицо,
	                       |	Товары.СсылкаНаДокумент.Организация.ИНН КАК СсылкаНаДокументОрганизацияИНН,
	                       |	Товары.СсылкаНаДокумент.Организация.КПП КАК СсылкаНаДокументОрганизацияКПП,
	                       |	Товары.СсылкаНаДокумент.Организация.ОГРН КАК СсылкаНаДокументОрганизацияОГРН,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	                       |	Товары.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти
	                       |ПОМЕСТИТЬ СтрокиДокумента
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО Товары.СсылкаНаДокумент = ПартииТоваровНаСкладах.Регистратор
	                       |			И Товары.Номенклатура = ПартииТоваровНаСкладах.Номенклатура
	                       |			И Товары.СерияНоменклатуры = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И Товары.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	КомплектацияТоваровПромежуточныеКомплекты.НомерСтроки КАК НомерСтроки,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ОписаниеОшибки КАК ОписаниеОшибки,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ИНП КАК ИНП,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.Количество КАК Количество,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.Вес КАК Вес,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ВесВХимЧистоте КАК ВесВХимЧистоте,
	                       |	КомплектацияТоваровПромежуточныеКомплекты.ТипМеталла КАК ТипМеталла
	                       |ПОМЕСТИТЬ ПромежуточныеКомплекты
	                       |ИЗ
	                       |	Документ.КомплектацияТоваров.ПромежуточныеКомплекты КАК КомплектацияТоваровПромежуточныеКомплекты
	                       |ГДЕ
	                       |	КомплектацияТоваровПромежуточныеКомплекты.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ШапкаДокумента.Номенклатура КАК Номенклатура,
	                       |	ШапкаДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	ШапкаДокумента.Камень КАК Камень,
	                       |	ШапкаДокумента.Наименование КАК Наименование,
	                       |	ШапкаДокумента.НаименованиеПолное КАК НаименованиеПолное,
	                       |	ШапкаДокумента.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	ШапкаДокумента.НаименованиеСерии КАК НаименованиеСерии,
	                       |	ШапкаДокумента.НомерПаспорта КАК НомерПаспорта,
	                       |	ШапкаДокумента.Номер КАК Номер,
	                       |	ШапкаДокумента.ТипПартии КАК ТипПартии,
	                       |	ШапкаДокумента.ВидПартии КАК ВидПартии,
	                       |	ШапкаДокумента.ЭтапОбработки КАК ЭтапОбработки,
	                       |	ШапкаДокумента.СтадияОбработки КАК СтадияОбработки,
	                       |	ШапкаДокумента.ОКПД2 КАК ОКПД2,
	                       |	ШапкаДокумента.Количество КАК Количество,
	                       |	ШапкаДокумента.Вес КАК Вес,
	                       |	ШапкаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ШапкаДокумента.ЭтоКамни КАК ЭтоКамни,
	                       |	ШапкаДокумента.Ссылка КАК Ссылка,
	                       |	ШапкаДокумента.Металл КАК Металл,
	                       |	ШапкаДокумента.Проба КАК Проба,
	                       |	ШапкаДокумента.Дата КАК Дата,
	                       |	ШапкаДокумента.УчетВКаратах КАК УчетВКаратах,
	                       |	ШапкаДокумента.ВидОперации КАК ВидОперации,
	                       |	ШапкаДокумента.УИН КАК УИН,
	                       |	ШапкаДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	ШапкаДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ШапкаДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	ШапкаДокумента.ОрганизацияЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	ШапкаДокумента.ОрганизацияИНН КАК ОрганизацияИНН,
	                       |	ШапкаДокумента.ОрганизацияКПП КАК ОрганизацияКПП,
	                       |	ШапкаДокумента.ОрганизацияОГРН КАК ОрганизацияОГРН,
	                       |	ШапкаДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	СтрокиДокумента.Количество КАК Количество,
	                       |	СтрокиДокумента.Вес КАК Вес,
	                       |	СтрокиДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	СтрокиДокумента.Металл КАК Металл,
	                       |	СтрокиДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	СтрокиДокумента.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	СтрокиДокумента.НомерСтрокиТаблЧасти КАК НомерСтрокиТаблЧасти,
	                       |	СтрокиДокумента.Проба КАК Проба
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	СтрокиДокумента.ИНППреобразованияВЛом <> """"
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	Металлы.НомерСтроки,
	                       |	Металлы.ИНП,
	                       |	Металлы.Количество,
	                       |	Металлы.Вес,
	                       |	Металлы.ВесВЧистоте,
	                       |	Металлы.ТипМеталла,
	                       |	Металлы.СтатусЗапроса,
	                       |	Металлы.ИдентификаторЗапроса,
	                       |	Металлы.Ссылка,
	                       |	Металлы.НомерСтрокиТаблЧасти,
	                       |	Металлы.Проба
	                       |ИЗ
	                       |	Металлы КАК Металлы
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал КАК Материал,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Вес КАК Вес,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл КАК МатериалМеталл,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба КАК МатериалПроба
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеМатериалы КАК ХарактеристикиНоменклатурыДополнительныеМатериалы
	                       |		ПО Товары.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатурыДополнительныеМатериалы.Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ПромежуточныеКомплекты.НомерСтроки КАК НомерСтроки,
	                       |	ПромежуточныеКомплекты.СтатусЗапроса КАК СтатусЗапроса,
	                       |	ПромежуточныеКомплекты.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ПромежуточныеКомплекты.ОписаниеОшибки КАК ОписаниеОшибки,
	                       |	ПромежуточныеКомплекты.ИНП КАК ИНП,
	                       |	ПромежуточныеКомплекты.Количество КАК Количество,
	                       |	ПромежуточныеКомплекты.Вес КАК Вес,
	                       |	ПромежуточныеКомплекты.ВесВХимЧистоте КАК ВесВХимЧистоте,
	                       |	ПромежуточныеКомплекты.ТипМеталла КАК ТипМеталла
	                       |ИЗ
	                       |	ПромежуточныеКомплекты КАК ПромежуточныеКомплекты
	                       |ГДЕ
	                       |	ПромежуточныеКомплекты.ИНП = """"
	                       |	И ПромежуточныеКомплекты.НомерСтроки = &НомерСтрокиТаблЧасти");
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("НомерСтрокиТаблЧасти", НомерСтрокиТаблЧасти);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеПреобразованиеВЛомПараллельно(НомерОперации)
	 
	ПоискТоваровПоВнутреннемуШК = Константы.ПоискТоваровПоВнутреннемуШК.Получить();
	ПоискТоваровПоПаспорту = Константы.ПоискТоваровПоПаспорту.Получить();
	
	Пакеты = Новый Соответствие;
	ДанныеДляОтправки = Новый Структура;
	НомерПакета = 0;
	
	МассивТоваров = Новый Массив;
	
	КоличествоВЗапросе = 0;
	НомераСтрокНеОтправлено = Новый Массив;
	МассивТоваровДляОтправкиВПакете = Новый Массив;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Очередь", НомерОперации);
	ЗапросыДляОтправкиДанных = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
	//Объект.СписокЗапросов.Очистить();
	МассивЗапросов = Новый Массив;
	Для Каждого ЗапросДляОтправки Из ЗапросыДляОтправкиДанных Цикл
		Если ЗапросДляОтправки.Статус = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			Продолжить;
		ИначеЕсли ЗапросДляОтправки.Статус = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда
			Если МассивЗапросов.Найти(ЗапросДляОтправки.ИдентификаторЗапроса) = Неопределено Тогда
				НомерПакета = НомерПакета + 1;
				Результат = Новый Структура;
				Результат.Вставить("ИдентификаторЗапроса", ЗапросДляОтправки.ИдентификаторЗапроса);
				ТекущееИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияРезультата(ЗапросДляОтправки.ИмяМетода);
				Результат.Вставить("ИмяМетода", ?(ТекущееИмяМетода = "", ЗапросДляОтправки.ИмяМетода, ТекущееИмяМетода));
				Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета());
				Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
				Пакеты.Вставить(НомерПакета, Результат);
				
				МассивЗапросов.Добавить(ЗапросДляОтправки.ИдентификаторЗапроса);
			КонецЕсли;
		ИначеЕсли ЗапросДляОтправки.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
			НомераСтрокНеОтправлено = Новый Массив;
			НомераСтрокНеОтправлено.Добавить(ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Если ЗапросДляОтправки.ИНП = "" И ЗапросДляОтправки.ИмяТабличнойЧасти = "ПромежуточныеКомплекты" Тогда
				Результат.Вставить("УИН", Объект[ЗапросДляОтправки.ИмяТабличнойЧасти][ЗапросДляОтправки.НомерСтрокиТаблЧасти - 1].ИНП);
            Иначе
				Результат.Вставить("УИН", ЗапросДляОтправки.ИНП);
			КонецЕсли;
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
			Пакеты.Вставить(НомерПакета, Результат);
		ИначеЕсли ЗапросДляОтправки.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаПреобразованияВЛомНаРегистрацию() Тогда
			ТекущееИмяМетода = ЗапросДляОтправки.ИмяМетода;
			СтруктураСтроки = Новый Структура;	
			СтруктураСтроки.Вставить("НомерСтроки", ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			СтруктураСтроки.Вставить("УИН", ЗапросДляОтправки.ИНП);
			МассивТоваровДляОтправкиВПакете.Добавить(СтруктураСтроки);
			НомераСтрокНеОтправлено.Добавить(ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			КоличествоВЗапросе = КоличествоВЗапросе + 1;
			Если КоличествоВЗапросе = ДопустимоеКоличествоПартий Тогда
				НомерПакета = НомерПакета + 1;
				Результат = Новый Структура();
				Результат.Вставить("Спецификации", МассивТоваровДляОтправкиВПакете);
				Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
				Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаПреобразованияВЛомНаРегистрацию());
				Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
				Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
				Пакеты.Вставить(НомерПакета, Результат);
				КоличествоВЗапросе = 0;
				МассивТоваровДляОтправкиВПакете = Новый Массив;
				НомераСтрокНеОтправлено = Новый Массив;
			КонецЕсли;
		ИначеЕсли ЗапросДляОтправки.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектацийНаРегистрацию() 
			И ЗапросДляОтправки.ИмяТабличнойЧасти = "ПромежуточныеКомплекты" Тогда
			
			РезультатЗапроса = ПолучитьДанныеКомплектацииДляОбъединенияПартийПараллельно(ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			
			ДанныеДляПодготовки = Новый Структура;
			ДанныеДляПодготовки.Вставить("НомерПакета", НомерПакета);
			ДанныеДляПодготовки.Вставить("Пакеты", Пакеты);
			ДанныеДляПодготовки.Вставить("ПоискТоваровПоВнутреннемуШК", ПоискТоваровПоВнутреннемуШК);
			ДанныеДляПодготовки.Вставить("ПоискТоваровПоПаспорту", ПоискТоваровПоПаспорту);
			ДанныеДляПодготовки.Вставить("ДанныеШапкиДокументов", РезультатЗапроса[5].Выбрать());
			ДанныеДляПодготовки.Вставить("ДанныеПоТоварам", РезультатЗапроса[6].Выгрузить());
			ДанныеДляПодготовки.Вставить("ДанныеПоДопМатериалам", РезультатЗапроса[7].Выгрузить());
			ДанныеДляПодготовки.Вставить("ДанныеПоПромежуточнымКомплектам", РезультатЗапроса[8].Выгрузить());
			//НомерПакета = НомерПакета + 1;
			 
			Пакеты = ПодготовитьДанныеДокументаСОперациейКомплектацииПараллельно(ДанныеДляПодготовки);
			НомерПакета = НомерПакета + 1;
		ИначеЕсли ЗапросДляОтправки.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектацийНаРегистрацию() Тогда
			НомерПакета = НомерПакета + 1;
			Если Объект.ПараллельнаяОтправкаДанных Тогда
				РезультатЗапроса = ПолучитьДанныеКомплектацииДляОбъединенияПартий(Объект.ПромежуточныеКомплекты.Количество() > 0); 
				ДанныеШапкиДокументов = РезультатЗапроса[4].Выбрать();
				ДанныеПоТоварам = РезультатЗапроса[5].Выгрузить();
				ДанныеПоДопМатериалам = РезультатЗапроса[6].Выгрузить();
				Спецификация = ПодготовитьДанныеДокументаСОперациейКомплектации(ДанныеШапкиДокументов, ДанныеПоТоварам, ДанныеПоДопМатериалам,
					ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту);
			Иначе	
				РезультатЗапроса = ПолучитьДанныеКомплектацииДляОбъединенияПартий(); 
				ДанныеШапкиДокументов = РезультатЗапроса[4].Выбрать();
				ДанныеПоТоварам = РезультатЗапроса[5].Выгрузить();
				ДанныеПоДопМатериалам = РезультатЗапроса[6].Выгрузить();
				Спецификация = ПодготовитьДанныеДокументаСОперациейКомплектации(ДанныеШапкиДокументов, ДанныеПоТоварам, ДанныеПоДопМатериалам,
					ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту);
			КонецЕсли;	
			Результат = Новый Структура();
			Результат.Вставить("Спецификации", Спецификация);
			Результат.Вставить("НомераСтрокНеОтправлено", 0);
			МассивСтрок = Новый Массив;
			Для Каждого ТекСтр Из ДанныеПоТоварам Цикл
				МассивСтрок.Добавить(ТекСтр.НомерСтроки);
			КонецЦикла;	
			Результат.Вставить("НомераСтрокДляЗаполнения", МассивСтрок);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектацийНаРегистрацию());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоВЗапросе > 0 Тогда
		НомерПакета = НомерПакета + 1;
		Результат = Новый Структура();
		Результат.Вставить("Спецификации", МассивТоваровДляОтправкиВПакете);
		Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
		Результат.Вставить("ИмяМетода", ТекущееИмяМетода);
		Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
		Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
		Пакеты.Вставить(НомерПакета, Результат);
		КоличествоВЗапросе = 0;
		МассивТоваровДляОтправкиВПакете = Новый Массив;
		НомераСтрокНеОтправлено = Новый Массив;
	КонецЕсли;
	
	ДанныеДляОтправки.Вставить("Пакеты", Пакеты);
	
	Возврат ДанныеДляОтправки;
КонецФункции

&НаСервере
Функция ПодготовитьДанныеПреобразованиеВЛомПоследовательно(НомерОперации)
	ПоискТоваровПоВнутреннемуШК = Константы.ПоискТоваровПоВнутреннемуШК.Получить();
	ПоискТоваровПоПаспорту = Константы.ПоискТоваровПоПаспорту.Получить();

	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	КомплектацияТоваров.Комплект КАК Номенклатура,
	                       |	КомплектацияТоваров.Комплект.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	КомплектацияТоваров.Комплект.Камень КАК Камень,
	                       |	КомплектацияТоваров.Комплект.Наименование КАК Наименование,
	                       |	КомплектацияТоваров.Комплект.НаименованиеПолное КАК НаименованиеПолное,
	                       |	КомплектацияТоваров.Комплект.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.Наименование КАК НаименованиеСерии,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.НомерПаспорта КАК НомерПаспорта,
	                       |	КомплектацияТоваров.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	КомплектацияТоваров.Комплект.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.Количество
	                       |		ИНАЧЕ КомплектацияТоваров.КоличествоКомплекта
	                       |	КОНЕЦ КАК Количество,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.Вес
	                       |		ИНАЧЕ КомплектацияТоваров.ВесКомплекта
	                       |	КОНЕЦ КАК Вес,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	КомплектацияТоваров.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваров.Комплект.Проба.Металл КАК Металл,
	                       |	КомплектацияТоваров.Комплект.Проба.Проба КАК Проба,
	                       |	КомплектацияТоваров.Дата КАК Дата,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.Комплект.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ КомплектацияТоваров.Комплект.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	КомплектацияТоваров.ВидОперации КАК ВидОперации,
	                       |	КомплектацияТоваров.СерияНоменклатурыКомплекта.УИН КАК УИН,
	                       |	КомплектацияТоваров.СтатусЗапроса КАК СтатусЗапроса,
	                       |	КомплектацияТоваров.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом)
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		КОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК > 0
	                       |			ТОГДА КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистотеГИИСДМДК
	                       |		ИНАЧЕ КомплектацияТоваров.СерияНоменклатурыКомплекта.ВесМеталлаВЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	КомплектацияТоваров.Организация.ЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	КомплектацияТоваров.Организация.ИНН КАК ОрганизацияИНН,
	                       |	КомплектацияТоваров.Организация.КПП КАК ОрганизацияКПП,
	                       |	КомплектацияТоваров.Организация.ОГРН КАК ОрганизацияОГРН,
	                       |	КомплектацияТоваров.ИмяМетода КАК ИмяМетода
	                       |ПОМЕСТИТЬ ШапкаДокумента
	                       |ИЗ
	                       |	Документ.КомплектацияТоваров КАК КомплектацияТоваров
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО КомплектацияТоваров.Ссылка = ПартииТоваровНаСкладах.Регистратор
	                       |			И КомплектацияТоваров.СерияНоменклатурыКомплекта = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И (КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |				ИЛИ КомплектацияТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияЛом))
	                       |ГДЕ
	                       |	КомплектацияТоваров.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                       |	ВЫРАЗИТЬ(Товары.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	ВЫРАЗИТЬ(&Ссылка КАК Документ.КомплектацияТоваров) КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесВХимЧистоте,
	                       |	Товары.ИНП КАК ИНП,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	ВЫРАЗИТЬ(Товары.ХарактеристикаНоменклатуры КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
	                       |	Товары.ВесВХимЧистотеГИИСДМДК КАК ВесВХимЧистотеГИИСДМДК
	                       |ПОМЕСТИТЬ Товары
	                       |ИЗ
	                       |	&Товары КАК Товары
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	КомплектацияТоваровМеталл.ИНП КАК ИНП,
	                       |	КомплектацияТоваровМеталл.ТипМеталла КАК ТипМеталла,
	                       |	КомплектацияТоваровМеталл.Вес КАК Вес,
	                       |	КомплектацияТоваровМеталл.ВесВЧистоте КАК ВесВЧистоте,
	                       |	КомплектацияТоваровМеталл.Ссылка КАК Ссылка,
	                       |	КомплектацияТоваровМеталл.НомерСтроки КАК НомерСтроки,
	                       |	КомплектацияТоваровМеталл.Проба КАК Проба,
	                       |	КомплектацияТоваровМеталл.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	КомплектацияТоваровМеталл.ОписаниеОшибки КАК ОписаниеОшибки,
	                       |	КомплектацияТоваровМеталл.СтатусЗапроса КАК Статус,
	                       |	КомплектацияТоваровМеталл.ИНПИзделия КАК ИНПИзделия
	                       |ПОМЕСТИТЬ Металлы
	                       |ИЗ
	                       |	Документ.КомплектацияТоваров.Металл КАК КомплектацияТоваровМеталл
	                       |ГДЕ
	                       |	КомплектацияТоваровМеталл.Ссылка = &Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	Товары.Количество КАК Количество,
	                       |	Товары.Вес КАК Вес,
	                       |	Товары.СсылкаНаДокумент КАК СсылкаНаДокумент,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |			ТОГДА Товары.ИНППреобразованияВЛом
	                       |		ИНАЧЕ Товары.СерияНоменклатуры.УИН
	                       |	КОНЕЦ КАК УИН,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень = ЗНАЧЕНИЕ(Справочник.ДрагоценныеКамни.ПустаяСсылка)
	                       |			ТОГДА ЛОЖЬ
	                       |		ИНАЧЕ Товары.Номенклатура.Камень.УчетВКаратах
	                       |	КОНЕЦ КАК УчетВКаратах,
	                       |	Товары.Номенклатура.Проба.Проба КАК Проба,
	                       |	Товары.Номенклатура.Проба.Металл КАК Металл,
	                       |	Товары.Номенклатура КАК Номенклатура,
	                       |	Товары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	Товары.Номенклатура.Камень КАК Камень,
	                       |	Товары.Номенклатура.Наименование КАК Наименование,
	                       |	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	                       |	Товары.Номенклатура.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	Товары.СерияНоменклатуры.Наименование КАК НаименованиеСерии,
	                       |	Товары.СерияНоменклатуры.НомерПаспорта КАК НомерПаспорта,
	                       |	Товары.СсылкаНаДокумент.Номер КАК Номер,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""GEMSTONE""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""PRODUCT""
	                       |		ИНАЧЕ ""METAL""
	                       |	КОНЕЦ КАК ТипПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""TREATED_GEMSTONES""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""JEWERLY""
	                       |		ИНАЧЕ ""SCRAP_METAL""
	                       |	КОНЕЦ КАК ВидПартии,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ""SORTING_GEMS""
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |				И Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |			ТОГДА ""BUYING_UP""
	                       |		ИНАЧЕ ""DOMESTIC_TURNOVER""
	                       |	КОНЕЦ КАК ЭтапОбработки,
	                       |	""STORED"" КАК СтадияОбработки,
	                       |	Товары.Номенклатура.ОКПД2.Код КАК ОКПД2,
	                       |	ВЫБОР
	                       |		КОГДА Товары.Номенклатура.Камень.УчетВКаратах
	                       |			ТОГДА ""CTM""
	                       |		ИНАЧЕ ""GRM""
	                       |	КОНЕЦ КАК ЕдиницаИзмерения,
	                       |	ВЫБОР
	                       |		КОГДА Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.КомплектацияКамни)
	                       |				ИЛИ Товары.СсылкаНаДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.РазукомплектацияКамни)
	                       |			ТОГДА ИСТИНА
	                       |		ИНАЧЕ ЛОЖЬ
	                       |	КОНЕЦ КАК ЭтоКамни,
	                       |	Товары.СсылкаНаДокумент.Дата КАК Дата,
	                       |	Товары.СсылкаНаДокумент.ВидОперации КАК ВидОперации,
	                       |	Товары.СтатусЗапроса КАК СтатусЗапроса,
	                       |	Товары.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ВесВХимЧистотеГИИСДМДК > 0
	                       |			ТОГДА Товары.ВесВХимЧистотеГИИСДМДК
	                       |		КОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте > 0
	                       |			ТОГДА ПартииТоваровНаСкладах.ВесМеталлаВЧистоте
	                       |		ИНАЧЕ Товары.ВесВХимЧистоте
	                       |	КОНЕЦ КАК ВесМеталлаВЧистоте,
	                       |	ВЫБОР
	                       |		КОГДА Товары.ИНП = """"
	                       |			ТОГДА Товары.СерияНоменклатуры.УИН
	                       |		ИНАЧЕ Товары.ИНП
	                       |	КОНЕЦ КАК ИНП,
	                       |	Товары.ИмяМетода КАК ИмяМетода,
	                       |	Товары.СсылкаНаДокумент.Организация.ЮрФизЛицо КАК СсылкаНаДокументОрганизацияЮрФизЛицо,
	                       |	Товары.СсылкаНаДокумент.Организация.ИНН КАК СсылкаНаДокументОрганизацияИНН,
	                       |	Товары.СсылкаНаДокумент.Организация.КПП КАК СсылкаНаДокументОрганизацияКПП,
	                       |	Товары.СсылкаНаДокумент.Организация.ОГРН КАК СсылкаНаДокументОрганизацияОГРН,
	                       |	Товары.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	Товары.СерияНоменклатуры КАК СерияНоменклатуры
	                       |ПОМЕСТИТЬ СтрокиДокумента
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	                       |		ПО Товары.СсылкаНаДокумент = ПартииТоваровНаСкладах.Регистратор
	                       |			И Товары.Номенклатура = ПартииТоваровНаСкладах.Номенклатура
	                       |			И Товары.СерияНоменклатуры = ПартииТоваровНаСкладах.СерияНоменклатуры
	                       |			И Товары.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	""Товары"" КАК ИмяТабЧасти,
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНП КАК ИНП,
	                       |	ВЫБОР
	                       |		КОГДА СтрокиДокумента.ИмяМетода = ""SendGetBatch""
	                       |			ТОГДА СтрокиДокумента.СтатусЗапроса
	                       |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
	                       |	КОНЕЦ КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	СтрокиДокумента.ИНППреобразованияВЛом = """"
	                       |	И &НомерОперации = 1
	                       |	И СтрокиДокумента.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |	И (СтрокиДокумента.ИмяМетода = """"
	                       |			ИЛИ СтрокиДокумента.ИмяМетода = ""SendGetBatch""
	                       |			ИЛИ СтрокиДокумента.ИмяМетода = ""CheckGetBatch"")
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНП КАК УИН,
	                       |	СтрокиДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	СтрокиДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Металлы КАК Металлы
	                       |		ПО СтрокиДокумента.ИНП = Металлы.ИНПИзделия
	                       |ГДЕ
	                       |	СтрокиДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом)
	                       |	И СтрокиДокумента.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
	                       |	И СтрокиДокумента.СсылкаНаДокумент.СтатусЗапроса <> ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.Успех)
	                       |	И ВЫБОР
	                       |			КОГДА Металлы.ИНП ЕСТЬ NULL
	                       |				ТОГДА СтрокиДокумента.ИНППреобразованияВЛом = """"
	                       |			ИНАЧЕ ЛОЖЬ
	                       |		КОНЕЦ
	                       |	И &НомерОперации = 2
	                       |	И СтрокиДокумента.ИмяМетода <> ""SendGetBatch""
	                       |	И СтрокиДокумента.ИмяМетода <> ""CheckGetBatch""
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	НомерСтроки
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	""Товары"" КАК ИмяТабЧасти,
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНППреобразованияВЛом КАК ИНП,
	                       |	ВЫБОР
	                       |		КОГДА СтрокиДокумента.ИмяМетода = ""SendGetBatch""
	                       |			ТОГДА СтрокиДокумента.СтатусЗапроса
	                       |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусОтветаГИИСДМДК.ПустаяСсылка)
	                       |	КОНЕЦ КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	СтрокиДокумента.ИНППреобразованияВЛом <> """"
	                       |	И &НомерОперации = 3
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	""Металл"",
	                       |	Металлы.НомерСтроки,
	                       |	Металлы.ИНП,
	                       |	Металлы.Статус,
	                       |	Металлы.ИдентификаторЗапроса
	                       |ИЗ
	                       |	Металлы КАК Металлы
	                       |ГДЕ
	                       |	Металлы.ИНП <> """"
	                       |	И &НомерОперации = 3
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ШапкаДокумента.Номенклатура КАК Номенклатура,
	                       |	ШапкаДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
	                       |	ШапкаДокумента.Камень КАК Камень,
	                       |	ШапкаДокумента.Наименование КАК Наименование,
	                       |	ШапкаДокумента.НаименованиеПолное КАК НаименованиеПолное,
	                       |	ШапкаДокумента.НаименованиеГИИСДМДК КАК НаименованиеГИИСДМДК,
	                       |	ШапкаДокумента.НаименованиеСерии КАК НаименованиеСерии,
	                       |	ШапкаДокумента.НомерПаспорта КАК НомерПаспорта,
	                       |	ШапкаДокумента.Номер КАК Номер,
	                       |	ШапкаДокумента.ТипПартии КАК ТипПартии,
	                       |	ШапкаДокумента.ВидПартии КАК ВидПартии,
	                       |	ШапкаДокумента.ЭтапОбработки КАК ЭтапОбработки,
	                       |	ШапкаДокумента.СтадияОбработки КАК СтадияОбработки,
	                       |	ШапкаДокумента.ОКПД2 КАК ОКПД2,
	                       |	ШапкаДокумента.Количество КАК Количество,
	                       |	ШапкаДокумента.Вес КАК Вес,
	                       |	ШапкаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ШапкаДокумента.ЭтоКамни КАК ЭтоКамни,
	                       |	ШапкаДокумента.Ссылка КАК Ссылка,
	                       |	ШапкаДокумента.Металл КАК Металл,
	                       |	ШапкаДокумента.Проба КАК Проба,
	                       |	ШапкаДокумента.Дата КАК Дата,
	                       |	ШапкаДокумента.УчетВКаратах КАК УчетВКаратах,
	                       |	ШапкаДокумента.ВидОперации КАК ВидОперации,
	                       |	ШапкаДокумента.УИН КАК УИН,
	                       |	ШапкаДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	ШапкаДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	ШапкаДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	ШапкаДокумента.ОрганизацияЮрФизЛицо КАК ОрганизацияЮрФизЛицо,
	                       |	ШапкаДокумента.ОрганизацияИНН КАК ОрганизацияИНН,
	                       |	ШапкаДокумента.ОрганизацияКПП КАК ОрганизацияКПП,
	                       |	ШапкаДокумента.ОрганизацияОГРН КАК ОрганизацияОГРН,
	                       |	ШапкаДокумента.ИмяМетода КАК ИмяМетода
	                       |ИЗ
	                       |	ШапкаДокумента КАК ШапкаДокумента
	                       |ГДЕ
	                       |	&НомерОперации = 4
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	                       |	СтрокиДокумента.ИНППреобразованияВЛом КАК ИНППреобразованияВЛом,
	                       |	СтрокиДокумента.Количество КАК Количество,
	                       |	СтрокиДокумента.Вес КАК Вес,
	                       |	СтрокиДокумента.ВесМеталлаВЧистоте КАК ВесМеталлаВЧистоте,
	                       |	СтрокиДокумента.Металл КАК Металл,
	                       |	СтрокиДокумента.СтатусЗапроса КАК СтатусЗапроса,
	                       |	СтрокиДокумента.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	СтрокиДокумента.СсылкаНаДокумент КАК СсылкаНаДокумент
	                       |ИЗ
	                       |	СтрокиДокумента КАК СтрокиДокумента
	                       |ГДЕ
	                       |	СтрокиДокумента.ИНППреобразованияВЛом <> """"
	                       |	И &НомерОперации = 4
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	Металлы.НомерСтроки,
	                       |	Металлы.ИНП,
	                       |	0,
	                       |	Металлы.Вес,
	                       |	Металлы.ВесВЧистоте,
	                       |	Металлы.ТипМеталла,
	                       |	Металлы.Статус,
	                       |	Металлы.ИдентификаторЗапроса,
	                       |	Металлы.Ссылка
	                       |ИЗ
	                       |	Металлы КАК Металлы
	                       |ГДЕ
	                       |	&НомерОперации = 4
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал КАК Материал,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Вес КАК Вес,
	                       |	Товары.НомерСтроки КАК НомерСтроки,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Металл КАК МатериалМеталл,
	                       |	ХарактеристикиНоменклатурыДополнительныеМатериалы.Материал.Проба КАК МатериалПроба
	                       |ИЗ
	                       |	Товары КАК Товары
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеМатериалы КАК ХарактеристикиНоменклатурыДополнительныеМатериалы
	                       |		ПО Товары.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатурыДополнительныеМатериалы.Ссылка
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	КомплектацияТоваровКамни.НомерСтроки КАК НомерСтроки,
	                       |	КомплектацияТоваровКамни.ИНП КАК ИНП,
	                       |	КомплектацияТоваровКамни.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	                       |	КомплектацияТоваровКамни.ОписаниеОшибки КАК ОписаниеОшибки,
	                       |	КомплектацияТоваровКамни.СтатусЗапроса КАК СтатусЗапроса
	                       |ИЗ
	                       |	Документ.КомплектацияТоваров.Камни КАК КомплектацияТоваровКамни
	                       |ГДЕ
	                       |	КомплектацияТоваровКамни.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("НомерОперации", НомерОперации + 1);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДанныеДляПолученияВидаПартииИСобственника = РезультатЗапроса[4].Выбрать();
	ДанныеДляПреобразования = РезультатЗапроса[5].Выбрать();
	ДанныеДляПолученияВесаЧистоты = РезультатЗапроса[6].Выбрать();
	ДанныеШапкиДокументов = РезультатЗапроса[7].Выбрать();
	ДанныеПоТоварам = РезультатЗапроса[8].Выгрузить();
	ДанныеПоДопМатериалам = РезультатЗапроса[9].Выгрузить();
	ДанныеПоКамням = РезультатЗапроса[10].Выбрать();
	
	Пакеты = Новый Соответствие;
	ДанныеДляОтправки = Новый Структура;
	НомерПакета = 0;
	
	МассивТоваров = Новый Массив;
	
	//ДопустимоеКоличествоПартий = 50;
	КоличествоВЗапросе = 0;
	НомераСтрокНеОтправлено = Новый Массив;
	МассивТоваровДляОтправкиВПакете = Новый Массив;
	
	Пока ДанныеДляПолученияВидаПартииИСобственника.Следующий() Цикл
		Если ДанныеДляПолученияВидаПартииИСобственника.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			Продолжить;
		ИначеЕсли ДанныеДляПолученияВидаПартииИСобственника.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() 
			и (ДанныеДляПолученияВидаПартииИСобственника.ИмяМетода = "" 
				Или ДанныеДляПолученияВидаПартииИСобственника.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаРезультатПолученияСведенийОПартиях()) Тогда	
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеДляПолученияВидаПартииИСобственника.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаРезультатПолученияСведенийОПартиях());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета());
			Результат.Вставить("ИмяТабЧасти", ДанныеДляПолученияВидаПартииИСобственника.ИмяТабЧасти);
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			НомераСтрокНеОтправлено.Добавить(ДанныеДляПолученияВидаПартииИСобственника.НомерСтроки);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Результат.Вставить("УИН", ДанныеДляПолученияВидаПартииИСобственника.ИНП);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", ДанныеДляПолученияВидаПартииИСобственника.ИмяТабЧасти);
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;
	КонецЦикла;	
	
	НомераСтрокНеОтправлено = Новый Массив;
	Пока ДанныеДляПреобразования.Следующий() Цикл
		Если ДанныеДляПреобразования.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() 
			И Не ДанныеДляПреобразования.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
			Продолжить;
		ИначеЕсли ДанныеДляПреобразования.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() 
			и (ДанныеДляПреобразования.ИмяМетода = "" 
				Или ДанныеДляПреобразования.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаРезультатОтправкаПреобразованиеВЛомНаРегистрацию()) Тогда	
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеДляПреобразования.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаРезультатОтправкаПреобразованиеВЛомНаРегистрацию());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета());
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			СтруктураСтроки = Новый Структура;	
			СтруктураСтроки.Вставить("НомерСтроки", ДанныеДляПреобразования.НомерСтроки);
			СтруктураСтроки.Вставить("УИН", ДанныеДляПреобразования.УИН);
			МассивТоваровДляОтправкиВПакете.Добавить(СтруктураСтроки);
			НомераСтрокНеОтправлено.Добавить(ДанныеДляПреобразования.НомерСтроки);
			КоличествоВЗапросе = КоличествоВЗапросе + 1;
			Если КоличествоВЗапросе = ДопустимоеКоличествоПартий Тогда
				НомерПакета = НомерПакета + 1;
				Результат = Новый Структура();
				Результат.Вставить("Спецификации", МассивТоваровДляОтправкиВПакете);
				Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
				Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаПреобразованияВЛомНаРегистрацию());
				Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
				Пакеты.Вставить(НомерПакета, Результат);
				КоличествоВЗапросе = 0;
				МассивТоваровДляОтправкиВПакете = Новый Массив;
				НомераСтрокНеОтправлено = Новый Массив;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоВЗапросе > 0 Тогда
		НомерПакета = НомерПакета + 1;
		Результат = Новый Структура();
		Результат.Вставить("Спецификации", МассивТоваровДляОтправкиВПакете);
		Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
		Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаПреобразованияВЛомНаРегистрацию());
		Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
		Пакеты.Вставить(НомерПакета, Результат);
		КоличествоВЗапросе = 0;
		МассивТоваровДляОтправкиВПакете = Новый Массив;
		НомераСтрокНеОтправлено = Новый Массив;
	КонецЕсли;
			
	Пока ДанныеДляПолученияВесаЧистоты.Следующий() Цикл
		Если ДанныеДляПолученияВесаЧистоты.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда	
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеДляПолученияВесаЧистоты.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаРезультатПолученияСведенийОПартиях());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета());
			Результат.Вставить("ИмяТабЧасти", ДанныеДляПолученияВесаЧистоты.ИмяТабЧасти);
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			НомераСтрокНеОтправлено.Добавить(ДанныеДляПолученияВесаЧистоты.НомерСтроки);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Результат.Вставить("УИН", ДанныеДляПолученияВесаЧистоты.ИНП);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", ДанныеДляПолученияВесаЧистоты.ИмяТабЧасти);
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;	
	КонецЦикла;		
	
	Пока ДанныеШапкиДокументов.Следующий() Цикл
		Если ДанныеШапкиДокументов.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех()
			И Не ДанныеШапкиДокументов.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
			Продолжить;
		ИначеЕсли ДанныеШапкиДокументов.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета()
			И Не ДанныеШапкиДокументов.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеШапкиДокументов.ИдентификаторЗапроса);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаРезультатОтправкаКомплектацийНаРегистрацию());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета());
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе		
			НомерПакета = НомерПакета + 1;
			Спецификация = ПодготовитьДанныеДокументаСОперациейКомплектации(ДанныеШапкиДокументов, ДанныеПоТоварам, ДанныеПоДопМатериалам,
				ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту);
				
			Результат = Новый Структура();
			Результат.Вставить("Спецификации", Спецификация);
			Результат.Вставить("НомераСтрокНеОтправлено", 0);
			МассивСтрок = Новый Массив;
			Для Каждого ТекСтр Из ДанныеПоТоварам Цикл
				МассивСтрок.Добавить(ТекСтр.НомерСтроки);
			КонецЦикла;	
			Результат.Вставить("НомераСтрокДляЗаполнения", МассивСтрок);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектацийНаРегистрацию());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;	
		
	КонецЦикла;
		
	Пока ДанныеПоКамням.Следующий() Цикл
		Если ДанныеПоКамням.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			Продолжить;
		ИначеЕсли ДанныеПоКамням.СтатусЗапроса = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда	
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ДанныеПоКамням.ИдентификаторЗапроса);
			Результат.Вставить("ИмяТабЧасти", "Камни");
			Результат.Вставить("ИмяМетода", "CheckGetBatch");
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета());
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			НомераСтрокНеОтправлено.Добавить(ДанныеПоКамням.НомерСтроки);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Результат.Вставить("УИН", ДанныеПоКамням.ИНП);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяТабЧасти", "Камни");
			Результат.Вставить("ИмяМетода", "SendGetBatch");
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;		
	КонецЦикла;
	
	ДанныеДляОтправки.Вставить("Пакеты", Пакеты);
	
	Возврат ДанныеДляОтправки;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеПреобразованиеВЛом(НомерОперации)
	
	Если Объект.ПараллельнаяОтправкаДанных Тогда
		ДанныеДляОтправки = ПодготовитьДанныеПреобразованиеВЛомПараллельно(НомерОперации);	
	Иначе
		ДанныеДляОтправки = ПодготовитьДанныеПреобразованиеВЛомПоследовательно(НомерОперации);
	КонецЕсли;	
	
	Возврат ДанныеДляОтправки;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеКомплектацияИзделие(НомерОперации)
	ПоискТоваровПоВнутреннемуШК = Константы.ПоискТоваровПоВнутреннемуШК.Получить();
	ПоискТоваровПоПаспорту = Константы.ПоискТоваровПоПаспорту.Получить();
	
	Пакеты = Новый Соответствие;
	ДанныеДляОтправки = Новый Структура;
	НомерПакета = 0;
	
	МассивТоваров = Новый Массив;
	
	НомераСтрокНеОтправлено = Новый Массив;
	МассивТоваровДляОтправкиВПакете = Новый Массив;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Очередь", НомерОперации);
	ЗапросыДляОтправкиДанных = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого ЗапросДляОтправки Из ЗапросыДляОтправкиДанных Цикл
		Если ЗапросДляОтправки.Статус = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			Продолжить;
		ИначеЕсли ЗапросДляОтправки.Статус = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ЗапросДляОтправки.ИдентификаторЗапроса);
			ТекущееИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияРезультата(ЗапросДляОтправки.ИмяМетода);
			Результат.Вставить("ИмяМетода", ?(ТекущееИмяМетода = "", ЗапросДляОтправки.ИмяМетода, ТекущееИмяМетода));
			НомераСтрокНеОтправлено = Новый Массив;
			НомераСтрокНеОтправлено.Добавить(ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета());
			Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
			Пакеты.Вставить(НомерПакета, Результат);	
		ИначеЕсли ЗапросДляОтправки.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях() Тогда
			НомераСтрокНеОтправлено = Новый Массив;
			НомераСтрокНеОтправлено.Добавить(ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Если ЗапросДляОтправки.ИНП = "" И ЗапросДляОтправки.ИмяТабличнойЧасти = "" Тогда
				Результат.Вставить("УИН", Объект.ИНП);
			Иначе	
				Результат.Вставить("УИН", ЗапросДляОтправки.ИНП);
			КонецЕсли;
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодаЗапросПолученияСведенийОПартиях());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
			Пакеты.Вставить(НомерПакета, Результат);
		ИначеЕсли ЗапросДляОтправки.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросНаРезервированиеДиапазонаУИН() Тогда
			НомераСтрокНеОтправлено = Новый Массив;
			НомераСтрокНеОтправлено.Добавить(ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Результат.Вставить("КоличествоУИН", 1);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодЗапросНаРезервированиеДиапазонаУИН());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
			Пакеты.Вставить(НомерПакета, Результат);
		ИначеЕсли ЗапросДляОтправки.ИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаОтправкаПартийНаРегистрацию() Тогда
			НомерПакета = НомерПакета + 1;
			РезультатЗапроса = ПолучитьДанныеКомплектацииДляОбъединенияИзделий();
			ДанныеШапкиДокументов = РезультатЗапроса[3].Выбрать();
			ДанныеПоТоварам = РезультатЗапроса[4].Выгрузить();
			Спецификация = ПодготовитьДанныеДокументаСОперациейКомплектацияИзделий(ДанныеШапкиДокументов, ДанныеПоТоварам,
				ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту);
				
			Результат = Новый Структура();
			Результат.Вставить("ТаблицаПартий", Спецификация.МассивТоваров);
			Результат.Вставить("НомераСтрокНеОтправлено", 0);
			МассивСтрок = Новый Массив;
			Для Каждого ТекСтр Из ДанныеПоТоварам Цикл
				МассивСтрок.Добавить(ТекСтр.НомерСтроки);
			КонецЦикла;	
			Результат.Вставить("НомераСтрокДляЗаполнения", МассивСтрок);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаОтправкаПартийНаРегистрацию());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", "");
			Пакеты.Вставить(НомерПакета, Результат);
		ИначеЕсли ЗапросДляОтправки.ИмяМетода = ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектацийНаРегистрацию() Тогда
			НомерПакета = НомерПакета + 1;
			РезультатЗапроса = ПолучитьДанныеКомплектацииДляОбъединенияПартийИзделий(); 
			ДанныеШапкиДокументов = РезультатЗапроса[3].Выбрать();
			ДанныеПоТоварам = РезультатЗапроса[4].Выгрузить();
			ДанныеПоДопМатериалам = РезультатЗапроса[5].Выгрузить();
			Спецификация = ПодготовитьДанныеДокументаСОперациейКомплектации(ДанныеШапкиДокументов, ДанныеПоТоварам, ДанныеПоДопМатериалам,
				ПоискТоваровПоВнутреннемуШК, ПоискТоваровПоПаспорту);
	
			Результат = Новый Структура();
			Результат.Вставить("Спецификации", Спецификация);
			Результат.Вставить("НомераСтрокНеОтправлено", 0);
			МассивСтрок = Новый Массив;
			Для Каждого ТекСтр Из ДанныеПоТоварам Цикл
				МассивСтрок.Добавить(ТекСтр.НомерСтроки);
			КонецЦикла;	
			Результат.Вставить("НомераСтрокДляЗаполнения", МассивСтрок);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектацийНаРегистрацию());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
			Пакеты.Вставить(НомерПакета, Результат);	
		КонецЕсли;
	КонецЦикла;
		
	ДанныеДляОтправки.Вставить("Пакеты", Пакеты);
	
	Возврат ДанныеДляОтправки;
КонецФункции

&НаСервере
Функция ПодготовитьДанныеРазукомплектацияИзделие(НомерОперации)
	Пакеты = Новый Соответствие;
	ДанныеДляОтправки = Новый Структура;
	НомерПакета = 0;
	
	МассивТоваров = Новый Массив;
	
	КоличествоВЗапросе = 0;
	НомераСтрокНеОтправлено = Новый Массив;
	МассивТоваровДляОтправкиВПакете = Новый Массив;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Очередь", НомерОперации);
	ЗапросыДляОтправкиДанных = Объект.СписокЗапросов.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого ЗапросДляОтправки Из ЗапросыДляОтправкиДанных Цикл
		Если ЗапросДляОтправки.Статус = ИнтеграцияГИИСДМДК.СтатусУспех() Тогда
			Продолжить;
		ИначеЕсли ЗапросДляОтправки.Статус = ИнтеграцияГИИСДМДК.СтатусОжиданиеОтвета() Тогда
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура;
			Результат.Вставить("ИдентификаторЗапроса", ЗапросДляОтправки.ИдентификаторЗапроса);
			ТекущееИмяМетода = ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.ИмяМетодаПолученияРезультата(ЗапросДляОтправки.ИмяМетода);
			Результат.Вставить("ИмяМетода", ?(ТекущееИмяМетода = "", ЗапросДляОтправки.ИмяМетода, ТекущееИмяМетода));
			НомераСтрокНеОтправлено = Новый Массив;
			НомераСтрокНеОтправлено.Добавить(ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусОжиданиеОтвета());
			Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
			Пакеты.Вставить(НомерПакета, Результат);	
		Иначе
			НомераСтрокНеОтправлено = Новый Массив;
			НомераСтрокНеОтправлено.Добавить(ЗапросДляОтправки.НомерСтрокиТаблЧасти);
			НомерПакета = НомерПакета + 1;
			Результат = Новый Структура();
			Партии = Новый Массив;
			Партия = Новый Структура;
			Партия.Вставить("ПорядковыйНомер", 1);
			Партия.Вставить("УИН", ЗапросДляОтправки.ИНП);
			Партия.Вставить("Заменить", Ложь);
			Партия.Вставить("ВложенныеПартии", Новый Массив);
			Партии.Добавить(Партия);
			Результат.Вставить("Партии", Партии);
			Результат.Вставить("НомераСтрокНеОтправлено", НомераСтрокНеОтправлено);
			Результат.Вставить("ИмяМетода", ИнтеграцияГИИСДМДК.ИмяМетодЗапросОтправкаКомплектации());
			Результат.Вставить("СтатусЗапроса", ИнтеграцияГИИСДМДКСлужебныйКлиентСервер.СтатусНеОтправлено());
			Результат.Вставить("ИмяТабЧасти", ЗапросДляОтправки.ИмяТабличнойЧасти);
			Пакеты.Вставить(НомерПакета, Результат);
		КонецЕсли;
	КонецЦикла;
		
	ДанныеДляОтправки.Вставить("Пакеты", Пакеты);
	
	Возврат ДанныеДляОтправки;
КонецФункции

&НаСервере
Функция ПодготовитьДанныеДляОтправки(НомерОперации)
	Если Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.ПреобразованиеВЛом Тогда
		ПредварительныеДанныеДляОтправки = ПодготовитьДанныеПреобразованиеВЛом(НомерОперации);
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.КомплектацияИзделие Тогда	
		ПредварительныеДанныеДляОтправки = ПодготовитьДанныеКомплектацияИзделие(НомерОперации);
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацииКомплектацииЦенностей.РазукомплектацияИзделие Тогда
		ПредварительныеДанныеДляОтправки = ПодготовитьДанныеРазукомплектацияИзделие(НомерОперации);
	КонецЕсли;
	
	Возврат ПредварительныеДанныеДляОтправки;
	
КонецФункции

&НаСервере
Процедура ПроверитьИОбновитьПромежуточныеКомплекты()
	
	ОбновитьПромежуточныеКомплекты();
	ЗаполнитьСписокЗапросов();
	ЗаполнитьСписокОпераций();
	ЗаполнитьСтатусОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДанныеПоОперации(НомерОперации, ПереходитьКСледующейОперации)
	
	Элементы.ГруппаОшибки.Видимость = Ложь;
	
	Если ИдетОтправкаДанных Тогда
		Возврат;
	КонецЕсли;
			
	НомерТекущейОперации = Число(Прав(НомерОперации,1));
	Если НомерТекущейОперации <> 1 
		И Элементы["ПолеГалка"+(НомерТекущейОперации - 1)].Картинка <> БиблиотекаКартинок.СостоянияРасширенийПодключено Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не отправлены данные по предыдущей операции");
		Возврат;
	ИначеЕсли СписокОпераций.НайтиПоЗначению(НомерТекущейОперации) = Неопределено Тогда
		Возврат;
	ИначеЕсли НомерТекущейОперации = 1 И Не ДанныеЗаполненыКорректно() Тогда
		Возврат;
	ИначеЕсли НомерТекущейОперации = 2 И Не ПроизводительЗаполненКорректно() Тогда
		Возврат;	
	ИначеЕсли НомерТекущейОперации = 4 И Объект.Металл.Количество() > 0 Тогда
		ПроверитьИОбновитьПромежуточныеКомплекты();
	КонецЕсли;	
	ИдетОтправкаДанных = Истина;
	
	Элементы.ГруппаТекущийПроцесс.Видимость = Истина;
		
	ДополнительныеПараметрыПослеВыбораСертификата = Новый Структура;
	ДополнительныеПараметрыПослеВыбораСертификата.Вставить("НомерТекущейОперации", НомерТекущейОперации);
	ДополнительныеПараметрыПослеВыбораСертификата.Вставить("ПереходитьКСледующейОперации", ПереходитьКСледующейОперации);

	Если СписокСертификатов.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораСертификата", ЭтотОбъект, ДополнительныеПараметрыПослеВыбораСертификата);
		СписокСертификатов.ПоказатьВыборЭлемента(Оповещение, "Выберите сертификат");
	Иначе
		ПослеВыбораСертификата(Сертификат, ДополнительныеПараметрыПослеВыбораСертификата);
	КонецЕсли;
	
КонецПроцедуры		

&НаКлиенте
Процедура ПослеВыбораСертификата(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не выбран сертификат по организации. Отправка информации о документе не возможна");
		Элементы.ГруппаТекущийПроцесс.Видимость = Ложь;
		ИдетОтправкаДанных = Ложь;
		Возврат;
	КонецЕсли;	
	
	Сертификат = ?(ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений"), Результат.Значение, Результат);

	ПредварительныеДанныеДляОтправки = ПодготовитьДанныеДляОтправки(ДополнительныеПараметры.НомерТекущейОперации);
	
	Если ПредварительныеДанныеДляОтправки.Пакеты.Количество() > 0 Тогда
		ОтправитьИнформациюОКомплектации(Сертификат, ПредварительныеДанныеДляОтправки.Пакеты, 1, 
			ДополнительныеПараметры.НомерТекущейОперации, ДополнительныеПараметры.ПереходитьКСледующейОперации);
	Иначе
		Элементы.ГруппаТекущийПроцесс.Видимость = Ложь;	
		ИдетОтправкаДанных = Ложь;
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Нет данных для отправки");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияКнопкиМеню(ИмяДействия, НомерОперации)
	Если ИмяДействия = "ОтправитьДанные" Тогда
		ОтправитьДанныеПоОперации(НомерОперации, Ложь);
	ИначеЕсли ИмяДействия = "ПоказатьОшибки" Тогда
		ПоказатьОшибки(НомерОперации);
	ИначеЕсли ИмяДействия = "ПоказатьЗапросы" Тогда
		ПоказатьЗапросы(НомерОперации);
	Иначе
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не описан обработчик для команды " + ИмяДействия);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеНажатиеЗавершение(Команда, ДополнительныеПараметры) Экспорт

	Если Команда <> Неопределено Тогда
		ОбработкаНажатияКнопкиМеню(Команда.Значение, ДополнительныеПараметры.Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеНажатие(Элемент)
	Если Элементы["ПолеГалка"+Прав(Элемент.Имя,1)].Картинка = БиблиотекаКартинок.СостоянияРасширенийПодключено Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Данные успешно отправлены'"), , НСтр("ru = 'Отправка данных в ГИИС ДМДК'"));
		Возврат;
	Иначе
		СписокКоманд = Новый СписокЗначений;
	    СписокКоманд.Добавить("ОтправитьДанные", НСтр("ru = 'Отправить данные в ГИИС ДМДК'"));
		Если Элементы["ПолеГалка"+Прав(Элемент.Имя,1)].Картинка = БиблиотекаКартинок.Остановить Тогда
			СписокКоманд.Добавить("ПоказатьОшибки", НСтр("ru = 'Показать данные с ошибками отправки в ГИИС ДМДК'"));
		КонецЕсли;
		СписокКоманд.Добавить("ПоказатьЗапросы", НСтр("ru = 'Показать запросы в ГИИС ДМДК'"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Элемент", Элемент.Имя);
		ОповещениеВыбораИзМеню = Новый ОписаниеОповещения("ОписаниеНажатиеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
		ПоказатьВыборИзМеню(ОповещениеВыбораИзМеню, СписокКоманд, Элемент);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросовПриАктивизацииСтроки(Элемент)
	Если НЕ Элементы.СписокЗапросов.ТекущиеДанные = Неопределено Тогда	
		Отбор = Новый ФиксированнаяСтруктура("НомерСтроки", Элементы.СписокЗапросов.ТекущиеДанные.НомерСтрокиТаблЧасти);
		Если Элементы.СписокЗапросов.ТекущиеДанные.ИмяТабличнойЧасти = "" Тогда
			Элементы.ГруппаОшибкиПодробно.ТекущаяСтраница = Элементы["ГруппаШапка"];
		Иначе	
			Элементы.ГруппаОшибкиПодробно.ТекущаяСтраница = Элементы["Группа" + Элементы.СписокЗапросов.ТекущиеДанные.ИмяТабличнойЧасти];
			Элементы[Элементы.СписокЗапросов.ТекущиеДанные.ИмяТабличнойЧасти].ОтборСтрок = Отбор;
		КонецЕсли;
	Иначе
		Отбор = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ИдетОтправкаДанных И ЗавершениеРаботы = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗавершениеРаботы = Ложь Тогда
		ПараметрыЗаписи = Новый Структура;
    	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры
