
&НаСервере
&Вместо("ЗаполнитьСтрокуЮвелирноеИзделие")
Процедура B1_ЗаполнитьСтрокуЮвелирноеИзделие(Сч, ТабличныйДокумент, УИН, НовыйФормат, ТипПартии)
	
	Смещение = ?(НовыйФормат, 2, 0);
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	Если СокрЛП(ТабличныйДокумент.Область(Сч, 11, Сч, 11).Текст) <> ИНН И НовыйФормат
		Или СокрЛП(ТабличныйДокумент.Область(Сч, 9, Сч, 9).Текст) <> ИНН И НовыйФормат = Ложь Тогда
		Возврат;
	КонецЕсли;	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("УИН", УИН);			
	ЕстьСтрока = Объект.Движения.ТоварыИнвентаризацииУИН.НайтиСтроки(СтруктураПоиска);
	Если ЕстьСтрока.Количество() > 0 Тогда
		НовСтр = ЕстьСтрока[0];
		НовСтр.Дата = Объект.Дата;
		НовСтр.Номер = Объект.Номер;
	Иначе	
		НовСтр = Объект.Движения.ТоварыИнвентаризацииУИН.Добавить();	
		НовСтр.Дата = Объект.Дата;
		НовСтр.Номер = Объект.Номер;
		НовСтр.УИН = УИН;
	КонецЕсли;
	НовСтр.ЕстьОшибкаДанных = Истина;
	НовСтр.Наименование = СокрЛП(ТабличныйДокумент.Область(Сч, 12 + Смещение, Сч, 12 + Смещение).Текст);
	НовСтр.НаименованиеПолное = СокрЛП(ТабличныйДокумент.Область(Сч, 13 + Смещение, Сч, 13 + Смещение).Текст);
	Смещение = ?(НовыйФормат, 4, 0);
	НовСтр.Вес = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 17 + Смещение, Сч, 17 + Смещение).Текст);
	НовСтр.Количество = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 18 + Смещение, Сч, 18 + Смещение).Текст);
	ОсновнойМеталл = ТабличныйДокумент.Область(Сч, 19 + Смещение, Сч, 19 + Смещение).Текст;
	
	НовСтр.ВесВЧистотеЗолото = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 20 + Смещение, Сч, 20 + Смещение).Текст);
	НовСтр.ВесВЧистотеСеребро = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 21 + Смещение, Сч, 21 + Смещение).Текст);
	НовСтр.ВесВЧистотеПлатина = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 22 + Смещение, Сч, 22 + Смещение).Текст);
	НовСтр.ВесВЧистотеПалладий = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 23 + Смещение, Сч, 23 + Смещение).Текст);
	НовСтр.ВесВЧистотеИридий = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 24 + Смещение, Сч, 24 + Смещение).Текст);
	НовСтр.ВесВЧистотеРодий = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 25 + Смещение, Сч, 25 + Смещение).Текст);
	НовСтр.ВесВЧистотеОсмий = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 26 + Смещение, Сч, 26 + Смещение).Текст);
	НовСтр.ВесВЧистотеРутений = ОписаниеТипаЧисло.ПривестиЗначение(ТабличныйДокумент.Область(Сч, 27 + Смещение, Сч, 27 + Смещение).Текст);
	
	НовСтр.ВесВЧистоте = НовСтр["ВесВЧистоте" + ОсновнойМеталл];
		
	//ЕстьСерияВНаименовании = СтрНайти(НовСтр.Наименование, " серия ");
	ЕстьСерияВНаименовании = 0;
	Если ЕстьСерияВНаименовании > 0 Тогда
		НовСтр.НаименованиеСерии = Сред(НовСтр.Наименование, ЕстьСерияВНаименовании + 7);
	КонецЕсли;
	
	//ПродолжитьВызов(Сч, ТабличныйДокумент, УИН, НовыйФормат);
	
КонецПроцедуры
