
//&НаСервере
//&ИзменениеИКонтроль("ЗагрузитьИзФайлаНаСервереWB")
//Процедура B1_ЗагрузитьИзФайлаНаСервереWB(АдресВременногоХранилища, РасширениеФайла)

//	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
//    ИмяФайлаДанных = ПолучитьИмяВременногоФайла(РасширениеФайла);
//    ДвоичныеДанные.Записать(ИмяФайлаДанных);	
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	
//	ТабличныйДокумент.Прочитать(ИмяФайлаДанных);
//	
//	ТаблицаДанныхИзФайлаВБ.Очистить();
//	
//	#Удаление
//	Для Сч = 2 по ТабличныйДокумент.ВысотаТаблицы Цикл
//		Если ЗначениеЗаполнено(ТабличныйДокумент.Область(Сч, 5, Сч, 5).Текст) Тогда
//			НомерЧека = ТабличныйДокумент.Область(Сч, 7, Сч, 7).Текст;
//			Дата = ТабличныйДокумент.Область(Сч, 8, Сч, 8).Текст;
//			НомерФН = ТабличныйДокумент.Область(Сч, 10, Сч, 10).Текст;
//			Если Объект.ДобавлятьПустыеСтроки 
//				ИЛИ (НЕ ПустаяСтрока(НомерЧека) 
//				И НЕ ПустаяСтрока(Дата) 
//				И НЕ ПустаяСтрока(НомерФН)) Тогда
//				НовСтр = ТаблицаДанныхИзФайлаВБ.Добавить();
//				НовСтр.СерияТекст = ТабличныйДокумент.Область(Сч, 5, Сч, 5).Текст;
//				НовСтр.НомерЧека = НомерЧека; 
//				НовСтр.ДатаЧека = Дата(Дата + " 00:00:00");
//				НовСтр.НомерФН = НомерФН;
//				НовСтр.Сумма = ТабличныйДокумент.Область(Сч, 2, Сч, 2).Текст;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	#КонецУдаления
//	#Вставка
//	ОбластьПоиска = ТабличныйДокумент.Область(1, 1, 1, 16);
//	СтолбцыПоиска = Новый Структура();
//	СтолбцыПоиска.Вставить("Штрихкод", Новый Массив(2));
//	СтолбцыПоиска.Штрихкод[0] = "Штрих-код";
//	СтолбцыПоиска.Вставить("НомерЧека", Новый Массив(2));
//	СтолбцыПоиска.НомерЧека[0] = "Номер фискального документа";
//	СтолбцыПоиска.Вставить("Дата", Новый Массив(2));
//	СтолбцыПоиска.Дата[0] = "Время фискализации";
//	СтолбцыПоиска.Вставить("НомерФН", Новый Массив(2));
//	СтолбцыПоиска.НомерФН[0] = "Номер фискального накопителя";
//	СтолбцыПоиска.Вставить("Сумма", Новый Массив(2));
//	СтолбцыПоиска.Сумма[0] = "Цена товара с учетом НДС";
//	СтолбцыПоиска.Вставить("КодМаркировки", Новый Массив(2));
//	СтолбцыПоиска.КодМаркировки[0] = "Код маркировки";


//	Для каждого СтолбецПоиска Из СтолбцыПоиска Цикл
//		
//		ОбластьСтолбцаПоиска = ТабличныйДокумент.НайтиТекст(СтолбецПоиска.Значение[0], , ОбластьПоиска, , Истина, , Истина);
//		Если ЗначениеЗаполнено(ОбластьСтолбцаПоиска) Тогда
//			СтолбецПоиска.Значение[1] = ОбластьСтолбцаПоиска.Право;
//		Иначе	
//		    ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не найден столбец " + СтолбецПоиска.Значение[0]);
//			Возврат;
//		КонецЕсли;

//	КонецЦикла;

//	Для Сч = 2 по ТабличныйДокумент.ВысотаТаблицы Цикл
//		Если ЗначениеЗаполнено(ТабличныйДокумент.Область(Сч, СтолбцыПоиска.Штрихкод[1]).Текст) Тогда
//			НомерЧека = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.НомерЧека[1]).Текст;
//			Дата = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.Дата[1]).Текст;
//			НомерФН = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.НомерФН[1]).Текст;
//			Если Объект.ДобавлятьПустыеСтроки 
//				ИЛИ (НЕ ПустаяСтрока(НомерЧека) 
//				И НЕ ПустаяСтрока(Дата) 
//				И НЕ ПустаяСтрока(НомерФН)) Тогда
//				НовСтр = ТаблицаДанныхИзФайлаВБ.Добавить();
//				НовСтр.СерияТекст = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.Штрихкод[1]).Текст;
//				НовСтр.НомерЧека = НомерЧека; 
//				НовСтр.ДатаЧека = Дата(Дата + " 00:00:00");
//				НовСтр.НомерФН = НомерФН;
//				НовСтр.Сумма = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.Сумма[1]).Текст;
//				НовСтр.КодМаркировки = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.КодМаркировки[1]).Текст;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	#КонецВставки
//	
//	Если ТаблицаДанныхИзФайлаВБ.Количество() > 0 Тогда
//		
//		Запрос = Новый Запрос("ВЫБРАТЬ
//		                      |	ТаблицаИзФайла.СерияТекст КАК СерияТекст,
//		                      |	ТаблицаИзФайла.НомерЧека КАК НомерЧека,
//		                      |	ТаблицаИзФайла.ДатаЧека КАК ДатаЧека,
//		                      |	ТаблицаИзФайла.НомерФН КАК НомерФН,
//							  #Вставка
//							  |	ТаблицаИзФайла.КодМаркировки КАК УИН,
//							  #КонецВставки
//		                      |	ТаблицаИзФайла.Сумма КАК Сумма
//		                      |ПОМЕСТИТЬ ДанныеИзФайла
//		                      |ИЗ
//		                      |	&ТаблицаИзФайла КАК ТаблицаИзФайла
//		                      |;
//		                      |
//		                      |////////////////////////////////////////////////////////////////////////////////
//		                      |ВЫБРАТЬ
//		                      |	Продажи1Обороты.Номенклатура КАК Номенклатура,
//		                      |	Продажи1Обороты.СерияНоменклатуры КАК СерияНоменклатуры,
//		                      |	Продажи1Обороты.СерияНоменклатуры.УИН КАК УИН,
//		                      |	Продажи1Обороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//		                      |	Продажи1Обороты.Размер КАК Размер,
//		                      |	Продажи1Обороты.КоличествоОборот КАК Количество,
//		                      |	Продажи1Обороты.ВесОборот КАК Вес,
//		                      |	Продажи1Обороты.СтоимостьОборот КАК Стоимость,
//		                      |	Продажи1Обороты.СтоимостьБезНДСОборот КАК СтоимостьБезНДС,
//		                      |	Продажи1Обороты.СерияНоменклатуры.Весовой КАК Весовой
//		                      |ПОМЕСТИТЬ ПереданныеПроданные
//		                      |ИЗ
//		                      |	РегистрНакопления.Продажи1.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Продажи1Обороты
//		                      |ГДЕ
//		                      |	Продажи1Обороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
//		                      |
//		                      |ОБЪЕДИНИТЬ ВСЕ
//		                      |
//		                      |ВЫБРАТЬ
//		                      |	ТоварыПереданныеОстатки.Номенклатура,
//		                      |	ТоварыПереданныеОстатки.СерияНоменклатуры,
//		                      |	ТоварыПереданныеОстатки.СерияНоменклатуры.УИН,
//		                      |	ТоварыПереданныеОстатки.ХарактеристикаНоменклатуры,
//		                      |	ТоварыПереданныеОстатки.Размер,
//		                      |	ТоварыПереданныеОстатки.КоличествоОстаток,
//		                      |	ТоварыПереданныеОстатки.ВесОстаток,
//		                      |	ТоварыПереданныеОстатки.СуммаВзаиморасчетовОстаток,
//		                      |	NULL,
//		                      |	ТоварыПереданныеОстатки.СерияНоменклатуры.Весовой
//		                      |ИЗ
//		                      |	РегистрНакопления.ТоварыПереданные.Остатки(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТоварыПереданныеОстатки
//		                      |ГДЕ
//		                      |	ТоварыПереданныеОстатки.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
//		                      |;
//		                      |
//		                      |////////////////////////////////////////////////////////////////////////////////
//		                      |ВЫБРАТЬ
//		                      |	ДанныеИзФайла.СерияТекст КАК СерияТекст,
//		                      |	ДанныеИзФайла.НомерЧека КАК НомерЧека,
//		                      |	ДанныеИзФайла.ДатаЧека КАК ДатаЧека,
//		                      |	ДанныеИзФайла.НомерФН КАК НомерФН,
//		                      |	ДанныеИзФайла.Сумма КАК Сумма,
//		                      |	ПереданныеПроданные.Номенклатура КАК Номенклатура,
//		                      |	ПереданныеПроданные.СерияНоменклатуры КАК СерияНоменклатуры,
//		                      |	ПереданныеПроданные.УИН КАК УИН,
//		                      |	ПереданныеПроданные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//		                      |	ПереданныеПроданные.Размер КАК Размер,
//		                      |	ПереданныеПроданные.Количество КАК Количество,
//		                      |	ПереданныеПроданные.Вес КАК Вес,
//		                      |	ПереданныеПроданные.Стоимость КАК Стоимость,
//		                      |	ПереданныеПроданные.СтоимостьБезНДС КАК СтоимостьБезНДС,
//		                      |	ПереданныеПроданные.Весовой КАК Весовой
//		                      |ИЗ
//		                      |	ДанныеИзФайла КАК ДанныеИзФайла
//		                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПереданныеПроданные КАК ПереданныеПроданные
//							  #Удаление
//		                      |		ПО (ПереданныеПроданные.СерияНоменклатуры.Наименование = ДанныеИзФайла.СерияТекст
//		                      |				ИЛИ ПереданныеПроданные.СерияНоменклатуры.НомерПаспорта = ДанныеИзФайла.СерияТекст
//		                      |				ИЛИ ПереданныеПроданные.СерияНоменклатуры.УИН = ДанныеИзФайла.СерияТекст)");
//							  #КонецУдаления
//							  #Вставка
//							  |		ПО (ПереданныеПроданные.СерияНоменклатуры.УИН = ДанныеИзФайла.УИН)");
//							  #КонецВставки

//		Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
//		Запрос.УстановитьПараметр("ТаблицаИзФайла", ТаблицаДанныхИзФайлаВБ.Выгрузить());
//		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.ПериодС));
//		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.ПериодПо));
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		Пока Выборка.Следующий() Цикл
//			Если Число(Выборка.Сумма) > 0 Тогда 
//				Если ЗначениеЗаполнено(Выборка.СерияНоменклатуры) Тогда
//					Отбор = Новый Структура();
//					Отбор.Вставить("СерияНоменклатуры", Выборка.СерияНоменклатуры);
//					НайденноеЗначение = Объект.Товары.НайтиСтроки(Отбор);
//					Если НайденноеЗначение.Количество() > 0 Тогда
//						Если НЕ ЗначениеЗаполнено(НайденноеЗначение[0].ФНПродажа) Тогда
//							НайденноеЗначение[0].ФНПродажа = Выборка.НомерФН;
//						КонецЕсли;
//						Если НайденноеЗначение[0].ФДПродажа = 0 Тогда
//							НайденноеЗначение[0].ФДПродажа = Выборка.НомерЧека;
//						КонецЕсли;
//						Если НайденноеЗначение[0].ДатаЧекаККТПродажа = Дата('00010101') Тогда
//					         НайденноеЗначение[0].ДатаЧекаККТПродажа = Выборка.ДатаЧека;
//						КонецЕсли;

//					Иначе
//						НовСтр = Объект.Товары.Добавить();
//						НовСтр.Номенклатура               = Выборка.Номенклатура;
//						НовСтр.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
//						НовСтр.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
//						НовСтр.УИН				          = Выборка.УИН;
//						НовСтр.Размер                     = Выборка.Размер;
//						НовСтр.Количество                 = Выборка.Количество;
//						НовСтр.Вес                        = Выборка.Вес;
//						НовСтр.Сумма                      = Выборка.Сумма; 
//						Если Выборка.Весовой и НовСтр.Вес<>0 Тогда 
//							НовСтр.Цена = Число(НовСтр.Сумма/НовСтр.Вес);
//						Иначе 
//							НовСтр.Цена = НовСтр.Сумма;
//						КонецЕсли;
//						НовСтр.ФНПродажа          = Выборка.НомерФН;
//						НовСтр.ФДПродажа          = Выборка.НомерЧека;
//						НовСтр.ДатаЧекаККТПродажа = Выборка.ДатаЧека;
//					КонецЕсли;
//				Иначе
//					ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Товар с штрих-кодом: "+ Выборка.СерияТекст+ " не найден среди переданных на продажу или проданных");
//				КонецЕсли;
//				
//			Иначе
//				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Товар с штрих-кодом: "+ Выборка.СерияТекст+ " содержит отрицательную стоимость");
//			КонецЕсли;
//			

//		КонецЦикла;
//		
//	Иначе
//		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не удалось прочитать данные из файла");
//	КонецЕсли;

//КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗагрузитьИзФайлаНаСервереWB")
Процедура B1_ЗагрузитьИзФайлаНаСервереWB(АдресВременногоХранилища, РасширениеФайла)

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ИмяФайлаДанных = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныеДанные.Записать(ИмяФайлаДанных);	

	ТабличныйДокумент = Новый ТабличныйДокумент;

	ТабличныйДокумент.Прочитать(ИмяФайлаДанных);

	ТаблицаДанныхИзФайлаВБ.Очистить();

	Если ТабличныйДокумент.Области.Количество() = 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Неверный формат файла'"));
		Возврат;
	Иначе
		ЧитаемаяОбласть = ТабличныйДокумент.ПолучитьОбласть("УИН");
	КонецЕсли;

	#Удаление
	Для Сч = 2 по ЧитаемаяОбласть.ВысотаТаблицы Цикл
		Если ЗначениеЗаполнено(ЧитаемаяОбласть.Область(Сч, 3, Сч, 3).Текст) Тогда
			НомерЧека = ЧитаемаяОбласть.Область(Сч, 4, Сч, 4).Текст;
			СтрокаДата = ЧитаемаяОбласть.Область(Сч, 8, Сч, 8).Текст;
			НомерФН = ЧитаемаяОбласть.Область(Сч, 7, Сч, 7).Текст;
			Если Объект.ДобавлятьПустыеСтроки 
				ИЛИ (НЕ ПустаяСтрока(НомерЧека) 
				И НЕ ПустаяСтрока(СтрокаДата) 
				И НЕ ПустаяСтрока(НомерФН)) Тогда
				НовСтр = ТаблицаДанныхИзФайлаВБ.Добавить();
				НовСтр.СерияТекст = ЧитаемаяОбласть.Область(Сч, 3, Сч, 3).Текст;
				НовСтр.НомерЧека = НомерЧека;
				ДатаВремя = СтрРазделить(СтрокаДата, " ");
				Дата = Прав(ДатаВремя[1], 4) + Сред(ДатаВремя[1], 4, 2) + Лев(ДатаВремя[1], 2);
				Время = СтрЗаменить(ДатаВремя[0], ":", ""); 
				НоваяДата=Дата(Дата + Время);
				НовСтр.ДатаЧека = ?(ЗначениеЗаполнено(НоваяДата), НоваяДата, Дата('00010101'));
				НовСтр.НомерФН = НомерФН;
				НовСтр.Сумма = ЧитаемаяОбласть.Область(Сч, 5, Сч, 5).Текст;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	#КонецУдаления
	#Вставка
	ОбластьПоиска = ТабличныйДокумент.Область(1, 1, 1, 16);
	СтолбцыПоиска = Новый Структура();
	СтолбцыПоиска.Вставить("Штрихкод", Новый Массив(2));
	СтолбцыПоиска.Штрихкод[0] = "Штрих-код";
	СтолбцыПоиска.Вставить("НомерЧека", Новый Массив(2));
	СтолбцыПоиска.НомерЧека[0] = "Номер фискального документа";
	СтолбцыПоиска.Вставить("Дата", Новый Массив(2));
	СтолбцыПоиска.Дата[0] = "Время фискализации";
	СтолбцыПоиска.Вставить("НомерФН", Новый Массив(2));
	СтолбцыПоиска.НомерФН[0] = "Номер фискального накопителя";
	СтолбцыПоиска.Вставить("Сумма", Новый Массив(2));
	СтолбцыПоиска.Сумма[0] = "Цена товара с учетом НДС";
	СтолбцыПоиска.Вставить("КодМаркировки", Новый Массив(2));
	СтолбцыПоиска.КодМаркировки[0] = "Код маркировки";


	Для каждого СтолбецПоиска Из СтолбцыПоиска Цикл
		
		ОбластьСтолбцаПоиска = ТабличныйДокумент.НайтиТекст(СтолбецПоиска.Значение[0], , ОбластьПоиска, , Истина, , Истина);
		Если ЗначениеЗаполнено(ОбластьСтолбцаПоиска) Тогда
			СтолбецПоиска.Значение[1] = ОбластьСтолбцаПоиска.Право;
		Иначе	
		    ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не найден столбец " + СтолбецПоиска.Значение[0]);
			Возврат;
		КонецЕсли;

	КонецЦикла;

	Для Сч = 2 по ТабличныйДокумент.ВысотаТаблицы Цикл
		Если ЗначениеЗаполнено(ТабличныйДокумент.Область(Сч, СтолбцыПоиска.Штрихкод[1]).Текст) Тогда
			НомерЧека = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.НомерЧека[1]).Текст;
			Дата = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.Дата[1]).Текст;
			НомерФН = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.НомерФН[1]).Текст;
			Если Объект.ДобавлятьПустыеСтроки 
				ИЛИ (НЕ ПустаяСтрока(НомерЧека) 
				И НЕ ПустаяСтрока(Дата) 
				И НЕ ПустаяСтрока(НомерФН)) Тогда
				НовСтр = ТаблицаДанныхИзФайлаВБ.Добавить();
				НовСтр.СерияТекст = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.Штрихкод[1]).Текст;
				НовСтр.НомерЧека = НомерЧека; 
				НовСтр.ДатаЧека = Дата(Дата + " 00:00:00");
				НовСтр.НомерФН = НомерФН;
				НовСтр.Сумма = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.Сумма[1]).Текст;
				НовСтр.КодМаркировки = ТабличныйДокумент.Область(Сч, СтолбцыПоиска.КодМаркировки[1]).Текст;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	#КонецВставки

	Если ТаблицаДанныхИзФайлаВБ.Количество() > 0 Тогда

		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ТаблицаИзФайла.СерияТекст КАК СерияТекст,
		|	ТаблицаИзФайла.НомерЧека КАК НомерЧека,
		|	ТаблицаИзФайла.ДатаЧека КАК ДатаЧека,
		|	ТаблицаИзФайла.НомерФН КАК НомерФН,
		#Вставка
		|	ТаблицаИзФайла.КодМаркировки КАК УИН,
		#КонецВставки
		|	ТаблицаИзФайла.Сумма КАК Сумма
		|ПОМЕСТИТЬ ДанныеИзФайла
		|ИЗ
		|	&ТаблицаИзФайла КАК ТаблицаИзФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Продажи1Обороты.Номенклатура КАК Номенклатура,
		|	Продажи1Обороты.СерияНоменклатуры КАК СерияНоменклатуры,
		|	Продажи1Обороты.СерияНоменклатуры.УИН КАК УИН,
		|	Продажи1Обороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Продажи1Обороты.Размер КАК Размер,
		|	Продажи1Обороты.КоличествоОборот КАК Количество,
		|	Продажи1Обороты.ВесОборот КАК Вес,
		|	Продажи1Обороты.СтоимостьОборот КАК Стоимость,
		|	Продажи1Обороты.СтоимостьБезНДСОборот КАК СтоимостьБезНДС,
		|	Продажи1Обороты.СерияНоменклатуры.Весовой КАК Весовой
		|ПОМЕСТИТЬ ПереданныеПроданные
		|ИЗ
		|	РегистрНакопления.Продажи1.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК Продажи1Обороты
		|ГДЕ
		|	Продажи1Обороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыПереданныеОстатки.Номенклатура,
		|	ТоварыПереданныеОстатки.СерияНоменклатуры,
		|	ТоварыПереданныеОстатки.СерияНоменклатуры.УИН,
		|	ТоварыПереданныеОстатки.ХарактеристикаНоменклатуры,
		|	ТоварыПереданныеОстатки.Размер,
		|	ТоварыПереданныеОстатки.КоличествоОстаток,
		|	ТоварыПереданныеОстатки.ВесОстаток,
		|	ТоварыПереданныеОстатки.СуммаВзаиморасчетовОстаток,
		|	NULL,
		|	ТоварыПереданныеОстатки.СерияНоменклатуры.Весовой
		|ИЗ
		|	РегистрНакопления.ТоварыПереданные.Остатки(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ТоварыПереданныеОстатки
		|ГДЕ
		|	ТоварыПереданныеОстатки.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ЮвелирноеИзделие)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИзФайла.СерияТекст КАК СерияТекст,
		|	ДанныеИзФайла.НомерЧека КАК НомерЧека,
		|	ДанныеИзФайла.ДатаЧека КАК ДатаЧека,
		|	ДанныеИзФайла.НомерФН КАК НомерФН,
		|	ДанныеИзФайла.Сумма КАК Сумма,
		|	ПереданныеПроданные.Номенклатура КАК Номенклатура,
		|	ПереданныеПроданные.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ПереданныеПроданные.УИН КАК УИН,
		|	ПереданныеПроданные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПереданныеПроданные.Размер КАК Размер,
		|	ПереданныеПроданные.Количество КАК Количество,
		|	ПереданныеПроданные.Вес КАК Вес,
		|	ПереданныеПроданные.Стоимость КАК Стоимость,
		|	ПереданныеПроданные.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ПереданныеПроданные.Весовой КАК Весовой
		|ИЗ
		|	ДанныеИзФайла КАК ДанныеИзФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереданныеПроданные КАК ПереданныеПроданные
		#Удаление
		|		ПО (ПереданныеПроданные.СерияНоменклатуры.Наименование = ДанныеИзФайла.СерияТекст
		|				ИЛИ ПереданныеПроданные.СерияНоменклатуры.НомерПаспорта = ДанныеИзФайла.СерияТекст
		|				ИЛИ ПереданныеПроданные.СерияНоменклатуры.УИН = ДанныеИзФайла.СерияТекст)");
		#КонецУдаления
		#Вставка
		|		ПО (ПереданныеПроданные.СерияНоменклатуры.УИН = ДанныеИзФайла.УИН)");
		#КонецВставки		

		Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента); 
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ТаблицаИзФайла", ТаблицаДанныхИзФайлаВБ.Выгрузить());
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.ПериодС));
		Запрос.УстановитьПараметр("КонецПериода", ?(Объект.ПериодПо = Дата(1,1,1), ТекущаяДата(), КонецДня(Объект.ПериодПо)));

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Число(Выборка.Сумма) > 0 Тогда 
				Если ЗначениеЗаполнено(Выборка.СерияНоменклатуры) Тогда
					Отбор = Новый Структура();
					Отбор.Вставить("СерияНоменклатуры", Выборка.СерияНоменклатуры);
					НайденноеЗначение = Объект.Товары.НайтиСтроки(Отбор);
					Если НайденноеЗначение.Количество() > 0 Тогда
						Если НЕ ЗначениеЗаполнено(НайденноеЗначение[0].ФНПродажа) Тогда
							НайденноеЗначение[0].ФНПродажа = Выборка.НомерФН;
						КонецЕсли;
						Если НайденноеЗначение[0].ФДПродажа = 0 Тогда
							НайденноеЗначение[0].ФДПродажа = Выборка.НомерЧека;
						КонецЕсли;
						Если НайденноеЗначение[0].ДатаЧекаККТПродажа = Дата('00010101') Тогда
							НайденноеЗначение[0].ДатаЧекаККТПродажа = Выборка.ДатаЧека;
						КонецЕсли;

					Иначе
						НовСтр = Объект.Товары.Добавить();
						НовСтр.Номенклатура               = Выборка.Номенклатура;
						НовСтр.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
						НовСтр.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
						НовСтр.УИН				          = Выборка.УИН;
						НовСтр.Размер                     = Выборка.Размер;
						НовСтр.Количество                 = Выборка.Количество;
						НовСтр.Вес                        = Выборка.Вес;
						НовСтр.Сумма                      = Выборка.Сумма; 
						Если Выборка.Весовой и НовСтр.Вес<>0 Тогда 
							НовСтр.Цена = Число(НовСтр.Сумма/НовСтр.Вес);
						Иначе 
							НовСтр.Цена = НовСтр.Сумма;
						КонецЕсли;
						НовСтр.ФНПродажа          = Выборка.НомерФН;
						НовСтр.ФДПродажа          = Выборка.НомерЧека;
						НовСтр.ДатаЧекаККТПродажа = Выборка.ДатаЧека;
					КонецЕсли;
				Иначе
					ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Товар с штрих-кодом: "+ Выборка.СерияТекст+ " не найден среди переданных на продажу или проданных");
				КонецЕсли;

			Иначе
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Товар с штрих-кодом: "+ Выборка.СерияТекст+ " содержит отрицательную стоимость");
			КонецЕсли;


		КонецЦикла;

	Иначе
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не удалось прочитать данные из файла");
	КонецЕсли;

КонецПроцедуры
