
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураДанных	= Новый Структура("Основание", ПараметрКоманды);
	ПараметрыФормы 	= Новый Структура("ЗначенияЗаполнения", СтруктураДанных);
    
    ОткрытьФорму("Документ.ВозвратПродукцииВПроизводство.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
